[
{"title": null, "link": "https://infosecwriteups.com/latest", "date": null, "content": "It was purely my experience , i respect other bug bounty hunters :) To execute this privilege escalation technique, you’ll need a beacon running… Advanced Persistent Threats (APTs) are among the most sophisticated and dangerous…", "category": ["bug bounty"]},
{"title": null, "link": "https://infosecwriteups.com/about", "date": null, "content": "A collection of write-ups from the best hackers in the world on topics ranging from bug bounties and CTFs to vulnhub machines, hardware challenges and real life encounters. Register for the much-awaited virtual cybersecurity conference #IWCON2022: https://iwcon.live/ #sharingiscaring", "category": ["hacker"]},
{"title": "Modded Versions of Popular Android Apps Used to Distribute New Variant of Necro Malware", "link": "https://infosecwriteups.com/modded-versions-of-popular-android-apps-used-to-distribute-new-variant-of-necro-malware-ccb3ccd8c57d?source=collection_home---4------23-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  recent investigation by Kaspersky has uncovered a new wave of malicious activity involving modded versions of legitimate Android apps like Spotify, WhatsApp, and Minecraft being used to deliver a fresh version of the Necro malware loader. In some instances, the altered apps were even found on the Google Play Store, with a combined download count exceeding 11 million. Among the apps identified as carriers of Necro malware are: While Max Browser has been pulled from the Play Store, Wuta Camera remains available, albeit with a clean version after a security update (version 6.3.7.138). The most recent version (6.3.8.148) was released on September 8, 2024, and is believed to be malware-free. Although the exact method of infection remains unclear, early indications point toward a rogue software development kit (SDK) that was likely introduced to enable advertising features within… InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["malware"]},
{"title": "\n      Americans Still Falling for Romance Scams, Survey Shows\n    ", "link": "https://www.cnet.com/tech/services-and-software/americans-still-falling-for-romance-scams-survey-shows/", "date": null, "content": "\n    Here's how to protect yourself from malicious online Romeos and femmes fatale.\n   Romance scams are real, and people are falling for them. Sometimes, as the song goes, love hurts. And that can be especially true if what you thought was a real relationship turns out to be a con job that costs you a ton of money. Unfortunately, that's the case for the thousands of Americans who fall for   each year. More than 66% of the people polled for a survey released Wednesday by the cybersecurity company Malwarebytes admitted to being targeted by romance scammers, with 10% of the victims reporting that they lost more than $10,000 and 3% saying they lost $100,000 or more. The pulse survey — a short questionnaire — was conducted between Aug. 5 and Aug. 15 and includes responses from 850 readers of Malwarebytes' newsletter from around the world. The survey results track with federal data. Last year, the   received 64,003 reports of romance scams. which accounted for $1.14 billion in losses, with the median loss per victim totaling $2,000. Those numbers may seem staggering, but they probably represent just a fraction of what romance scammers walk away with each year. Experts say many victims never report being scammed because they feel ashamed or don't think coming forward will do any good. Forty percent of those polled in the August survey by Malwarebytes said they never told anyone about being scammed, while just 11% said they reported their crime to law enforcement or a nonprofit group.  Romance scams themselves, also known as pig-butchering scams, are nothing new. Scammers reach out to victims online, often through social media and dating platforms, and strike up an online relationship. They'll often build trust over weeks or even months before asking for money or personal or financial information. Of those polled by Malwarebytes, 26% of victims said their relationship went on for \"an extended period,\" with 12% percent reporting them lasting for several months and 5% saying they communicated with their scammer for a year or more. But once the scammers got what they were looking for they disappeared, and the vast majority of those scammed (94%) said they never recovered the money they lost.  Read on for guidance on how to sidestep a trap.  There's no way to know who the people behind them actually are. If someone claims to be overseas or otherwise says they can't meet in person, consider that a big red flag.  The companies behind   because they're bad for an app's reputation. So they have algorithms and other safeguards in place that are designed to spot scammy behavior. Be wary if someone wants to move your communications to an outside messaging app like WhatsApp or Signal.  If someone you've never met in person asks for money to travel to the US to see you, to pay for medical care, or to help deal with a sudden tragedy, you should view it as a scam. The same goes for the key to your  .  Never send personal information like your Social Security number. If someone asks for naked or otherwise explicit photos, say no. The FTC says cases of \"sextortion\" — where cybercriminals threaten to send such photos to people's contacts if they don't pay — are on the rise.  People who use dating apps and sites are probably tech savvy enough to have a social media presence. Check it out. While you're at it, do a reverse image search of your potential date's photo. If it pops up in other places under a different name, steer clear.  Don't send your money or crypto to online friends who say they have a great investment opportunity for you, even if they promise epic payouts.  As always, set good  , use   and make sure your  ,   and   are all up to date. These basic practices will go a long way toward protecting you if you click on or download something you shouldn't.  If you do fall victim to a scam, report it to the   and  .", "category": ["malware"]},
{"title": "\n      Kids, Schools Face Rising Threats, Homeland Security Chief Says\n    ", "link": "https://www.cnet.com/tech/services-and-software/kids-schools-face-rising-threats-homeland-security-chief-says/", "date": null, "content": "\n    Threats are increasing, both online and in the physical world, as students and educators are confronted by school shootings, ransomware attacks and more.\n   Homeland Security Secretary Alejandro Mayorka. In an age of increasing physical and online attacks against children and their schools, the efforts of educators and other school professionals are crucial to providing a safe environment where kids can learn, US Homeland Security Secretary Alejandro Mayorkas said Wednesday. Speaking at the start of the 2024 National Summit on K-12 Safety and Security, Mayorkas pointed to the   in Georgia, which left two students and two teachers dead. That attack was one of more than 1,300 episodes of gunfire on school grounds that have occurred since the   in Connecticut nearly 12 years ago. Those attacks combined have resulted in at least 436 deaths and 936 injuries, he said. Mayorkas noted that kids already face a flood of emotions and challenges at the start of any school year. \"It is a tragedy that at too many schools across the country these last few weeks have also been defined by terror in the face of an attack,\" he said. Meanwhile, schools are also dealing with online threats, Mayorkas said. A cybercrime group claiming responsibility for a   says it stole 200 gigabytes of sensitive data like Social Security numbers, medical records and counseling reports. And it's threatening to post the data online if the group isn't paid a $1 million ransom.  And a group of men from Michigan, including a high school teacher, are facing charges for allegedly  , Mayorkas said. Mayorkas also pointed to the   in Springfield, Ohio, in the wake of   but viral claims spread on social media accusing the town's Haitian immigrant population of stealing and eating house pets. City officials and law enforcement say there's no evidence of cats and dogs being stolen and eaten. Nevertheless,  , pulling it into the national spotlight. The bomb threats against schools, government buildings and the homes of city officials in Springfield followed. They were all found to be hoaxes, but schools were forced to close and kids missed out on valuable classroom time. \"None of this should be normalized,\" Mayorkas said. \"Schools should be sacrosanct. Children need and deserve a nurturing environment to learn and grow and each of you deserve the ability to focus on what you do best: Teaching, caring for, and inspiring our children.\" The annual school safety and security summit, which is in its third year, is a two-day virtual event organized by the Cybersecurity and Infrastructure Security Agency. The summit brings together government officials, educators and other experts to talk about physical and online security threats against K-12 schools.", "category": ["ransomware", "cybercrime"]},
{"title": "\n      Cybersecurity Awareness Month: Time to Lock Down Your Logins\n    ", "link": "https://www.cnet.com/tech/services-and-software/cybersecurity-awareness-month-time-to-lock-down-your-logins/", "date": null, "content": "  \n    Online attackers are looking to capitalize on sloppy security. Here are easy ways to shore up your digital defenses.\n   October is Cybersecurity Awareness Month and a good time to batten down your online accounts. It's October -- AC is off in many parts of the country, \"spooky season\" is in full swing and many of us have already had our fill of pumpkin spice lattes for the year It's also  . And while 31 days of online safety might sound ridiculous, it's still a great time to take a hard look at your cybersecurity situation. That means setting strong and unique passwords for all your online accounts, enabling two-factor authentication whenever possible, installing those pesky software security updates and doing your best to keep as much of your private information, well, private. That all may sound daunting, but there's plenty of help out there for those looking for a place to start. The Cybersecurity and Infrastructure Security Agency just kicked off its month-long educational push entitled \" .\" It's designed to drive home the importance of basic cyber hygiene practices. The campaign's website includes helpful tools for consumers, small and medium businesses and all levels of government, CISA director Jen Easterly said in a statement. \"Protecting ourselves online is about taking a few simple, everyday steps to keep our digital lives safe,\" per Easterly. In celebration of Cybersecurity Awareness Month, here are a handful of easy tips from CISA and others to keep your online accounts safe.  need to be long, random and unique. New this year, the U.S. National Institute of Standards and Technology has  . The latest recommendations state that organizations don't need to require passwords to include a mix of character types. Plus, companies are no longer required to set mandatory time periods for changing passwords, such as every 30 or 90 days. Many security experts had argued that these kinds of requirements were counterproductive because they pointed people towards easily guessed passwords -- think P@$$w0rd or Bree2024!. On the flipside, while NIST still technically requires that companies mandate passwords of at least eight characters, it now recommends requiring passwords with at least 15 characters and up to 64.  Yes, that's a lot of characters, but to make things easier, you can use a passphrase of a handful of unrelated words strung together, such as \"GrandmafootballCheeseburgerhat\" or \"lamppostParisHotsaucetrophyhat.\" Avoid personal details that can easily be guessed or answered by Googling or mining social media. Your dog's name, the model of your first car or the university you graduated from may be important to you, but they're bad password material. Don't recycle your   and use them on multiple accounts -- no matter how good you think they are. That way, you limit the fallout if one of your passwords is compromised. That also goes for the personal questions and answers you use to reset those passwords. Need help? Sign up for a   It'll keep all your logins organized and secure. Using the password generator and manager built into your browser is OK too. While some of those options have been clunky in the past, they've gotten better. For example, you can now use Google's Chrome browser to autofill passwords into apps on an iPhone, as well as auto-generate new ones. If your password does get compromised, a second layer of protection will go a long way toward protecting your account.  , also called MFA, two-factor authentication and two-step verification, requires that someone trying to access your account enter a second form of identification before getting in. MFA works in a host of different ways. It could be a code generated by an app, a biometric like a fingerprint or Face ID, or a   that you insert into your device. Yes, MFA slows down the login process. But if MFA is available, turning it on is a must. One word of warning: If you can, avoid MFA systems that text a code to your smartphone. Why?  , in which cybercriminals steal your phone number by calling your wireless provider and having it switch your number to a new phone and SIM card. It does happen, and if criminals take over your phone number, they'll get that text message too. These days, many cyberattacks and data breaches -- both big and small -- start with a phishing attack. These are scam emails or other kinds of messages that try to trick people into handing over money or personal information under false pretenses. While most of them still show up as emails, phishing also now comes in the form of social media posts,   (smishing) and even   (quishing). These days, phishing is easier than ever thanks to the advent of readily available   like ChatGPT. They make it much easier for  , especially those who aren't native English speakers, to write nearly infinite numbers of  .   Attackers could be pretending to be a charity looking for donations to help the   or the  . They also could masquerade as a member of your office's IT team or a friend who wants you to check out a  . Regardless of their form, the objective is usually the same: The attackers are looking to steal credentials, money or personal information. It may seem old school at this point, but cybercriminals are still phishing for credit card information. Work-related logins are some of the most sought out by cybercriminals because they could potentially be used to access corporate systems and their data, but even the logins for your personal emails and social media accounts have value. If compromised, they could put you in danger of financial fraud or identity theft, or be used down the road in another scam. To avoid being scammed, experts say, ignore emails and other messages from people and groups you don't know, and don't open any attachments. They could contain computer viruses. If you're concerned about an email's authenticity, pick up the phone and call the person who supposedly sent it. Better yet, help stop phishing by reporting it. If you're concerned about a work email, let your company's IT staff know. There's probably a dedicated \"report\" button for phishing and junk within your email app. The same goes for your personal email and social media accounts.  Consumers should be particularly careful when it comes to requests for  . Though banks might be able to make you whole in cases of credit card fraud, the same doesn't go for  , which is designed to be largely anonymous and untraceable.  can go a long way toward protecting you, but it needs to be kept updated so it protects you against the latest threats. That goes for all of your devices too. Laptops, smartphones and your vast collection of internet-connected devices all need to stay up to date. The easiest way to do this is to enable automatic updates. That way you'll get the latest patches without ever having to think about it. Don't forget about your router. It's the front door to your home network, so best to make sure it's locked.", "category": ["security updates", "data breach", "phishing", "identity theft", "two-factor authentication"]},
{"title": "\n      Watch Out for Prime Day Scammers When Shopping\n    ", "link": "https://www.cnet.com/tech/services-and-software/watch-out-for-these-prime-day-scams/", "date": null, "content": "  \n    Online scammers are looking to take advantage of eager shoppers. Here's how to protect yourself.\n   Watch out for scammers when shopping for Prime Day deals. Amazon's   is here, but shoppers on the hunt for great deals need to be careful that they don't get scammed in the process. Cybercriminals will be looking to use the massive online event as an opportunity to con unwitting shoppers out of their money and personal information. Ahead of the sale, which runs through Wednesday, researchers for the cybersecurity firm Check Point say they've spotted 1,000 new Amazon-related domains over the past 30 days and about 88% of those appear to be potentially malicious or scammy.  While Check Point says many of the sites appear to be \"parked,\" meaning that they're not currently being used for a website or email hosting service, they could be used as part of a phishing scheme. Some of the fake sites are designed to look just like Amazon. Unwitting shoppers reach them when they click on links in phishing emails, SMS messages or ads posted on social media. An example of a scam email spotted by Check Point. That's not exactly shocking. Amazon says scam activity traditionally spikes during the days surrounding Prime Day events. Oftentimes, consumers will receive messages saying that there's a problem with their Amazon account that needs to be fixed right away or they'll risk missing out on those limited-time offers. Other messages might claim that there's a problem shipping an item or are designed to look like an order confirmation for a very expensive item that the customer didn't buy. According to Amazon, nearly half of the impersonation scams reported to it worldwide were fake messages from scammers about fraudulent orders that didn't exist.   Regardless of their specific pitch, the objective of the scams is to steal payment card information or Amazon account usernames and passwords. And that could prove disastrous for shoppers who might not think before they click. An example of a spoofed Amazon website designed to scam consumers. Amazon-related scams aren't relegated to just Prime Day and aren't a new thing.  , Amazon was the second-most impersonated company in 2023. Scammers pretending to be Amazon accounted for 34,000 complaints and $19 million in losses reported to the commission. And it's not just Amazon. Scammers also try to pass themselves off as tech support for companies like Microsoft,  , shipping companies such as UPS and officials from government agencies like the IRS. Security experts say it's Amazon's widespread popularity makes it a top choice for scammers. If a consumer gets an email that looks like it's coming from a bank they don't have an account with, they're probably going to delete it right away. But just about everybody has an Amazon account, making scam emails featuring Amazon significantly more convincing. Outside of the holiday shopping season, Amazon's Prime Day events are some of its biggest sales days of the year and cybercriminals will be looking to capitalize on that. That means shoppers are going to need to be especially on guard as they look for deals.  And many Prime Day offers feature big price cuts and disappear fast, making it more likely that shoppers will click before they think. But that's exactly what they need to do. Here are a handful of tips from Amazon and Check Point for how to stay safe while shopping for Prime Day deals. If a site's address doesn't start with \"Amazon.com,\" it could be a fake. The same goes for other online retailers. Look for misspellings, additional punctuation and anything else that might seem a little off in the address. Amazon will never ask for payment over the phone, by text or by email. It also won't ask you to make them by bank transfer or through a third-party site. You're better off typing in the URL directly than clicking on a link that might be shady. If a message says you ordered something that you think you didn't, skip the link and just check \"My Orders\" in your Amazon account to see if that's true.  Hard-to-crack passwords are musts for all retail sites. That means they need to be long, unique and random. Don't be tempted to recycle even a great password if you've used it for another account. And whenever possible, enable two-factor authentication. Adding this extra form of authentication could save your bacon if your password does end up compromised.  Yes, a lot of Prime Day deals are limited-time, but any offer that says you need to buy right away needs a closer look. Cybercriminals are banking on you clicking before you think. Any legitimate retail site uses SSL encryption by now. It's signified by a lock symbol at the start of the URL. If it's missing, shop elsewhere.  If fraudulent charges show up, you won't be on the hook for the cost.   Most email programs have buttons that let you report spam or phishing. Scam text messages can be reported by forwarding them to 7726 (SPAM). Prime Day scams should be reported to Amazon through their app or  .  Yes, we've heard this so many times it's officially a cliche, but any mind-blowingly amazing deal should be treated like a scam, because it probably is. If you can't verify it on the company's site, steer clear. ", "category": ["phishing", "encryption", "two-factor authentication"]},
{"title": "Best Identity Theft Protection and Monitoring Services for October 2024", "link": "https://www.cnet.com/personal-finance/identity-theft/best-identity-theft-protection/", "date": null, "content": "We scoured dozens of identity theft protection services available today. These eight stuck out to us as the very best. Danni Santana Editor Danni Santana has spent seven years as an editor and business journalist covering industries like sports, retail, restaurants, and now personal finance. Most recently he worked as a retail editor at Business Insider.\r\n\r\nHe is a graduate of the Craig Newmark Graduate School of Journalism at CUNY. His biggest loves outside of the newsroom include, running, cooking, playing video games and collecting sneakers. Courtney Johnston Senior Editor Courtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor. \n    CNET staff -- not advertisers, partners or business interests -- determine how we review the products and services we cover. If you buy through our links, we may get paid.\n   Danni Santana Editor Danni Santana has spent seven years as an editor and business journalist covering industries like sports, retail, restaurants, and now personal finance. Most recently he worked as a retail editor at Business Insider.\r\n\r\nHe is a graduate of the Craig Newmark Graduate School of Journalism at CUNY. His biggest loves outside of the newsroom include, running, cooking, playing video games and collecting sneakers. Courtney Johnston Senior Editor Courtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor. \n    CNET staff -- not advertisers, partners or business interests -- determine how we review the products and services we cover. If you buy through our links, we may get paid.\n   CNET editors independently choose every product and service we cover. Though we can’t review every available financial company or offer, we strive to make comprehensive, rigorous comparisons in order to highlight the best of them. For many of these products and services, we earn a commission. The compensation we receive may impact how products and links appear on our site.", "category": ["identity theft"]},
{"title": "\n      Best Password Manager in 2024\n    ", "link": "https://www.cnet.com/tech/services-and-software/best-password-manager/", "date": null, "content": "\n        Article updated on    \n    Your passwords are sensitive information, keep them safe with an extra layer of protection. These are the best password managers we've tested.\n   CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. \n      What to consider\n     \n      Security\n     Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. \n      Price\n     Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user.  \n      Cross-platform compatibility\n     Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. \n      Features\n     Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring.  \n      Secure sharing capabilities\n     Most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager.  \n      Secure file storage\n     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. \n      Family plan allowance\n     If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. \n      What to consider\n     \n      Security\n     Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. \n      Price\n     Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user.  \n      Cross-platform compatibility\n     Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. \n      Features\n     Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring.  \n      Secure sharing capabilities\n     Most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager.  \n      Secure file storage\n     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. \n      Family plan allowance\n     If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. Looking for an easy way to keep track of your passwords while keeping them secure? A good password manager might be exactly what you need. If someone gets a hold of your passwords, a lot could go wrong. The best way to keep your information safe is to use a different password for each account. With the number of passwords you would need, it would be easy to forget a few. With a password manager, you don't have to worry about remembering them all. Secure passwords are ideally a complicated and unique combination of letters, numbers and characters. Because of this, the more secure your password, the tougher it will be to remember. A password manager will not only generate these for you -- and make them as randomized as can be -- but it will also eliminate the fear of losing them. You'll still use a master password, but it's only one to remember. There are a lot of options out there, so CNET tested a dozen of the most popular password managers on the market. Whether you're looking for a free password manager or you're open to spending a little money, we've evaluated everything from encryption to pricing, features, platform compatibility, privacy policies and company history to make picking the best secure password manager easier for you. Based on that rigorous testing,   is currently CNET's top pick for the best password manager, thanks in part to its commitment to transparency and its unbeatable free tier. Bitwarden is a solid choice if you want well-rounded premium password management that's secure, transparent, budget-friendly and easy to use -- or if you want a legitimately unlimited password management solution for free. There is also a desktop app and a mobile app you can use for easier access.  Bitwarden scores points for being fully open-source, secure and   by third-party cybersecurity firms, giving it a level of transparency that sets it apart from its peers. Meanwhile, its free plan lets you store an unlimited number of passwords and use them across an unlimited number of devices, which is unique for the industry. That’s in addition to many top-tier features like secure password sharing, encrypted vault export and a username and password generator. For those willing to pay for a premium plan, Bitwarden offers full vault health reports, 1GB file storage, emergency access (where you can designate a trusted contact to access your vault in case of an emergency), Bitwarden authenticator and advanced multifactor authentication with YubiKey, FIDO2 and Duo. Premium plans are budget-friendly at $10 per year for individuals and $40 per year for families, which allows for up to six users. 1Password is a breeze to use on all your devices and includes some handy extras. The user interface is slick and intuitive, and its autofill functionality works seamlessly. Sharing passwords and other vault items with others is also simple, even if the people you’re sharing them with aren’t 1Password users. One stand-out feature is Travel Mode. When activated, vault items that you haven't marked as \"Safe for Travel\" will be temporarily erased from the app on all of your devices. This helps keep particularly sensitive login information or financial information inaccessible to any authorities who may ask you to unlock your device for inspection. 1Password is slightly on the more expensive side at $36 per year for individual users or $60 per year for families. There's no free plan.  Like other top password managers, Keeper lets you store and sync an unlimited number of vault items across an unlimited number of devices. The number of platforms you can use the service on is a little more limited than most other password managers. Another great feature is its “offline mode,” which allows you to access your vault items even if you're somewhere with zero or limited internet access.  Keeper offers a very limited free plan that covers only one mobile device. Standard pricing is $35 per year for individuals and $75 per year for a family of five. NordPass is well-designed, easy to navigate and works seamlessly across all platforms. The free version lets you store an unlimited number of vault items across all of your devices and you get access to additional basic features like a password generator, advanced multi-factor authentication,   and automatic sync. Users on the free plan can be logged into only one device at a time.  Premium plans also include password health reports, data breach scanner and monitoring, secure sharing, emergency access and the ability to attach files to vault items totaling up to 3GB. Prices can fluctuate, but the company is currently charging $43 for a 2-year plan or $28 for a 1-year plan. While Dashlane's password generator isn't quite as robust as what others offer, it works well and offers sufficient options for customization. Premium plans also include access to a virtual private network from  , a middling VPN that didn't crack our list of  . Dashlane's family plan covers up to 10 users, but for most people, 10 users is probably overkill and not worth the $90-per-year cost. There is a free plan, but it's limited to a single device and  . Enpass is unique in that it doesn't have centralized servers that store your data. You can either store your vault on your devices themselves or in your personal cloud storage like Dropbox or iCloud. That makes it a great option for anyone who wants complete control over the storage of their password manager vaults. On the downside, the app is a bit outdated and clunky but still fully functional. KeePass is completely open source and completely free. It's a powerful password manager but geared primarily toward the techie crowd. Regular people may find the interface outdated and cumbersome to navigate compared with those of other password managers. Apple’s built-in password manager for Macs and iOS devices is a secure and convenient solution that includes basic features like storing and auto-filling your passwords and other items like credit card numbers and passkeys. It lacks the full breadth of options offered by other premium password manager solutions. LastPass is one of the most well-known and popular password managers on the market. In light of its lengthy history of security incidents -- including the   in which an \"unauthorized party\" stole customer account information and sensitive vault data -- CNET can't in good conscience recommend LastPass to our readers. While the company says it’s since boosted security, the alarming nature of that latest data breach has severely undermined trust in LastPass products. CNET will conduct a thorough re-review of the service in the future, after which we will reevaluate whether LastPass should return to our list of best password managers. In the meantime, you can turn to any of the password managers featured above. The most important consideration for any password manager is the security of the product, so we look at what encryption standards it uses, whether it's a zero-knowledge service and whether it has been independently audited.  We carefully examine each provider's privacy policy to get a sense of what personal data is collected from users and how that data is secured. We examine the provider's pricing and check whether a free version is available. We also test how the password manager performed across platforms, devices and operating systems. We test the services' multi-factor authentication, password generator and secure sharing features and evaluate the overall look and feel of the UI, including monitoring and password health reporting, if applicable. With the numerous password manager options available, it can be overwhelming to choose the right one. CNET has thoroughly tested dozens of password managers over the years, and we've developed a pretty good idea of the types of things to look for in a quality service. Here are the most important things to consider when choosing a password manager: You're putting a ton of trust in your password manager to keep your logins safe, so the security of the service should be your top concern. Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. While you're researching password managers, it's important to consider the company behind the service. Has the company been involved in any security incidents that have potentially compromised user data? If so, it's best to look elsewhere.   Pricing for password managers can vary from provider to provider, so you'll want to pick a service that will fit your needs and budget. Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user. Many password managers also offer free tiers, but they almost always come with limitations on features or device allowance. Some services, like Bitwarden, allow for unlimited vault entries on unlimited devices on their free plan. Most password managers also offer either a free trial or a money-back guarantee, so you can try them risk-free.    One of the most important aspects of using a password manager is having it available on all of the devices you use. Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. This helps ensure that you can access your passwords at any time from any of your devices.  Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring. Many password managers also allow you to store things like credit card numbers, bank account numbers, health data, PIN codes and secure notes in addition to storing your online login credentials.   It's never a good idea to share passwords or other highly sensitive information via email or SMS, but most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager. Secure sharing features are also typically customizable and allow you to set restrictions on how many times a shared vault item can be accessed or for how long. If you're planning on sharing certain passwords with family members, friends or colleagues, it's a good idea to check on the password manager's secure sharing capabilities to ensure they suit your security needs.     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. Depending on whether you need to store files and how much space you would need, it's a good idea to look into the secure file storage capabilities and allowances of the password manager you're considering. If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. A family plan is a convenient and cost-effective option for anyone who wants to easily and securely share vault items with trusted contacts. After signing up for a password manager, you'll be prompted to create a master password. Your master password should be a strong password or passphrase that you can remember but haven't used for any other logins. The master password is the one password you need to access your password manager vault. The next step is to download the app or browser extension to the devices you plan to use the service on. You can also opt to use the web-based user interface if you prefer (if offered by the service you choose). Once you've signed up and gotten acquainted with the app, start adding passwords and other vault items you want to keep secure. If you have passwords stored in a web browser or other password manager, you can easily import them to the new password manager. You also can manually enter the login credentials, or you can have your password manager automatically save your credentials when you log into one of your online accounts. Once you've got your passwords saved, you can use your password manager to autofill the login credentials for the accounts you have stored in your vault. Password managers are extremely attractive targets for cybercriminals -- and yes, they can be hacked. All of the password managers listed above operate on a zero-knowledge approach to password management, meaning that not even the company storing your vault data can decrypt the information contained within. Only the user can decrypt and access their vault. Similarly, the password managers featured above don't have access to your master password.  All of this makes it difficult for an attacker to gain access to the passwords and other items in your vault. In the case of the 2022 LastPass breach, attackers were able to steal encrypted user vaults. So all the attacker would need to do is crack the master password for a stolen vault to access everything inside, which would be an easy task if the master password is weak. The best way to protect your data in case of a similar breach is to create a strong master password. A strong password should ideally be a minimum of 12 characters. You can also create passphrases that consist of randomly strung-together words. The best password managers offer customizable password generators that you can use to create truly random passwords and passphrases based on the criteria you select. The longer and more complex the password or passphrase, the better. There are a few legitimate free password manager options for anyone who wants to securely store their passwords without paying a dime. Bitwarden is CNET's recommendation for the best free password manager. NordPass is another option and if you're more technically inclined, you can go with KeePass, which is completely free and unlimited but not as easy to use as many others.", "category": ["data breach", "encryption", "dark web"]},
{"title": "\n      Marriott to Boost Data Protection Practices as Part of Deal With FTC\n    ", "link": "https://www.cnet.com/tech/services-and-software/marriott-to-boost-data-protection-practices-as-part-of-deal-with-ftc/", "date": null, "content": "\n    The agreement settles charges stemming from a trio of data breaches that compromised the personal information of more than 344 million customers.\n   Marriott says it's beefing up security per the FTC's order. Marriott International and its Starwood Hotels & Resorts Worldwide subsidiary will put in place a \"robust\" new data security program to settle charges that its poor security practices led to a trio of data breaches that affected more than 344 million of its customers, the US Federal Trade Commission said Wednesday. As part of the   (PDF), the hotel chain also agreed to give US consumers a way to request deletion of personal data tied to their email address or loyalty rewards account number. Marriott also will be required to review loyalty rewards accounts upon customer request and restore stolen loyalty points. The data breaches, which took place between 2014 and 2020, included a massive theft detected in November 2018 where cybercriminals  , compromising 339 million customer accounts and  .   Customer data exposed in the other breaches included names, addresses, emails, payment card information, phone numbers and birthdays as well as loyalty account details and information like room preferences.  In addition, under a  also announced Wednesday, Marriott agreed to pay a combined $52 million to 49 states and the District of Columbia to settle similar charges. The FTC does not have legal authority to impose civil penalties in the case. \"Marriott's poor security practices led to multiple breaches affecting hundreds of millions of customers,\" Samuel Levine, director of the FTC's Bureau of Consumer Protection, said in a statement. \"The FTC's action today, in coordination with our state partners, will ensure that Marriott improves its data security practices in hotels around the globe.\" Marriott said in a   that many of the security and privacy requirements being imposed by the FTC have already been put in place or are in progress. \"Protecting guests' personal data remains a top priority for Marriott,\" the company said. \"These resolutions reaffirm the company's continued focus on and significant investments in maintaining and adapting its programs and systems to assess, identify and manage risks from evolving cybersecurity threats.\"   In its proposed complaint, the FTC charges that Marriott and Starwood didn't do enough to protect their customers' data from online thieves. Specifically, the FTC says that among other failures, they didn't put in place adequate password, access and firewall controls. The FTC also says the companies didn't properly segment their network systems, which would have helped protect data in the event of a breach. And they didn't patch outdated software and systems, or put in place adequate multifactor authentication. Those lax practices combined allowed cybercriminals to breach the systems and steal massive amounts of customer data, the FTC says. The commission voted 3-0 with two members abstaining to issue the administrative complaint and to accept the proposed consent agreement. The agreement will be published in the Federal Register and subject to public comment for 30 days. After that period, the commission will decide whether to make the proposed consent order final.", "category": ["data breach"]},
{"title": "\n      Online Scammers Looking to Cash In on Hurricane Milton Disaster\n    ", "link": "https://www.cnet.com/tech/services-and-software/federal-officials-warn-of-scammers-looking-to-cash-in-on-hurricane-milton-disaster/", "date": null, "content": "\n    Disaster and tragedy bring out the worst in some people. Here's how to protect yourself from criminals both online and in person in the wake of a natural disaster.\n   If you need help, make sure you're getting it from the right people. In the wake of Hurricane Milton, federal officials are warning consumers to be on the lookout for scammers both in person and online who will try to take advantage of what will likely be a terrible situation for many people. , Milton made landfall near Siesta Key, Florida, as a Category 3 storm Wednesday night then raked across the state before reaching the Atlantic Ocean. Wind speeds topped 100 mph in the Tampa, Sarasota and St. Petersburg areas. On Wednesday the Federal Trade Commission, the Department of Justice and the Consumer Financial Protection Bureau   those affected by the storm, as well as the well-meaning people trying to help them. The FTC says scams could come in the form of fraudsters impersonating hurricane-aid charities. At the same time, the commission is already getting reports of price gouging related to storm necessities like hotels, groceries and gas. \"No American should have to worry about being ripped off when fleeing a hurricane,\" FTC Chair Lina M. Khan said in a statement. \"In partnership with state enforcers, the FTC will keep fighting to ensure that Americans can get the relief they need without being preyed on by bad actors exploiting a crisis.\" Meanwhile, the Cybersecurity and Infrastructure Security Agency released a separate advisory warning of potential online scams that could come in the form of emails, messages on social media, texts, phone calls or even a knock on their door from an actual person. In addition to possibly impersonating a charity, scammers might also pose as government officials or storm victims themselves, CISA says. It urged consumers to exercise caution and make sure that they're dealing with legitimate people and groups before handing over any money or personal information. Here's some advice from the FTC, CISA and others for how to protect yourself from scammers in the wake of Hurricane Milton. If the message is coming from a person or group you haven't dealt with before, don't respond. Stick to major charitable organizations that you know are legitimate. Go directly to their website. Avoid clicking on links in emails and other kinds of messages. Don't click on attachments. They could contain malware.  Admittedly, a lot of people are going to need help fast, but if the experts are right, this is going to be a long rebuilding process. Real charities will happily take your money after you've verified their legitimacy. Criminals, on the other hand, want you to hand it over before you have a chance to think about it.  Scammers will often create messages and sites that look just like those of real charities and organizations, but just a little different. If something seems off about a logo, font or an email or web address, find a different site.  Admittedly, it can be tough, but the   for how to figure out if a group is legit or not including links to organizations that can help you do research.   If you need help or information, consult your local officials or national disaster response organizations including the   and the Department of Homeland Security's  . Government officials, including those from FEMA, will never ask for money in exchange for disaster relief. Be wary of people promoting non-existent businesses or investment opportunities related to disaster recovery, such as rebuilding or flood-proofing. Requests for payment in the form of a wire transfer, gift card, payment app, cryptocurrency or in cash are also red flags.  Give the FTC a heads up by reporting fraud, scams and bad business practices at  . You also can report them to the FBI's  .", "category": ["malware"]},
{"title": "\n      Security Experts Warn Gmail Users of More Sophisticated AI Hacks\n    ", "link": "https://www.cnet.com/tech/services-and-software/security-experts-warn-gmail-users-of-more-sophisticated-ai-hacks/", "date": null, "content": "\n    The scams can target Gmail accounts, many of which are part of Google Workspace's 3 billion users.\n   Google recently helped launch the Global Signal Exchange platform to identify phishing attempts and fraud. Security experts are warning that AI-driven phishing attempts and scams targeting Gmail accounts are getting harder to detect and much more sophisticated. The attempts can include fake notifications from real Google addresses, convincing phone calls from AI or human agents that appear to come from legitimate Google phone numbers and links pointing to Google pages that serve to make the scam seem legitimate. In September, Microsoft products security expert Sam Mitrovic  . Y Combinator CEO Garry Tan   about a similar phishing attempt he encountered.  Cybersecurity writer Davey Winder  , as well as information about how scammers are using Google Forms as another method of fooling people with Google accounts. In an email to CNET, a spokesperson for Google   that offers advice on how to avoid email scams, phone and text scams, and scams that can occur during web browsing. Google recently helped begin efforts on a   with the Global Anti-Scam Alliance and DNS Research Federation to create a database of scam and fraud attempts. The Exchange   from Amazon, Meta, Mastercard and Trend Micro and will initially focus on URLs, IP addresses and reports of scams and phishing attacks. It's set to launch officially on January 1, 2025. According to Winder, two ways Gmail users can help protect themselves are to   (including what to do if  ). Users who are more likely to be targeted, including politicians and journalists, should look into  , which can include the use of a hardware security key (basically a device such as a secure USB drive for logins). Google   to the program.", "category": ["phishing"]},
{"title": "The Hidden Gem of Pentest Certifications in 2024", "link": "https://infosecwriteups.com/the-hidden-gem-of-pentest-certifications-in-2024-67fa7a5b57cc?source=collection_home---4------19-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share Non-members can  . Do you need to tick off a box on your CV, or do you actually want to learn penetration testing? Are you thinking of getting into bug bounty programs? Do you want to start off strong in the most sought-after specialization within pentesting, Web Pentesting? Whatever your goal is, this is probably the best certification you can start on, and I’ll tell you why: Burp Suite Certified Practitioner ( The article can be found in video format here: I recently wrote a  , where I was rather skeptical about most popular pentesting certifications. This is due to them teaching you what many other pentesters already know (AD, Network Pentesting), and usually being expensive. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["penetration testing", "bug bounty"]},
{"title": "The Firefox Privacy Paradox: How to Balance Convenience and Security", "link": "https://infosecwriteups.com/the-firefox-privacy-paradox-how-to-balance-convenience-and-security-98557f5c8e19?source=collection_home---4------18-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share These days, keeping your personal information safe online is more important than ever. Your browser is one of your main tools for staying secure, but many of the best privacy features are hidden in the settings. In this article, we’ll show you easy changes you can make to protect yourself from tracking, data leaks, and other online risks. Whether you’re worried about being followed online or just want to boost your security, these simple tweaks will help you turn your browser into a strong shield. ✅ Security-focused, reduces unintentional access. : ✅ Enhances protection against tracking by preventing fingerprinting techniques. ✅ Enables you to make informed decisions about certificate errors. ✅ Prevents malicious autoplay, enhances privacy. : ✅ Blocks cross-site tracking by isolating cookies, which reduces the ability of third parties to track your online activity. ✅ Great for preventing phishing attacks. ⚠️  . Disabling the built-in PDF viewer forces external apps to open PDFs. While this reduces potential exposure to vulnerabilities in the built-in viewer, external PDF readers could introduce other vulnerabilities. If you’re using a secure PDF viewer, this is fine. ✅ Great for preventing fingerprinting. ✅ Prevents WebGL-based tracking and some security exploits. : ✅ Helps block known trackers and improves privacy while browsing. : ✅ Ensures that only secure SSL/TLS connections are accepted, protecting against certain attacks. : ✅ Validates SSL certificates, reducing the risk of connecting to fraudulent sites. : ✅ Restricts cookie access to enhance privacy, especially from third-party trackers. ✅ Disabling remote experimentation. : ✅ Prevents tracking of clipboard events, enhancing privacy. ⚠️  . Disabling memory caching may reduce performance slightly. If performance is a concern, this can be left enabled. ✅ Prevents icon-based tracking. ✅ Prevents favicon tracking in desktop shortcuts. : ✅ Disabling DRM can reduce potential vulnerabilities, although it may limit access to some content. ✅ Good for disabling persistent storage tracking, but may break some site functionality. ⚠️  . Disabling JavaScript will break most websites. If security is your utmost concern, this is fine, but it will result in a non-functional experience on many websites. Consider using tools like  or  to selectively enable JavaScript on trusted sites instead. ✅ Reduces media-based tracking. : ✅ Stops background data sending, which protects your information. ✅ Disables prefetching, preventing unnecessary connections. ✅ Limits WebSocket reconnection attempts, reducing the chance of exploitation. ✅ Prevents PDF caching, reducing potential data leaks. : ✅ Reduces the risk of fingerprinting through GPU information. ✅ Keeps cookie behavior settings device-specific. ✅ Prevents cookie lifetime policies from being synced across devices. ✅ Disabling disk caching prevents sensitive data from being stored on disk. ⚠️  . Disabling this can reduce security against malicious downloads, as Safe Browsing protects users from known threats. ✅ Prevents click tracking. : ✅ Prevents websites from accessing sensitive sensor data, enhancing privacy. ✅ Disables Pocket integration, reducing tracking. ✅ Disables geolocation to enhance privacy. ✅ Disables WebRTC to prevent IP leakage during peer-to-peer connections. : ✅ Stops automatic filling of forms, reducing the chance of storing sensitive information. : ✅ Blocks tracking through battery status, which can be used for fingerprinting. : ✅ Reduces unnecessary DNS requests, enhancing privacy. : ⚠️   While they enhance security, disabling them can reduce protection against malware and phishing. Use an alternative security solution if you choose to disable these. ✅ Prevents fingerprinting via fonts. ✅ Disables referrer headers, enhancing privacy by not leaking browsing history. ✅ Disabling bidirectional text support reduces the attack surface, although this might affect certain internationalized websites. ✅ Setting this to   allows only first-party cookies, which greatly improves privacy by blocking third-party trackers. : ✅ Forces the use of secure TLS versions, ensuring encrypted connections. These additional settings, when combined with your current setup, provide even greater security and privacy while browsing. However, like the previous settings, some of these can impact website functionality. Test them to find the right balance between privacy and usability that suits your needs! InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["phishing", "malware"]},
{"title": "Prototype Pollution: How a JavaScript Quirk Can Lead to Complete Application Takeover", "link": "https://infosecwriteups.com/prototype-pollution-how-a-javascript-quirk-can-lead-to-complete-application-takeover-9adb5e4f6b6b?source=collection_home---4------17-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  is a severe vulnerability that targets JavaScript applications, allowing attackers to modify the behavior of an application by injecting properties into the object prototype. This vulnerability can lead to arbitrary code execution, data manipulation, or even complete takeover of an application, especially when combined with other weaknesses. While often overlooked, prototype pollution is a powerful attack vector, making it essential for developers and security professionals to understand how it works and how to prevent it. JavaScript uses a concept called   to handle inheritance. Every object in JavaScript is linked to a prototype, and changes made to the prototype object can affect all instances of that object type. Prototype pollution occurs when an attacker can inject properties into these prototypes, allowing them to manipulate the behavior of the entire application. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Critical Vulnerabilities in DrayTek Vigor Routers: Over 700,000 Devices Exposed to Remote Exploits -$$$$ Bounty", "link": "https://infosecwriteups.com/critical-vulnerabilities-in-draytek-vigor-routers-over-700-000-devices-exposed-to-remote-exploits-2f3f731b50d9?source=collection_home---4------13-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  series of critical vulnerabilities have been discovered in DrayTek Vigor routers, potentially affecting over 700,000 devices globally. These vulnerabilities include remote code execution (RCE), XSS, Information disclosure ,privilege escalation, and authentication bypass etc, which could allow attackers to take full control of the affected routers. Exploiting these flaws could lead to network breaches, data theft, and further attacks on connected systems. Forescout’s analysis revealed that over 704,000 DrayTek routers have their Web UI exposed to the internet, creating a rich attack surface for malicious actors. The majority of these exposed instances are located in the U.S., followed by Vietnam, the Netherlands, Taiwan, and Australia. “  addresses a buffer overflow vulnerability in the ‘GetCGI()’ function of the Web UI, which can lead to a denial-of-service (DoS) or remote code execution (RCE) when handling query string parameters. Another critical vulnerability,   involves an OS command injection flaw in the ‘recvCmd’ binary, used for communication between the host and guest operating systems.” InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Sensitive Data Leak using Cors Misconfiguration in prominent Domain Registrar", "link": "https://infosecwriteups.com/sensitive-data-leak-using-cors-misconfiguration-in-prominent-domain-registrar-b3010e4e6501?source=collection_home---4------12-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hello Guys, Hope Everything’s fine. This article is about Cors misconfiguration bug which i found in different api endpoints/api subdomains of prominent domain registrar. I worked with this program for almost more than year and reported totally 25 bugs which secured me 7th rank on their Global Leaderboard. Out of 25 ,16 bugs were just CORS issue on different endpoints. They self duplicated four or five reports and paid for rest of the bugs. Before starting about the vulnerability let me me tell you about the infrastructure of this program. This is private program and contains a lot of subdomains. It has structure like for example there is a feature for cart then all the api request associated with the cart would go through “cart.api.example.com” similarly for the rest functionality like payment would use “payment.api.example.com”, domain functionality would use “domains.api.example.com” , social media connection would use “social-sdk.api.example.com” and more. So while testing for bugs, I found CORS issue site-wide which contains regex validation misconfiguration and some endpoints allowed even null origin. I would cover Regex issue below. For those who are not familiar with what is CORS and how CORS misconfiguration could be exploited , I would recommend below article from Portswigger portswigger.net Now, You are aware with what is CORS and How its misconfiguration could be exploited ,let’s get back to our Bug. There was a functionality to add item to cart and once user/victim add any item to cart it was added to Basket. API request for basket was GET XHR “ ” Sever was validating Origin header and preventing null origin or any other cross origin. It was accepting request from origin like example.com or subdomain.example.com like cart.example.com,payment.api.example.com and more. So far so good, everything is as expected and looks secure so where is the BUG??? Server was using regex to check the origin and issue was that it was checking only origin header should end with “example.com” . For example, there is subdomain cart.api.example.com so request would bypassed using origin with the cartaapiaexample.com which ends up with example.com hence would bypass regex check and attacker could fetch victim’s response containing sensitive data. We know the BUG now but challenging task is how to create POC (Proof of Concept) which proves it is exploitable in real world. Let me describe below what setup i did to host poc and exploit it. I configured xampp server in my local system as referred below,set the host entry with testexample.com pointing to 127.0.0.1 and lastly moving cart_cors_fetch.html(poc) file to htdocs . www.c-sharpcorner.com POC file was containing below config. Now, I logged in as a victim in browser and run POC in another tab using url “http://testexample.com/cart_cors_fetch.html” . As seen above request went through our hosted domain and response was received at attacker server which contains victim’s phone,email,address,cart items and more Similarly, I was able to demonstrate that social api allows to fetch victim’s social connection information , social ads api allows to fetch victim’s campaign details ,seo api allows to perform seo operations behalf of victim,payapi allows to fectch victim’s payment details ,address,email,phone and more other endpoints . Hope this article was informative and would helpful in your learning journey. Thanks for reading. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Uncovering 0-Days: The Crucial Role of RFCs in Vulnerability Research and the Recent Windows TCP/IPv6 Exploit", "link": "https://infosecwriteups.com/uncovering-0-days-the-crucial-role-of-rfcs-in-vulnerability-research-and-the-recent-windows-de6b7538e54f?source=collection_home---4------11-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hey everyone, it’s been a while since I last posted! If you were expecting this to be a continuation of my previous series on malware development, sorry to disappoint — it’s not :) I promise I’ll get back to that soon. But as the title suggests, this post is all about the importance of understanding RFCs, especially if you’re diving into vulnerability research. Why this topic, you ask? Well, I was watching a stream by   where Stephen and Chompie were discussing  , and they brought up RFCs. It made me realize how crucial they are for anyone starting out in vuln research — or even those who are already in it. So, here we are! Huge shoutout to  and  for the inspiration. Let’s dive in, and I hope you enjoy the read!  , but I promise it won’t be boring. If you’ve been in the vulnerability research space for a while or are just starting out, you’ve probably come across   — but have you ever really dug into what they mean and why they’re critical for both developers and security researchers? Understanding RFCs is like having a map to the core of how the internet works. More importantly, they can point you to where things might go wrong (Trust me, it always helps in identifying 0days). In this post, we’ll break down what RFCs are, why they’re essential in the field of vulnerability research, and we’ll end with a real-world example — a serious vulnerability in   driver that came to light due to poor implementation of an RFC related to  . According to our old friend  ,   are formal documents that outline the standards, specifications, and protocols governing the internet and computer networks. They are published by organizations like the   and the  . RFCs describe how technologies like  ,  , and   should be implemented and how they should behave under various circumstances. I can understand it doesn’t make much sense so here is my understanding of it. You may ask.. Ok, But how they actually helps in Vulnerability Research? Well, When researching vulnerabilities in protocols, RFCs act as the foundational reference. If a developer doesn’t strictly adhere to an RFC or skips over certain edge cases, it can result in unintended behavior, which can lead to bugs. These bugs can range from  to something far more critical, like  . Let’s break down some specific ways understanding RFCs helps in vulnerability research: : This blog reflects my current understanding of the Windows TCP/IPv6 vulnerability and its relationship to RFC 8200. If I’ve misunderstood or misrepresented any part of the implementation or RFC, I’m happy to be corrected and update this post. Please feel free to reach out if you spot any inaccuracies! Yes, We are going to talk about Windows TCP/IPv6 CVE in tcpip.sys driver. But I am not going to dig deeper into the actual vulnerability or exploitation of this bug as there are multiple blog posts that talked about this in a great manner. I will leave the links for those blogs as references at the end of this blog post. Here, we will be focusing on how poor understanding of RFC led to this bug. As we all know, the   that recently made headlines, discovered in the   driver. This vulnerability is a textbook case of what can happen when the implementation of a protocol deviates from the RFC. It’s also a great illustration of why you, as a vulnerability researcher, need to understand RFCs when dealing with network protocols. :   is the driver that handles network communication in Windows. It deals with both   and   traffic, making it a crucial part of the Windows networking stack. IPv6, defined by  , introduces a lot of new functionality over IPv4, including   that allow additional routing and security options. However, with increased complexity comes more opportunities for things to go wrong, and that’s exactly what happened here. The vulnerability stemmed from how   handled   — additional fields that can be added to IPv6 packets to provide more information or routing options. According to  , these headers need to be processed in a strict order, and the system should handle invalid or malformed headers gracefully. However, in this case, the   didn’t handle them correctly.  is the defining standard for the  . It outlines the structure and behavior of IPv6 packets, including how extension headers should be processed. The key issue with the vulnerability stems from improper parsing and validation of these extension headers, allowing attackers to craft malicious IPv6 packets that could lead to   or  . To make it clear, Let me walk you through this. Let’s take a look at some important parts of   that explain how extension headers should be handled. ^ This section introduces the  , which is crucial for identifying the presence of   in an IPv6 packet. If the driver doesn’t handle this correctly, it can fail to properly process subsequent headers. One of the key rules here is that extension headers need to be processed  , meaning that any deviations or malformed headers should cause the system to reject the packet or handle it safely. In the Windows tcpip.sys vulnerability, this wasn’t done properly. This section specifies how extension headers are chained and the importance of imposing limits on their length and number. A failure to correctly validate these limits can open the door to   or  , which is exactly what happened in the tcpip.sys driver. To make it simple, Here’s what happened: In this specific vulnerability, the   driver failed to properly validate and process   containing extension headers that violated the rules set by  . Here’s a breakdown of the key issues: We all know, This vulnerability was classified as  , and for good reason. It could allow remote attackers to execute arbitrary code on unpatched systems — no user interaction needed. It’s a serious issue that Microsoft quickly moved to patch. I hope you guys understand the importance of RFCs and if you guys find this blog interesting, Make sure to follow me on  ,  ,  . I will be posting multiple such blogs in the upcoming weeks (Hopefully!). www.bleepingcomputer.com malwaretech.com securityintelligence.com InfoSec Write-ups Wannabe Red Teamer.  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["malware", "vulnerability"]},
{"title": "From Conflict to Collaboration: The Evolution of Vulnerability Disclosure", "link": "https://infosecwriteups.com/understanding-coordinated-vulnerability-disclosure-cvd-vulnerability-disclosure-programs-vdp-27ea33c882e0?source=collection_home---4------10-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share In this post, we’ll break down two important terms that are often used interchangeably:   (VDP) and   (CVD). While both relate to how vulnerabilities are reported, they evolved in different ways and serve distinct roles in modern cybersecurity. Vulnerability Disclosure Programs (VDPs) aren’t new. In fact, they were introduced in the 1990s as a structured way for security researchers to report vulnerabilities to organizations without fear of retaliation. Before VDPs, the landscape for vulnerability reporting was murky at best, with researchers unsure of how to share security flaws without facing legal consequences. This was especially true in the late 90s and early 2000s, when the general perception of hackers was overwhelmingly negative. Before VDPs were common, many researchers feared legal repercussions for reporting vulnerabilities. It wasn’t uncommon for organizations to sue or prosecute researchers who were trying to help improve security. This created a chilling effect, discouraging researchers from reporting vulnerabilities altogether. This is where  , an open-source, cross-industry initiative, led by  ,  ,  , and others, comes into play. The disclose.io framework provides legal   for researchers, ensuring they can report vulnerabilities without fear of prosecution. This project has helped standardize legal protections and promote ethical hacking as a positive force in cybersecurity.  and frameworks like disclose.io have helped redefine vulnerability reporting by creating a more structured and collaborative environment for researchers and organizations to work together without fear of retaliation. While a   provides a formal framework for vulnerability reporting,   refers specifically to how vulnerabilities are disclosed and coordinated between researchers and vendors.   is the broader term, encompassing everything from how vulnerabilities are reported to how they are triaged, patched, and communicated.   focuses primarily on the disclosure aspect, ensuring both parties (researchers and vendors) collaborate effectively.  Because the way vulnerabilities are disclosed can vary dramatically, and not all disclosure practices are created equal. Let’s explore the three main types of vulnerability disclosures: In the   model, the vulnerability is reported directly to the organization, and the organization decides whether to make the details public. This model is common in  , where researchers are compensated for reporting vulnerabilities but may never see the issue publicly disclosed. While this approach can work well, its main flaw is that it leaves the decision in the hands of the vendor — if they choose not to fix or publicize the issue, the vulnerability could remain hidden. This model became a source of frustration for many researchers, as vendors sometimes ignored or downplayed the vulnerabilities. As a result, some researchers began pushing for a more transparent approach. In response to uncooperative vendors, some researchers adopted the   approach, where the details of a vulnerability are made public immediately — sometimes including proof-of-concept exploit code — without giving the vendor time to fix the issue. While this can force organizations to act quickly, it also risks leaving users exposed, as attackers may exploit the vulnerability before a patch is available. In 2001, Scott Culp from Microsoft introduced the concept of   in his post “ ” stating that: “It’s high time the security community stopped providing blueprints for building these weapons [computer worms]. And it’s high time computer users insisted that the security community live up to its obligation to protect them. We can and should discuss security vulnerabilities, but we should be smart, prudent, and responsible in the way we do it.” Responsible Disclosure aimed to balance the protection of users with the need to give vendors enough time to fix vulnerabilities. Researchers would report vulnerabilities privately but agree to delay public disclosure until a fix was in place. Often, a timeline was set (e.g., 90 days), after which, if the vendor didn’t respond or act, the researcher could disclose the vulnerability publicly. In 2010,   proposed a new term —   — to replace “Responsible Disclosure”. The rationale was to emphasize the collaborative nature of the process, where both parties (the researcher and the vendor) share responsibility for resolving the issue. CVD also helped avoid the negative connotations implied by the loaded term “responsible disclosure,” which suggested that any other type of disclosure was inherently irresponsible. For more context around the shift to CVD, check out  ’s post,  , where she explores the need for this change and its impact on the security ecosystem. The introduction of CVD formalized a process that had been evolving for over a decade. The goal was clear: to promote collaboration between researchers and vendors, ensuring vulnerabilities were disclosed in a way that benefited everyone — without putting users at unnecessary risk. Organizations like   and   quickly adopted the CVD model, further solidifying its place in the world of cybersecurity. The key to CVD is that it’s not just about reporting vulnerabilities; it’s about working together to ensure those vulnerabilities are resolved before being made public.  are a specific type of VDP that incentivizes researchers to find and report vulnerabilities in exchange for rewards, such as cash or recognition. These programs create a structured channel for researchers to report vulnerabilities while earning rewards for their work. Organizations like  ,  ,  ,  and others manage thousands of these programs, making them accessible to researchers around the world. In this way, VDPs don’t just provide a safe space for vulnerability reporting — they also reward ethical hackers for their contributions to making the internet a safer place. VDPs and CVD have reshaped the way vulnerabilities are handled, moving the focus from secrecy and prosecution to transparency and collaboration. Thanks to these frameworks — and the hard work of people in the community like those behind disclose.io — ethical hackers can now report vulnerabilities without fear, helping make the internet safer for everyone. I hope you found this post useful, let me know in the comments if there is anything I missed, and feel free to connect to discuss the topic further on   or X ( ). InfoSec Write-ups Avid Learner. Security Research @Rezilion. Passionate about Cyber-Security and Machine Learning |  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["hacker", "vulnerability"]},
