[
{"title": null, "link": "https://infosecwriteups.com/latest", "date": null, "content": "It was purely my experience , i respect other bug bounty hunters :) To execute this privilege escalation technique, you’ll need a beacon running… Advanced Persistent Threats (APTs) are among the most sophisticated and dangerous…", "category": ["bug bounty"]},
{"title": null, "link": "https://infosecwriteups.com/about", "date": null, "content": "A collection of write-ups from the best hackers in the world on topics ranging from bug bounties and CTFs to vulnhub machines, hardware challenges and real life encounters. Register for the much-awaited virtual cybersecurity conference #IWCON2022: https://iwcon.live/ #sharingiscaring", "category": ["hacker"]},
{"title": null, "link": "https://www.darkreading.com/vulnerabilities-threats/71-of-hackers-believe-ai-technologies-increase-the-value-of-hacking", "date": null, "content": "October 16, 2024 You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": "Modded Versions of Popular Android Apps Used to Distribute New Variant of Necro Malware", "link": "https://infosecwriteups.com/modded-versions-of-popular-android-apps-used-to-distribute-new-variant-of-necro-malware-ccb3ccd8c57d?source=collection_home---4------23-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  recent investigation by Kaspersky has uncovered a new wave of malicious activity involving modded versions of legitimate Android apps like Spotify, WhatsApp, and Minecraft being used to deliver a fresh version of the Necro malware loader. In some instances, the altered apps were even found on the Google Play Store, with a combined download count exceeding 11 million. Among the apps identified as carriers of Necro malware are: While Max Browser has been pulled from the Play Store, Wuta Camera remains available, albeit with a clean version after a security update (version 6.3.7.138). The most recent version (6.3.8.148) was released on September 8, 2024, and is believed to be malware-free. Although the exact method of infection remains unclear, early indications point toward a rogue software development kit (SDK) that was likely introduced to enable advertising features within… InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["malware"]},
{"title": "The Hidden Gem of Pentest Certifications in 2024", "link": "https://infosecwriteups.com/the-hidden-gem-of-pentest-certifications-in-2024-67fa7a5b57cc?source=collection_home---4------19-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share Non-members can  . Do you need to tick off a box on your CV, or do you actually want to learn penetration testing? Are you thinking of getting into bug bounty programs? Do you want to start off strong in the most sought-after specialization within pentesting, Web Pentesting? Whatever your goal is, this is probably the best certification you can start on, and I’ll tell you why: Burp Suite Certified Practitioner ( The article can be found in video format here: I recently wrote a  , where I was rather skeptical about most popular pentesting certifications. This is due to them teaching you what many other pentesters already know (AD, Network Pentesting), and usually being expensive. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["penetration testing", "bug bounty"]},
{"title": "The Firefox Privacy Paradox: How to Balance Convenience and Security", "link": "https://infosecwriteups.com/the-firefox-privacy-paradox-how-to-balance-convenience-and-security-98557f5c8e19?source=collection_home---4------18-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share These days, keeping your personal information safe online is more important than ever. Your browser is one of your main tools for staying secure, but many of the best privacy features are hidden in the settings. In this article, we’ll show you easy changes you can make to protect yourself from tracking, data leaks, and other online risks. Whether you’re worried about being followed online or just want to boost your security, these simple tweaks will help you turn your browser into a strong shield. ✅ Security-focused, reduces unintentional access. : ✅ Enhances protection against tracking by preventing fingerprinting techniques. ✅ Enables you to make informed decisions about certificate errors. ✅ Prevents malicious autoplay, enhances privacy. : ✅ Blocks cross-site tracking by isolating cookies, which reduces the ability of third parties to track your online activity. ✅ Great for preventing phishing attacks. ⚠️  . Disabling the built-in PDF viewer forces external apps to open PDFs. While this reduces potential exposure to vulnerabilities in the built-in viewer, external PDF readers could introduce other vulnerabilities. If you’re using a secure PDF viewer, this is fine. ✅ Great for preventing fingerprinting. ✅ Prevents WebGL-based tracking and some security exploits. : ✅ Helps block known trackers and improves privacy while browsing. : ✅ Ensures that only secure SSL/TLS connections are accepted, protecting against certain attacks. : ✅ Validates SSL certificates, reducing the risk of connecting to fraudulent sites. : ✅ Restricts cookie access to enhance privacy, especially from third-party trackers. ✅ Disabling remote experimentation. : ✅ Prevents tracking of clipboard events, enhancing privacy. ⚠️  . Disabling memory caching may reduce performance slightly. If performance is a concern, this can be left enabled. ✅ Prevents icon-based tracking. ✅ Prevents favicon tracking in desktop shortcuts. : ✅ Disabling DRM can reduce potential vulnerabilities, although it may limit access to some content. ✅ Good for disabling persistent storage tracking, but may break some site functionality. ⚠️  . Disabling JavaScript will break most websites. If security is your utmost concern, this is fine, but it will result in a non-functional experience on many websites. Consider using tools like  or  to selectively enable JavaScript on trusted sites instead. ✅ Reduces media-based tracking. : ✅ Stops background data sending, which protects your information. ✅ Disables prefetching, preventing unnecessary connections. ✅ Limits WebSocket reconnection attempts, reducing the chance of exploitation. ✅ Prevents PDF caching, reducing potential data leaks. : ✅ Reduces the risk of fingerprinting through GPU information. ✅ Keeps cookie behavior settings device-specific. ✅ Prevents cookie lifetime policies from being synced across devices. ✅ Disabling disk caching prevents sensitive data from being stored on disk. ⚠️  . Disabling this can reduce security against malicious downloads, as Safe Browsing protects users from known threats. ✅ Prevents click tracking. : ✅ Prevents websites from accessing sensitive sensor data, enhancing privacy. ✅ Disables Pocket integration, reducing tracking. ✅ Disables geolocation to enhance privacy. ✅ Disables WebRTC to prevent IP leakage during peer-to-peer connections. : ✅ Stops automatic filling of forms, reducing the chance of storing sensitive information. : ✅ Blocks tracking through battery status, which can be used for fingerprinting. : ✅ Reduces unnecessary DNS requests, enhancing privacy. : ⚠️   While they enhance security, disabling them can reduce protection against malware and phishing. Use an alternative security solution if you choose to disable these. ✅ Prevents fingerprinting via fonts. ✅ Disables referrer headers, enhancing privacy by not leaking browsing history. ✅ Disabling bidirectional text support reduces the attack surface, although this might affect certain internationalized websites. ✅ Setting this to   allows only first-party cookies, which greatly improves privacy by blocking third-party trackers. : ✅ Forces the use of secure TLS versions, ensuring encrypted connections. These additional settings, when combined with your current setup, provide even greater security and privacy while browsing. However, like the previous settings, some of these can impact website functionality. Test them to find the right balance between privacy and usability that suits your needs! InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["phishing", "malware"]},
{"title": "\n      FBI warns consumers not to use public phone charging stations\n    ", "link": "https://edition.cnn.com/2023/04/12/tech/fbi-public-charging-port-warning/index.html", "date": null, "content": "Markets  \r\n Hot Stocks  \r\n Fear & Greed Index  \r\n \n            Latest Market News  \r\n \n            Hot Stocks  \r\n \n            The FBI is warning consumers against using public phone charging stations in order to avoid exposing their devices to malicious software. \n     \n            Public USB stations like the kind found at malls and airports are being used by bad actors to spread malware and monitoring software, according to a   last week from the FBI’s Denver branch. The agency did not provide any specific examples. \n     \n            “Carry your own charger and USB cord and use an electrical outlet instead,” the agency advised in the tweet.\n     \n            While public charging stations are attractive to many when devices are running critically low on battery, security experts have for years raised concerns about the risk. In 2011, researchers coined the term “juice jacking” to describe the problem.\n     \n            “Just by plugging your phone into a [compromised] power strip or charger, your device is now infected, and that compromises all your data,” Drew Paik, formerly of security firm Authentic8,   in 2017.\n     \n            The cord you use to charge your phone is also used to send data from your phone to other devices. For instance, when you plug your iPhone into your Mac with the charging cord, you can download photos from your phone to your computer. \n     \n            If a port is compromised, there’s no limit to what information a hacker could take, Paik previously explained to CNN. That includes your email, text messages, photos and contacts. \n     \n            “The FBI regularly provides reminders and public service announcements in conjunction with our partners,” Vikki Migoya, public affairs officer at the FBI’s Denver branch, told CNN. “This was a general reminder for the American public to stay safe and diligent, especially while traveling.”\n     \n            The Federal Communications Commission also   on Tuesday warning that a corrupted charging port can allow a malicious actor to lock a device or extract personal data and passwords. \n     \n            “In some cases, criminals may have intentionally left cables plugged in at charging stations,” according to the FCC blog post. “There have even been reports of infected cables being given away as promotional gifts.”\n     Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.   CNN Sans ™ & © 2016 Cable News Network.", "category": ["malware", "hacker"]},
{"title": "\n      How to protect yourself from iPhone thieves locking you out of your own device\n    ", "link": "https://edition.cnn.com/2023/04/23/tech/iphone-thief-recovery-key/index.html", "date": null, "content": "Markets  \r\n Hot Stocks  \r\n Fear & Greed Index  \r\n \n            Latest Market News  \r\n \n            Hot Stocks  \r\n \n            A complex but concerning method of gaining control over a user’s iPhone and permanently locking them out the device appears to be on the rise.\n     \n            Some iPhone thieves are exploiting a security setting, called the recovery key, that makes it nearly impossible for owners to access their photos, messages, data and more, according to a recent Wall Street Journal report. Some victims also   the publication their bank accounts were drained after the thieves gained access to their financial apps.\n     \n            It’s important to note, however, this type of takeover is hard to pull off. It requires a criminal essentially watching an iPhone user enter the device’s passcode – for example, by looking over their shoulder at a bar or sporting event – or manipulating the device’s owner so they’ll share their passcode. And that’s all before they physically steal the device. \n     \n            From there, a thief could use the passcode to change the device’s Apple ID, turn off “Find my iPhone” so their location can’t be tracked, and then reset the recovery key, a complex 28-digit code intended to protect its owners from online hackers. \n     \n            Apple requires this key to help reset or regain access to an Apple ID in an effort to bolster the user’s security, but if a thief changes it, the original owner will not have the new code and will be locked out of the account. \n     \n            “We sympathize with people who have had this experience and we take all attacks on our users very seriously, no matter how rare,” an Apple spokesperson said in a statement to CNN. “We work tirelessly every day to protect our users’ accounts and data, and are always investigating additional protections against emerging threats like this one.”\n     \n            On its website, Apple   “you’re responsible for maintaining access to your trusted devices and your recovery key. If you lose both of these items, you could be locked out of your account permanently.”\n     \n            Jeff Pollard, VP and principal analyst at Forrester Research, said the company should offer more customer support options and “ways for Apple users to authenticate so they can reset these settings.”\n     \n            For now, however, there are a handful of steps users can take to potentially protect themselves from having this happen to them. \n     \n            The first step is protecting the passcode. \n     \n            An Apple spokesperson told CNN people can use Face ID or Touch ID when unlocking their phone in public to avoid revealing their passcode to anyone who might be watching. \n     \n            Users can also set up a longer, alphanumeric passcode that’s harder for bad actors to figure out. Device owners should also change the passcode immediately if they believe someone else has seen it.\n     \n            Another step someone could consider is a hack not necessarily endorsed by Apple but one that’s been circulating online. Within an iPhone’s Screen Time setting, which allows guardians to set up restrictions on how kids can use the device, there is the option to set up a secondary password that would be required from any user before they could successfully change an Apple ID. \n     \n            By enabling this, a thief would be prompted for that secondary password before changing an Apple ID password.\n     \n            Finally, users can protect themselves by regularly backing up an iPhone – via iCloud or iTunes – so data can be recovered in the case an iPhone is stolen. At the same time, users may want to consider storing important photos or other sensitive files and data in another cloud service, such as Google Photos, Microsoft OneDrive, Amazon Photos or Dropbox. \n     \n            This won’t stop a bad actor from gaining access to the device, but it should limit some of the fallout if it ever should happen.\n     Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.   CNN Sans ™ & © 2016 Cable News Network.", "category": ["hacker"]},
{"title": "\n      This little robot is helping sick children attend school\n    ", "link": "https://edition.cnn.com/business/tech/av1-robot-sick-children-school-spc/index.html", "date": null, "content": "Markets  \r\n Hot Stocks  \r\n Fear & Greed Index  \r\n \n            Latest Market News  \r\n \n            Hot Stocks  \r\n \n            When children are chronically ill and unable to attend school, it’s not just the illness that can be debilitating — the separation from the classroom and friends can also take a toll.\n     \n            For young people undergoing long-term treatment or struggling with mental health issues, Norwegian company No Isolation developed the AV1 robot, which can take a child’s place in class, serving as their eyes, ears, and voice, and helping them stay connected with their classmates.\n     \n            The AV1 looks like a blank, simplified version of a human head and torso. It can rotate 360 degrees and is fitted with a camera, microphone and speaker. Teachers place it on a classroom desk and the student controls it remotely using an app, for which they are given a unique password.\n     \n            “They can tap or swipe their finger around the screen to look at different corners of the classroom,” said Florence Salisbury, marketing director for No Isolation. The student can talk to the teacher or their classmates through the speaker, and the app has a “raise hand” option that makes a light flash on the robot’s head. They can also select emojis that display in the robot’s eyes.\n     \n            Salisbury says there are 3,000 active AV1 units in 17 countries, mostly in the UK and Germany, both of which have over 1,000 of the robots in operation.\n     \n            In the UK, schools can rent the AV1 for around £150 ($200) per month, or opt for a one-time purchase for £3,700 (just under $4,960), with an additional service package of £780 (around $1,045) annually.\n     \n            Salisbury says that perhaps the robot’s biggest benefit is its ability to maintain social bonds. She shared the story of a 15-year-old student in Warwickshire, England, using AV1  whose friends take the robot to lunch with them, keeping him included in their social circle.\n     \n            “During a long absence, where classmates might not see their friend for an extended period, this connection to school really becomes a lifeline for that student, especially for those with a medical condition,” Salisbury said.\n     \n            According to the most recent government statistics,   in England were persistently absent from school in the autumn of 2023/24, 7.8% due to illness alone, which is higher than pre-pandemic levels.\n     \n            During the Covid pandemic, remote learning became the norm, but as students returned to school, for many it’s no longer an option. AV1 was launched before the pandemic, but   have reported using the robots to help students who have  .\n     \n            The UK’s Chartwell Cancer Trust has a supply of 25 AV1 robots it provides to children with serious illness. Founding trustee Michael Douglas told CNN that the robots enable children to stay engaged with their education even while in intensive care. “They are loved by the parents and make a real difference,” he said. “They make the child important.”\n     \n            But he acknowledged that there can be administrative challenges around their use and that “red tape can be a real issue” when trying to get the AV1 system into schools or hospitals. \n     \n            He added that some schools may also struggle to maintain the necessary technical infrastructure for seamless operation, because of weak Wi-Fi or mobile signal dark spots.\n     \n            In June, research published in the peer-reviewed journal  , examining the use of the AV1 in Germany and of the OriHime avatar robot in Japan, found the technologies “bear high potential for children to stay socially and educationally connected.”\n     \n            However, it added that there was a need to establish structures to give equal access to avatar technologies, and that training sessions for teachers on the technical and social aspects of the robots are important for successful implementation.\n     \n            Last August, No Isolation rolled out AV1 Academy, a library of training materials and resources aimed at improving the usability of the robot.\n     \n            According to Salisbury, the AV1 is designed with robust privacy features. No personal data is collected, and the app prevents screenshots or recordings. Encryption secures the livestream, and only one device can connect at a time, with the robot’s head and eyes lighting up to signal active use.\n     \n            There are other avatar robots on the market and some, like VGo and Buddy, have wheels and can move around the school or workplace, while some have a screen that shows the user’s face. Salisbury said that not having wheels is more practical for AV1, and weighing around 1 kilogram, the robot is easy for teachers or students to move between classes in a bespoke backpack.\n     \n            She added that the absence of a screen showing the child’s face can also be an advantage. “Removing that pressure to be on camera, we’ve seen, increases the likelihood of the robot being used for students with emotionally based school avoidance,” Salisbury said. \n     Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.   CNN Sans ™ & © 2016 Cable News Network.", "category": ["encryption"]},
{"title": "\n      Intel is a security risk for China, says influential industry group\n    ", "link": "https://edition.cnn.com/2024/10/16/tech/china-intel-security-review-intl-hnk/index.html", "date": null, "content": "Markets  \r\n Hot Stocks  \r\n Fear & Greed Index  \r\n \n            Latest Market News  \r\n \n            Hot Stocks  \r\n \n            Intel products sold in China should be subject to a security review, the Cybersecurity Association of China (CSAC) said on Wednesday, alleging the US chipmaker has “constantly harmed” the country’s national security and interests.\n     \n            While CSAC is an industry group rather than a government body, it has close ties to the Chinese state and the raft of accusations against Intel ( ), published in a long post on its official WeChat account, could trigger a security review from China’s powerful cyberspace regulator, the Cyberspace Administration of China (CAC).\n     \n            Intel’s China unit said on Thursday it has always prioritized product safety and quality.\n     \n            “We will maintain communication with the relevant authorities, clarify any concerns, and reaffirm our commitment to product safety and quality,” the company said in a statement on its official WeChat account.\n     \n            The CAC did not immediately respond to a request for comment. Intel’s shares had closed 1.5% lower on Wednesday amid a broad tech sell-off following a disappointing update from chip equipment maker ASML ( ).\n     \n            “It is recommended that a network security review is initiated on the products Intel sells in China, so as to effectively safeguard China’s national security and the legitimate rights and interests of Chinese consumers,” CSAC said.\n     \n            Last year, CAC barred domestic operators of key infrastructure from buying products made by US memory chipmaker Micron Technology Inc ( ) after deeming the company’s products as having failed its network security review.\n     \n            A similar security review on Intel products could negatively impact the company’s revenues, over a quarter of which came from China last year.\n     \n            The allegations come at a time when China is dealing with a US-led effort to restrict its access to crucial chipmaking equipment and components, in what Washington calls a bid to halt the modernization of China’s military.\n     \n            “Relationships between the US and China are fragile and the more talk about restrictions on trade and tariffs, the more likely the other side will retaliate in a tit-for-tat situation,” said Dan Coatsworth, investment analyst at AJ Bell.\n     \n            CSAC in its post accuses Intel chips, including Xeon processors used for artificial intelligence tasks, of carrying several vulnerabilities, concluding that Intel “has major defects when it comes to product quality, security management, indicating that it is extremely irresponsible attitude towards customers.”\n     \n            The industry group goes on to state that operating systems embedded in all Intel processors are vulnerable to backdoors created by the US National Security Agency (NSA).\n     \n            “This poses a great security threat to the critical information infrastructures of countries all over the world, including China … the use of Intel products poses a serious risk to national security,” CSAC said.\n     \n            A ban, even if temporary, on Intel products could further tighten the supply of AI chips in the Chinese market, which has struggled to find viable alternatives to cutting-edge products from Nvidia ( ) which dominate globally but are now banned from export to China.\n     \n            Intel this year secured orders for its Xeon processors from several Chinese state-linked agencies for use in AI work, according to a Reuters review of public tenders.\n     Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2024 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.   CNN Sans ™ & © 2016 Cable News Network.", "category": ["backdoor"]},
{"title": "Prototype Pollution: How a JavaScript Quirk Can Lead to Complete Application Takeover", "link": "https://infosecwriteups.com/prototype-pollution-how-a-javascript-quirk-can-lead-to-complete-application-takeover-9adb5e4f6b6b?source=collection_home---4------17-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  is a severe vulnerability that targets JavaScript applications, allowing attackers to modify the behavior of an application by injecting properties into the object prototype. This vulnerability can lead to arbitrary code execution, data manipulation, or even complete takeover of an application, especially when combined with other weaknesses. While often overlooked, prototype pollution is a powerful attack vector, making it essential for developers and security professionals to understand how it works and how to prevent it. JavaScript uses a concept called   to handle inheritance. Every object in JavaScript is linked to a prototype, and changes made to the prototype object can affect all instances of that object type. Prototype pollution occurs when an attacker can inject properties into these prototypes, allowing them to manipulate the behavior of the entire application. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Critical Vulnerabilities in DrayTek Vigor Routers: Over 700,000 Devices Exposed to Remote Exploits -$$$$ Bounty", "link": "https://infosecwriteups.com/critical-vulnerabilities-in-draytek-vigor-routers-over-700-000-devices-exposed-to-remote-exploits-2f3f731b50d9?source=collection_home---4------13-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share  series of critical vulnerabilities have been discovered in DrayTek Vigor routers, potentially affecting over 700,000 devices globally. These vulnerabilities include remote code execution (RCE), XSS, Information disclosure ,privilege escalation, and authentication bypass etc, which could allow attackers to take full control of the affected routers. Exploiting these flaws could lead to network breaches, data theft, and further attacks on connected systems. Forescout’s analysis revealed that over 704,000 DrayTek routers have their Web UI exposed to the internet, creating a rich attack surface for malicious actors. The majority of these exposed instances are located in the U.S., followed by Vietnam, the Netherlands, Taiwan, and Australia. “  addresses a buffer overflow vulnerability in the ‘GetCGI()’ function of the Web UI, which can lead to a denial-of-service (DoS) or remote code execution (RCE) when handling query string parameters. Another critical vulnerability,   involves an OS command injection flaw in the ‘recvCmd’ binary, used for communication between the host and guest operating systems.” InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Sensitive Data Leak using Cors Misconfiguration in prominent Domain Registrar", "link": "https://infosecwriteups.com/sensitive-data-leak-using-cors-misconfiguration-in-prominent-domain-registrar-b3010e4e6501?source=collection_home---4------12-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hello Guys, Hope Everything’s fine. This article is about Cors misconfiguration bug which i found in different api endpoints/api subdomains of prominent domain registrar. I worked with this program for almost more than year and reported totally 25 bugs which secured me 7th rank on their Global Leaderboard. Out of 25 ,16 bugs were just CORS issue on different endpoints. They self duplicated four or five reports and paid for rest of the bugs. Before starting about the vulnerability let me me tell you about the infrastructure of this program. This is private program and contains a lot of subdomains. It has structure like for example there is a feature for cart then all the api request associated with the cart would go through “cart.api.example.com” similarly for the rest functionality like payment would use “payment.api.example.com”, domain functionality would use “domains.api.example.com” , social media connection would use “social-sdk.api.example.com” and more. So while testing for bugs, I found CORS issue site-wide which contains regex validation misconfiguration and some endpoints allowed even null origin. I would cover Regex issue below. For those who are not familiar with what is CORS and how CORS misconfiguration could be exploited , I would recommend below article from Portswigger portswigger.net Now, You are aware with what is CORS and How its misconfiguration could be exploited ,let’s get back to our Bug. There was a functionality to add item to cart and once user/victim add any item to cart it was added to Basket. API request for basket was GET XHR “ ” Sever was validating Origin header and preventing null origin or any other cross origin. It was accepting request from origin like example.com or subdomain.example.com like cart.example.com,payment.api.example.com and more. So far so good, everything is as expected and looks secure so where is the BUG??? Server was using regex to check the origin and issue was that it was checking only origin header should end with “example.com” . For example, there is subdomain cart.api.example.com so request would bypassed using origin with the cartaapiaexample.com which ends up with example.com hence would bypass regex check and attacker could fetch victim’s response containing sensitive data. We know the BUG now but challenging task is how to create POC (Proof of Concept) which proves it is exploitable in real world. Let me describe below what setup i did to host poc and exploit it. I configured xampp server in my local system as referred below,set the host entry with testexample.com pointing to 127.0.0.1 and lastly moving cart_cors_fetch.html(poc) file to htdocs . www.c-sharpcorner.com POC file was containing below config. Now, I logged in as a victim in browser and run POC in another tab using url “http://testexample.com/cart_cors_fetch.html” . As seen above request went through our hosted domain and response was received at attacker server which contains victim’s phone,email,address,cart items and more Similarly, I was able to demonstrate that social api allows to fetch victim’s social connection information , social ads api allows to fetch victim’s campaign details ,seo api allows to perform seo operations behalf of victim,payapi allows to fectch victim’s payment details ,address,email,phone and more other endpoints . Hope this article was informative and would helpful in your learning journey. Thanks for reading. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "Uncovering 0-Days: The Crucial Role of RFCs in Vulnerability Research and the Recent Windows TCP/IPv6 Exploit", "link": "https://infosecwriteups.com/uncovering-0-days-the-crucial-role-of-rfcs-in-vulnerability-research-and-the-recent-windows-de6b7538e54f?source=collection_home---4------11-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hey everyone, it’s been a while since I last posted! If you were expecting this to be a continuation of my previous series on malware development, sorry to disappoint — it’s not :) I promise I’ll get back to that soon. But as the title suggests, this post is all about the importance of understanding RFCs, especially if you’re diving into vulnerability research. Why this topic, you ask? Well, I was watching a stream by   where Stephen and Chompie were discussing  , and they brought up RFCs. It made me realize how crucial they are for anyone starting out in vuln research — or even those who are already in it. So, here we are! Huge shoutout to  and  for the inspiration. Let’s dive in, and I hope you enjoy the read!  , but I promise it won’t be boring. If you’ve been in the vulnerability research space for a while or are just starting out, you’ve probably come across   — but have you ever really dug into what they mean and why they’re critical for both developers and security researchers? Understanding RFCs is like having a map to the core of how the internet works. More importantly, they can point you to where things might go wrong (Trust me, it always helps in identifying 0days). In this post, we’ll break down what RFCs are, why they’re essential in the field of vulnerability research, and we’ll end with a real-world example — a serious vulnerability in   driver that came to light due to poor implementation of an RFC related to  . According to our old friend  ,   are formal documents that outline the standards, specifications, and protocols governing the internet and computer networks. They are published by organizations like the   and the  . RFCs describe how technologies like  ,  , and   should be implemented and how they should behave under various circumstances. I can understand it doesn’t make much sense so here is my understanding of it. You may ask.. Ok, But how they actually helps in Vulnerability Research? Well, When researching vulnerabilities in protocols, RFCs act as the foundational reference. If a developer doesn’t strictly adhere to an RFC or skips over certain edge cases, it can result in unintended behavior, which can lead to bugs. These bugs can range from  to something far more critical, like  . Let’s break down some specific ways understanding RFCs helps in vulnerability research: : This blog reflects my current understanding of the Windows TCP/IPv6 vulnerability and its relationship to RFC 8200. If I’ve misunderstood or misrepresented any part of the implementation or RFC, I’m happy to be corrected and update this post. Please feel free to reach out if you spot any inaccuracies! Yes, We are going to talk about Windows TCP/IPv6 CVE in tcpip.sys driver. But I am not going to dig deeper into the actual vulnerability or exploitation of this bug as there are multiple blog posts that talked about this in a great manner. I will leave the links for those blogs as references at the end of this blog post. Here, we will be focusing on how poor understanding of RFC led to this bug. As we all know, the   that recently made headlines, discovered in the   driver. This vulnerability is a textbook case of what can happen when the implementation of a protocol deviates from the RFC. It’s also a great illustration of why you, as a vulnerability researcher, need to understand RFCs when dealing with network protocols. :   is the driver that handles network communication in Windows. It deals with both   and   traffic, making it a crucial part of the Windows networking stack. IPv6, defined by  , introduces a lot of new functionality over IPv4, including   that allow additional routing and security options. However, with increased complexity comes more opportunities for things to go wrong, and that’s exactly what happened here. The vulnerability stemmed from how   handled   — additional fields that can be added to IPv6 packets to provide more information or routing options. According to  , these headers need to be processed in a strict order, and the system should handle invalid or malformed headers gracefully. However, in this case, the   didn’t handle them correctly.  is the defining standard for the  . It outlines the structure and behavior of IPv6 packets, including how extension headers should be processed. The key issue with the vulnerability stems from improper parsing and validation of these extension headers, allowing attackers to craft malicious IPv6 packets that could lead to   or  . To make it clear, Let me walk you through this. Let’s take a look at some important parts of   that explain how extension headers should be handled. ^ This section introduces the  , which is crucial for identifying the presence of   in an IPv6 packet. If the driver doesn’t handle this correctly, it can fail to properly process subsequent headers. One of the key rules here is that extension headers need to be processed  , meaning that any deviations or malformed headers should cause the system to reject the packet or handle it safely. In the Windows tcpip.sys vulnerability, this wasn’t done properly. This section specifies how extension headers are chained and the importance of imposing limits on their length and number. A failure to correctly validate these limits can open the door to   or  , which is exactly what happened in the tcpip.sys driver. To make it simple, Here’s what happened: In this specific vulnerability, the   driver failed to properly validate and process   containing extension headers that violated the rules set by  . Here’s a breakdown of the key issues: We all know, This vulnerability was classified as  , and for good reason. It could allow remote attackers to execute arbitrary code on unpatched systems — no user interaction needed. It’s a serious issue that Microsoft quickly moved to patch. I hope you guys understand the importance of RFCs and if you guys find this blog interesting, Make sure to follow me on  ,  ,  . I will be posting multiple such blogs in the upcoming weeks (Hopefully!). www.bleepingcomputer.com malwaretech.com securityintelligence.com InfoSec Write-ups Wannabe Red Teamer.  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["malware", "vulnerability"]},
{"title": "From Conflict to Collaboration: The Evolution of Vulnerability Disclosure", "link": "https://infosecwriteups.com/understanding-coordinated-vulnerability-disclosure-cvd-vulnerability-disclosure-programs-vdp-27ea33c882e0?source=collection_home---4------10-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share In this post, we’ll break down two important terms that are often used interchangeably:   (VDP) and   (CVD). While both relate to how vulnerabilities are reported, they evolved in different ways and serve distinct roles in modern cybersecurity. Vulnerability Disclosure Programs (VDPs) aren’t new. In fact, they were introduced in the 1990s as a structured way for security researchers to report vulnerabilities to organizations without fear of retaliation. Before VDPs, the landscape for vulnerability reporting was murky at best, with researchers unsure of how to share security flaws without facing legal consequences. This was especially true in the late 90s and early 2000s, when the general perception of hackers was overwhelmingly negative. Before VDPs were common, many researchers feared legal repercussions for reporting vulnerabilities. It wasn’t uncommon for organizations to sue or prosecute researchers who were trying to help improve security. This created a chilling effect, discouraging researchers from reporting vulnerabilities altogether. This is where  , an open-source, cross-industry initiative, led by  ,  ,  , and others, comes into play. The disclose.io framework provides legal   for researchers, ensuring they can report vulnerabilities without fear of prosecution. This project has helped standardize legal protections and promote ethical hacking as a positive force in cybersecurity.  and frameworks like disclose.io have helped redefine vulnerability reporting by creating a more structured and collaborative environment for researchers and organizations to work together without fear of retaliation. While a   provides a formal framework for vulnerability reporting,   refers specifically to how vulnerabilities are disclosed and coordinated between researchers and vendors.   is the broader term, encompassing everything from how vulnerabilities are reported to how they are triaged, patched, and communicated.   focuses primarily on the disclosure aspect, ensuring both parties (researchers and vendors) collaborate effectively.  Because the way vulnerabilities are disclosed can vary dramatically, and not all disclosure practices are created equal. Let’s explore the three main types of vulnerability disclosures: In the   model, the vulnerability is reported directly to the organization, and the organization decides whether to make the details public. This model is common in  , where researchers are compensated for reporting vulnerabilities but may never see the issue publicly disclosed. While this approach can work well, its main flaw is that it leaves the decision in the hands of the vendor — if they choose not to fix or publicize the issue, the vulnerability could remain hidden. This model became a source of frustration for many researchers, as vendors sometimes ignored or downplayed the vulnerabilities. As a result, some researchers began pushing for a more transparent approach. In response to uncooperative vendors, some researchers adopted the   approach, where the details of a vulnerability are made public immediately — sometimes including proof-of-concept exploit code — without giving the vendor time to fix the issue. While this can force organizations to act quickly, it also risks leaving users exposed, as attackers may exploit the vulnerability before a patch is available. In 2001, Scott Culp from Microsoft introduced the concept of   in his post “ ” stating that: “It’s high time the security community stopped providing blueprints for building these weapons [computer worms]. And it’s high time computer users insisted that the security community live up to its obligation to protect them. We can and should discuss security vulnerabilities, but we should be smart, prudent, and responsible in the way we do it.” Responsible Disclosure aimed to balance the protection of users with the need to give vendors enough time to fix vulnerabilities. Researchers would report vulnerabilities privately but agree to delay public disclosure until a fix was in place. Often, a timeline was set (e.g., 90 days), after which, if the vendor didn’t respond or act, the researcher could disclose the vulnerability publicly. In 2010,   proposed a new term —   — to replace “Responsible Disclosure”. The rationale was to emphasize the collaborative nature of the process, where both parties (the researcher and the vendor) share responsibility for resolving the issue. CVD also helped avoid the negative connotations implied by the loaded term “responsible disclosure,” which suggested that any other type of disclosure was inherently irresponsible. For more context around the shift to CVD, check out  ’s post,  , where she explores the need for this change and its impact on the security ecosystem. The introduction of CVD formalized a process that had been evolving for over a decade. The goal was clear: to promote collaboration between researchers and vendors, ensuring vulnerabilities were disclosed in a way that benefited everyone — without putting users at unnecessary risk. Organizations like   and   quickly adopted the CVD model, further solidifying its place in the world of cybersecurity. The key to CVD is that it’s not just about reporting vulnerabilities; it’s about working together to ensure those vulnerabilities are resolved before being made public.  are a specific type of VDP that incentivizes researchers to find and report vulnerabilities in exchange for rewards, such as cash or recognition. These programs create a structured channel for researchers to report vulnerabilities while earning rewards for their work. Organizations like  ,  ,  ,  and others manage thousands of these programs, making them accessible to researchers around the world. In this way, VDPs don’t just provide a safe space for vulnerability reporting — they also reward ethical hackers for their contributions to making the internet a safer place. VDPs and CVD have reshaped the way vulnerabilities are handled, moving the focus from secrecy and prosecution to transparency and collaboration. Thanks to these frameworks — and the hard work of people in the community like those behind disclose.io — ethical hackers can now report vulnerabilities without fear, helping make the internet safer for everyone. I hope you found this post useful, let me know in the comments if there is anything I missed, and feel free to connect to discuss the topic further on   or X ( ). InfoSec Write-ups Avid Learner. Security Research @Rezilion. Passionate about Cyber-Security and Machine Learning |  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["hacker", "vulnerability"]},
{"title": "HTB | Resolute — DnsAdmins Abuse", "link": "https://infosecwriteups.com/htb-resolute-dnsadmins-abuse-24e2aa93c8f2?source=collection_home---4------9-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share This is the Box on  . Find the box  . Watch my video writeup of Resolute on YouTube:  IP:  Without credentials, I was not able to enum any shares I was able to null connect via   and able to enumerate I can get information about the users one by one with  : I can also get less information about all users with  : We found the password for  I’ll use crackmapexec as an easy way to check credentials against SMB. First I try as marko, but it doesn’t work: I tried connecting with EvilWinRM as well, but no luck. Password spraying is similar to password brute force, except you only try one (or a few common passwords) across a lot of users. The benefit to the attacker is that you don’t risk locking out any single account, and in a case where you only need a foothold, it’s very common in a large organization to find at least one user using a really bad guessable password. I grabbed the list of users from rpcclient, and dropped them into a file. Then I ran crackmapexec using that list as the user input. It found a user still using  : we found a valid login I don’t know if Malanie is an administrator or in the Remote Management Users group, but it’s worth a shot to see if I can EvilWinRM to get a shell as Melanie. It works: and now we have  In PowerShell,   is an alias for   or  . On Windows, it’s often a good idea to run that with  , kind of like running  . PSTranscripts looks interesting On looking at the text file inside PSTranscripts we found Ryan’s password On looking at user Ryan we can see that Ryan actually isn’t in Remote Management Users. But he is in  , and Contractors is: From my Kali box, I can also check the creds with crackmapexec: we can use evilWinRm and we are in as Ryan We saw note.txt On looking at   and  Members of the DNSAdmins group have access to network DNS information. The default permissions are as follows: Allow: Read, Write, Create All Child objects, Delete Child objects, Special Permissions. By default, the DNSAdmins don’t have the ability to start or stop the DNS service, but it’s not unusual for an admin to give this group that privilege. The attack here is to tell the DNS service on Resolute to use my dll as a plugin. I’m going to use   to create a dll that will, on loading, connect back to me. When   creates this payload, it will connect back, and wait for that session to end before continuing. This will hang the DNS service on Resolute. That’s fine for a CTF, but would make for a bad day in a real pentest. To get around this, you can create a payload that starts the reverse shell in a new thread and then continues so that the DNS server can continue to start. Check  ,   and   for more information Now I’ll start with a basic msfvenom reverse shell payload as a dll. Defender is running on this host, and if I put the output file there, it might get detected, but over a UNC path to a share it might be ok. Now I will start the smb server. Now it’s time to upload and execute. I’ll need to run three commands: I’ll need to do this all within a minute (or less) because, as note.txt told me, things revert quickly. With nc listening, I execute the attack: after starting DNS I got the shell and we have the  If you enjoyed this article and want to dive deeper into cybersecurity topics, feel free to explore my detailed write-ups on GitBook. I cover a range of topics including vulnerability assessments, penetration testing techniques, and security methodologies. 👉  👉 Watch my videos on YouTube:  Stay tuned for more content, and don’t forget to follow for future updates! Stay tuned for more content, and don’t forget to follow for future updates! InfoSec Write-ups CTF | Rookie Bug Bounty Hunter… | Learning Everyday… Website -   YouTube -  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability", "penetration testing", "bug bounty", "vulnerability assessment"]},
{"title": "Discovering an Unrestricted File Upload in AWS S3 Bucket", "link": "https://infosecwriteups.com/unrestricted-file-upload-in-aws-s3-bucket-2a764a3965f4?source=collection_home---4------7-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share AWS S3 Bucket Misconfiguration I was recently exploring🔍 a web application for vulnerabilities and came across an issue that could seriously compromise the security of AWS S3 buckets 🪣. While I was initially searching for a SQL injection 💉 vulnerability due to the   extension and the presence of an   parameter in the URL, I stumbled upon something unexpected—a misconfigured AWS S3 bucket. Here’s a detailed 👌 breakdown of the vulnerability, how I found it, and its potential impact. Unrestricted Remote File Upload and Deletion. The vulnerability I found allows anyone with the correct S3 bucket URL to upload and delete files without authentication ☠️ This can be dangerous as it exposes the bucket to unauthorized users, allowing them to manipulate files, upload malicious content, or even delete crucial data. 1. Inspect the Page Source: I started by viewing the page source of the gallery page: Here, I noticed a reference to an S3 bucket URL(images of the website are hosted on this aws s3 bucket): 2. Set Up AWS CLI: To interact with the bucket, I set up the AWS Command Line Interface (CLI) using Kali Linux. If you’re unfamiliar with AWS CLI installation, here’s a helpful guide: 3. List the Bucket's Contents: Once AWS CLI was ready, I ran the following command to check the files in the bucket: 4. Upload a Test File: I created a simple text file called testput.txt and used the following command to upload it: 5. Verify the Upload: To confirm the file was successfully uploaded, I accessed it directly via the S3 bucket URL: 6. Delete the File: Finally, I deleted the file using this command: This vulnerability opens up several potential risks:  Attackers can upload malicious files to the S3 bucket, which could be used for phishing, malware distribution, or other harmful purposes.  Important files could be deleted or replaced, resulting in the loss of critical data.  The bucket could be exploited to host malicious content, turning it into a platform for cyberattacks. By failing to properly configure the S3 bucket's permissions, the web application exposed sensitive file operations to unauthorized users. This vulnerability can have severe consequences, and it’s crucial for developers to always ensure their S3 buckets are secured against such threats. Special thanks 😊 to   🙏 for his detailed write-up on AWS S3 bucket 🪣 exploitation. Without his article, I wouldn’t have been able to discover this vulnerability. 🫂 InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["phishing", "malware", "vulnerability"]},
{"title": "APTs: Tactics, Techniques, and Procedures", "link": "https://infosecwriteups.com/apts-tactics-techniques-and-procedures-b306f91dc374?source=collection_home---4------6-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Advanced Persistent Threats (APTs) are among the most sophisticated and dangerous threats in the cybersecurity landscape. These adversaries are typically highly skilled, well-funded, and often backed by nation-states or criminal organizations. Their objective is to gain persistent, long-term access to a targeted network or system, with the intent of espionage, data theft, sabotage, or intellectual property theft. In this article, we will take a deep dive into APT groups, focusing on their  , and explore real-world case studies that highlight the evolution of these multi-stage, sophisticated attacks. APTs differ from common cybercriminals in several critical ways: To fully understand APTs, it’s important to break down their TTPs and analyze how they operate through the  . Do you like my content and you want to see more? Consider   Remember to   and   to stay updated with the latest posts! The tactics, techniques, and procedures employed by APTs are diverse and often evolve based on the specific objectives of an attack. The MITRE ATT&CK framework provides a comprehensive matrix for classifying the techniques used by APTs, mapping them against different stages of the attack lifecycle. Let’s examine some of the most common TTPs used by APT groups. The first stage of an APT attack is gaining an initial foothold in the target network. This can be achieved through various methods, such as: Once initial access is gained, the next stage involves executing malicious payloads or commands on the target system. Maintaining long-term access to the target system is one of the key objectives for APTs. To achieve this, they employ several persistence techniques: To move laterally and access high-value systems within the target network, APTs often escalate privileges using techniques such as: APTs are adept at avoiding detection and evading security defenses, employing various techniques, including: Once inside the target network, APTs move laterally to other systems and networks to gather more information or access more sensitive areas: After successfully navigating the victim’s network, the final stage involves exfiltrating sensitive data: To better understand the methodology and impact of APT attacks, let’s examine some real-world case studies involving well-known APT groups. APT29, also known as  , is believed to be associated with Russian intelligence agencies. This group is known for its stealthy and sophisticated attacks, focusing on espionage against Western governments and organizations. APT41, also known as  , is a Chinese APT that is unique in its blend of state-sponsored espionage and financially motivated cybercrime. APT41 has been linked to various campaigns targeting sectors such as healthcare, telecommunications, and software development. APT10, also known as  , is another Chinese state-sponsored group known for conducting cyber espionage campaigns, particularly against technology companies and government agencies. Advanced Persistent Threats are some of the most dangerous adversaries that organizations face today. Their sophisticated, multi-stage attacks are carefully crafted to evade detection and remain in target networks for extended periods. Understanding the TTPs employed by APTs is critical to building effective defenses and improving incident response capabilities. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["cybercrime", "cyber espionage", "incident response"]},
{"title": "Exploring Integer Overflow — The realm of exploiting binaries", "link": "https://infosecwriteups.com/exploring-integer-overflow-the-realm-of-exploiting-binaries-706d4f7f174e?source=collection_home---4------3-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share  occurs when an arithmetic operation results in a value that exceeds the storage capacity of the data type used to store the result. In simple terms, it’s when a number becomes too large (or too small, in the case of signed integers) to be stored, causing unexpected results. For example, consider a signed 32-bit integer that can store values from   to  . If you try to add   to the maximum value ( ), the number wraps around to the minimum value ( ), which can lead to serious consequences in critical systems. : Fixed-size integers (like  ,  , etc.) have specific boundaries. For example: : If user input isn’t validated correctly and operations are performed without bounds checks, an overflow can occur. Example In this case, adding   to the maximum integer wraps it around to the lowest negative value, which is a classic overflow behavior. Integer overflow has been an issue since the early days of computing due to the   nature of data types in programming languages. In older systems, developers often worked with limited hardware, meaning data types like   and   were used to conserve memory. As a result, overflows became a common problem, especially in security-critical software. In the  , as the software industry matured, researchers and attackers began identifying how integer overflow could lead to memory corruption, buffer overflows, and eventually  . During this time, attackers exploited the fact that overflowed integers could trick systems into miscalculating buffer sizes, leading to buffer overflows — one of the most dangerous vulnerabilities. : Integer overflows have been a frequent target in CVEs (Common Vulnerabilities and Exposures). These vulnerabilities have been exploited in various software products, including web browsers, operating systems, libraries, and network services. As of  , based on a review of public CVE databases: Notable examples include: For an application to be vulnerable to an integer overflow, certain   and   need to exist. These vulnerabilities arise when arithmetic operations (addition, subtraction, multiplication, etc.) on integers produce results that exceed the storage capacity of the variable, leading to incorrect or malicious outcomes. : : : : Example : : : : : : An   can have a range of consequences depending on the context in which it occurs, the application it affects, and how an attacker can exploit it. The impacts can range from simple application crashes to severe consequences such as  ,  , or  . Here’s a breakdown of the various impacts: : : : We’ll now create a sample application that demonstrates   and showcases the   we’ve discussed. This program will contain sections that intentionally suffer from integer overflow vulnerabilities and trigger scenarios like  ,  ,  , and  . We’ll build an application with the following structure: Below is a   that contains several functions vulnerable to integer overflow. The code provided demonstrates various integer overflow vulnerabilities in a compact manner. It covers memory allocation overflow where large values lead to incorrect buffer sizes ( ), privilege bypass through improper user ID checks ( ), and denial of service caused by excessive memory allocation ( ). The   function illustrates arithmetic overflow with unchecked multiplication, while the   simulates an input-related buffer overflow by accepting more input than the fixed buffer size. The code sections focus on showcasing typical overflow scenarios in dynamic memory management, privilege validation, and arithmetic operations, all crucial in software security. Let’s now break down each code block from the previous program, explaining the impacts of integer overflow vulnerabilities by providing appropriate inputs for each scenario. 1.  3.  4.  5.  #VulnerabilityExploitation #IntegerOverflow #Exploration InfoSec Write-ups Incident Response, Threat Hunting, and Reverse Engineering professional, writing things to learn them better.  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability", "incident response"]},
{"title": "Privilege Escalation – SeImpersonatePrivilege", "link": "https://infosecwriteups.com/privilege-escalation-seimpersonateprivilege-908d491a97ea?source=collection_home---4------2-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share To execute this privilege escalation technique, you’ll need a beacon running under the NT SERVICE\\USER account. In this scenario, you’re exploiting a security vulnerability using SeImpersonatePrivilege( ) to escalate privileges from a lower-privileged account (NT Service\\USER) to SYSTEM, which is the highest privilege level on Windows systems.  allows an account to impersonate the security token of another user or service. Since the NT Service\\USER account is not an administrator, it can’t directly access higher-privileged tokens (such as the SYSTEM token) on its own. So we need to somehow force SYSTEM* beacon to authenticate to a controlled resources, so that you can impersonate that service We will automate this whole process using a tool named  . First make sure you are runnning NT Service\\USER account beacon. In my case the username is sqlsvc. Then run the   ( ) tool to display the current user’s token privileges, indicating which are enabled or disabled. If the result from Seatbelt shows that  is enabled, then you can proceed further. First, you’ll need to create a web-scripting attack. To do this, open your Cobalt Strike window and navigate to   Configure the settings to suit your needs and   the attack. This will generate a URL like: Now convert that url into a Base64-encoded format using Unicode encoding. To do so follow the below steps in any powersshell window. Then use  to to run a hidden command with a Base64-encoded payload using powershell, which will give you a high privileged beacon. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": " plugin", "link": "https://infosecwriteups.com/critical-vulnerabilities-in-porte-plume-plugin-to-remote-exploits-bounty-cve-2024-7954-3dbee45134ac?source=collection_home---4------1-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share The   plugin, utilized by SPIP versions prior to  ,  , and  , is susceptible to a critical   vulnerability. This flaw allows a remote, unauthenticated attacker to execute arbitrary PHP code as the SPIP user by crafting a specific HTTP request. The potential for exploitation is severe, enabling attackers to run malicious commands on the server, which could lead to unauthorized access, data breaches, or further system compromise. To locate potentially vulnerable SPIP instances that are exposed on the internet, you can run the following Shodan query: This search targets SPIP instances that have the “porte_plume” plugin enabled, which is known for vulnerabilities in certain versions. By using this query, you can identify systems at risk and take the necessary precautions to secure them. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["data breach", "vulnerability"]},
{"title": "1. It Takes a Lot of Time for Little Reward", "link": "https://infosecwriteups.com/why-i-quit-bug-bounty-hunting-95e81c907a6f?source=collection_home---4------0-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share It was purely my experience , i respect other bug bounty hunters :) When I first started bug bounty hunting, I was excited. The idea of finding bugs in real-world systems and getting rewarded for it sounded like the perfect way to practice cybersecurity and earn some cash. But after spending a lot of time on it, I made the decision to step away. Here’s why: At first, I thought I would quickly find bugs, submit them, and earn rewards. But the reality was much different. There are thousands of skilled bug hunters out there, and the competition is really tough. Many times, I would spend hours or days searching, only to find that someone else had already reported the same issue before me. Even when I found bugs, some weren’t considered important enough to get paid. I started feeling like I was putting in way more time than I was getting back in rewards. Even got few bugs which were either duplicate or marked as informative ….. for reference i m adding one of my submission which was marked as informative InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["bug bounty"]},
{"title": "Large-Scale Data Exfiltration: Exploiting Secrets in .env Files to Compromise Cloud Accounts and Inflict Severe Business Degradation", "link": "https://infosecwriteups.com/large-scale-data-exfiltration-exploiting-secrets-in-env-files-to-compromise-cloud-accounts-107dce22e601?source=collection_home---5------3-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Researchers from   have uncovered a major cyber attack targeting cloud environments by exploiting sensitive secrets stored in   files. The investigation concluded that a compromised AWS environment had been exploited to conduct internet-wide scans across various domains as part of this malicious campaign. Unit 42 discovered that the threat actors had gathered   files from approximately 110,000 domains, exposing over 90,000 sensitive credentials, including 7,000 related to cloud services used by various organizations. The following article offers a detailed breakdown of techniques used by attackers in this malicious operation. I will explore the 5 phases of the attack — ,  ,  ,  , and   — along with 12 micro-steps that propel these 5 phases. Attackers gained initial access to victims’ cloud environments by exploiting exposed secrets in   files. These files are used by services to access runtime environment variables, which are typically configured differently across development, staging, and production environments based on where the service is deployed. In production environments,   files often contain highly sensitive information, such as access tokens, credentials, and API keys. Due to their sensitive nature,   files are generally excluded from code repositories and are manually configured for specific instances.  files are often used to configure web servers that host customer-facing web applications. If improperly configured, attackers can access them publicly via  , potentially leading to the retrieval of the   file contents, which hold sensitive authentication assets used in production. After scanning an unsecured web server, the attackers used AWS access keys, obtained from a publicly accessible   file, to learn more about the compromised account. AWS access keys are long-term credentials for AWS IAM users, consisting of two parts: an   and a  . Together, these credentials allow authentication of AWS API requests on behalf of the IAM user associated with the access keys.   AWS access keys are not considered a best practice from a security perspective. Instead, developers are encouraged to use temporary security credentials (such as AWS IAM roles) rather than long-term credentials. Using the AWS access keys, the threat actors gained a foothold in the AWS environment and sought to learn more about the compromised account. This tactic allowed them to advance their malicious operations — escalating privileges, moving laterally, and extracting valuable data. The attackers made several AWS API calls across several services: While a basic scan of the compromised account was possible, the threat actors needed administrator access to allocate compute resources and execute code. Therefore, they proceeded to carry out a privilege escalation. The threat actors wanted to execute code in the compromised account, but the IAM credentials used for initial access had insufficient privileges. Therefore, they performed a privilege escalation to carry out further malicious actions. Low-privileged IAM principals have limited permissions, restricting their access to critical resources. By escalating privileges, attackers could gain elevated access (targeting the   AWS-managed IAM policy), allowing them to bypass security controls, move laterally within the cloud environment, and ultimately, exfiltrate data from sensitive S3 buckets. To escalate their privileges, the threat actors created a new AWS IAM role, assigned it elevated permissions, and assumed the role to obtain elevated IAM credentials. To better understand this escalation pattern, we first need to take a closer look at the structure of an AWS IAM role. AWS IAM roles are entities that grant access to AWS services based on assigned permissions, similar to IAM users. However, unlike users, roles do not have passwords or access keys. Instead, they provide temporary security credentials to whoever assumes them. This reduces the need to manage users and their long-term credentials, as roles generate temporary credentials whenever required, just in time (JIT), while aiming to provide just enough access (JEA). AWS IAM roles consist of two components: With a clearer understanding of the structure of an AWS IAM role, we can now dive into the AWS IAM privilege escalation technique involving the   and   APIs. To escalate their privileges, the attackers created IAM resources with unrestricted access to the victim’s AWS resources. They created an IAM role named  , attached elevated permissions to it, and assumed the role to obtain temporary IAM credentials. With IAM credentials granting unrestricted access to the compromised AWS account, the threat actors could execute code by creating an AWS lambda function that executes their malicious code. Using the temporary and elevated IAM credentials, the threat actors created a new lambda function named   in the AWS region  . This lambda function executed a bash script that scanned internet-wide domains for exposed   files, extracted credentials from them, and uploaded the credentials to an S3 bucket under their control. This technique enabled the attackers to compromise more AWS accounts by using similar attack vectors to exfiltrate and delete S3 objects from the targeted victims’ buckets. They could then upload a ransom note to the emptied buckets, demanding a large fee for returning the exfiltrated data. To execute maliciously, the lambda function had permission to interact with the attackers’ controlled S3 bucket. An AWS lambda function requires specific permissions to execute API actions and access other AWS resources. These permissions are defined in an IAM role called an  , which lambda automatically assumes when invoked. The   can have a policy attached that specifies the necessary permissions for accessing AWS resources. At a minimum, it must have access to Amazon CloudWatch, as Lambda logs there by default (attaching the   policy satisfies this requirement). Additionally, the role’s trust policy must include the lambda service principal ( ) to allow Lambda to assume the role. Using the compromised credentials, the attackers proceeded to exfiltrate and extort sensitive data from Amazon S3 buckets. Their data exfiltration involved unauthorized extraction and removal of data from these storage instances. The threat actors accessed S3 buckets within the compromised accounts and used the   tool to interact with the S3 API for data extraction. After downloading all the files, they deleted them and left a ransom note, informing the owner that their sensitive information was now in the attackers’ possession and would be sold unless a ransom was paid. The S3 Browser tool generates various S3 API calls during its use, which can reveal the S3 buckets accessed by the attackers, regardless of whether S3 object-level logging was enabled. In the next blog post, I will explain how organizations can proactively detect and remediate these kinds of attacks, and how to remain protected and safe. Stay tuned! If you have any questions, comments, or feedback,   — I’d be happy to discuss. Additionally, if you found this article useful and wish to stay updated on future research, feel free to follow me here. :) InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["cyber attack", "data exfiltration"]},
{"title": "Honeypots 104: T-Pot — Your All-in-One Honeypot Platform Guide", "link": "https://infosecwriteups.com/honeypots-104-t-pot-your-all-in-one-honeypot-platform-guide-0ba2643bc597?source=collection_home---5------2-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share ·  ·  ·  ·  ·  ·  ·  ·  ·  ·  ·  ·  Greetings,  Welcome back, and thanks for joining me for the fourth instalment of the  , where we explore cyber deception and honeypots for fun and learning. In this article, I’ll walk you through one of the most interesting honeypots I’ve experimented with,  . We’ll cover what T-Pot is, its benefits, drawbacks, use cases, and installation. We’ll also look at the features that set it apart from other standalone honeypots, like its integration of numerous honeypots into one platform, and its impressive dashboards, analytics, and visualizations. I’ve selected this cybersecurity project to gain insight into daily cyber attacks and their origins, as well as to understand attacker techniques. The chosen honeypot should facilitate IP address analysis, identification of known attackers, correlation with CVEs, and spotting of broader attack campaigns that are trending.  If you haven’t read the previous articles in the series, I recommend checking them out after finishing this one. If you’re new to honeypots, start with the first article, “ ” which covers the basics and provides a good foundation for the rest of the series. 🍯  🍯  🍯  -Pot, which stands for “ , is an all-in-one open-source honeypot platform that supports over 20+ honeypots. T-Pot honeypot simulates vulnerable services to make them attractive for attackers to target them. The aim is to lay a honeytrap for malicious acroes, capture their interactions and offer insights for threat analysis and defence strategies. It also provides extensive visualization options with the Elastic Stack, animated live attack maps, and various security tools. tailored for network security monitoring and threat intelligence. It simplifies the setup of various honeypot types while gathering valuable threat data.  T-Pot can run on Windows and macOS using Docker Desktop, but some features might be limited. Additionally, the macOS/Windows firewall will block incoming connections by default unless it’s turned off. This is the standard installation of T-Pot and must be installed first. All services, tools, and honeypots will be installed on a single host, which doubles as a Hive endpoint. Note: Make sure to meet the  . For your first node, you have to install a Hive node. If you want a distributed architecture for your T-Pot honeypot, you need at least two hosts, a Hive and a Sensor. A Sensor will host only the honeypots, and some tools and transmit log data to the Hive. You can add multiple Sensors later for larger honeypot deployments. T-Pot includes various honeypot types like the high-interaction honeypot  for SSH and Telnet, the web application honeypot  , and the malware analysis tool  . Each honeypot type is designed to capture specific attack methods and provide detailed insights. Here are some of the popular honeypots included in T-Pot: : For the full list of the 23+ honeypots included, see the   page or   website. Let’s look at some of the advantages T-Pot offers compared to other open-source honeypots. Although not many, T-Pot does come with a few minor drawbacks. We have multiple options when deploying a T-Pot honeypot. While a Raspberry Pi 8GB or a virtual machine at home are viable, they come with risks. A word of caution! Hosting the honeypot on your home network can attract malicious traffic, posing a security threat if compromised. Instead, I chose a   running AlmaLinux 9, which is based on Red Hat. This setup offers better security and performance without exposing my home network. Here are the specs I selected for my Akamai Linode cloud instance. To set up the Linode server for the honeypot, I won’t dive into the detailed instructions here. You can refer to my article below for an in-depth guide. cybersecmaverick.medium.com The first few steps should be straightforward and they are also covered in depth in the article I have shared above “ ”. 🔸  🔸  Set up a non-root user and avoid using root for your day-to-day tasks. In AlmaLinux, the non-root users can be granted sudo permissions by adding them to the “ ” group in  . : In other Debian-based systems this group is most likely called “ ” . 🔸  Without diving into the step-by-step details on editing your SSH server’s configuration, I’ll keep this short and show you what your   file should look like in the snippet below. ⚠️  : Before you enable   and disable  , make sure SSH key-based authentication is working correctly. If you're unsure, check out the full guide on using SSH keys I shared earlier. Restart the SSH server to apply the changes. For a detailed step-by-step guide, refer to my previous article below: infosecwriteups.com 🔸  Let’s move on to setting up our T-Pot honeypot. You can follow my installation instructions below. If you need the full documentation or additional guidance, check out the main GitHub page below. T-Pot Version 24.04 releasedgithub.security.telekom.com Running T-Pot on an existing Linux system is possible but a clean install using the minimum or netiso installers is recommended to avoid port conflicts. : As a rule of thumb, the more sensors & data, the more RAM and storage is needed. For a Hive, you can get away with 8 GB RAM and 60–120 GB disk. We need to ensure no default applications or services are running that might conflict with T-Pot’s honeypot services and ports. Let’s check no other ports are open other than SSH which we need for remote management. List all currently running services on your AlmaLinux system. Run   to check all listening ports on your system installing T-Pot. Install the prerequisite packages. Clone the GitHub repository as a user. Browse to the  folder. Run the installer as the non-root user we created earlier. Choose   as installation type for T-Pot Standard / HIVE. Create a web username and password for your T-Pot web portal. The installer will ask you to review no other potentially conflicting services running on the systems before proceeding. Once the installer has completed the setup successfully, it’s now time to reboot the server. Check you have enough disk space left before you proceed. We’ve used only 7% of our main partition’s 157 GB for both the AlmaLinux OS and T-Pot install, leaving us with 140 GB free This should be enough to store logs for several weeks or months, depending on honeypot activity and logging services enabled. The below command provides a detailed, colorized list of all listening TCP and UDP sockets, along with the processes that are using them, in a way that is easier to read and interpret. Display a colorized list of all the running services on your system to confirm your honeypot is running its various services. Use the   and   commands to verify the honeypot's successful installation and ensure all its services are running as Docker containers. These commands provide an overview and detailed status of the containers, helping you check their state and resource usage. You made it! The hard part is done and now the fun part begins, exploring the multitude of dashboards available to us by T-Pot. The T-Pot web portal runs on port  , head over to   and login with your newly created T-Pot web username and password. The T-Pot landing page is your main hub for accessing various tools and dashboards like  ,  ,  ,  ,  , and  , making it easy to navigate and monitor honeypot activities. AttackMap visualizes live attack data on a world map, showing the origins and targets of malicious activity. AttackMap is the ultimate bragging tool for cybersecurity pros. Nothing beats showing off a real-time attack map on your dashboard to highlight your threat-hunting prowess! It gives you a quick view of the services under attack, top IP sources, and the most aggressive attacking countries, all in one neat dashboard. SecurityMeter provides a real-time snapshot of your honeypot’s health, tracking resource usage and alerting you to potential issues. It also shows average alerts, alert distributions, and other key security metrics CyberChef’s tool, integrated into T-Pot, comes in handy as an offline resource, ideal for quickly decoding and analyzing threats. Elasticvue is a user-friendly GUI for Elasticsearch, which not be necessary for a single honeypot deployment where you keep the operations simple and focus on testing or learning about honeypots. T-Pot’s Elasticvue support is ideal for handling multiple honeypots (clusters) or conducting a detailed analysis of Elasticsearch data, providing a straightforward interface for easily exploring and managing data. Spiderfoot is a versatile open-source tool designed for reconnaissance and intelligence gathering, extracting information from diverse online sources to assist in performing threat intelligence. It supports your OSINT to investigate alerts and potential threat actors effectively. Kibana in T-Pot is a powerful visualization tool for exploring and analyzing Elasticsearch data, offering a variety of dashboards and visualizations tailored to T-Pot-supported honeypots. One of the most interesting is the “T-Pot” dashboard, which provides a comprehensive, real-time view by combining data from multiple honeypots for efficient monitoring and analysis. This is where the magic happens! The heart and soul of the T-Pot honeypot. On the top right side of the search box, you can set the range to your desired timeframe While honeypot analysis and threat intel are key objectives, learning query languages like KQL in Kibana is an added bonus. One of the cool things about a cybersecurity project like this is the opportunity to learn multiple skills from one project. (Kibana Query Language) allows you to perform detailed and precise searches within Kibana, making data filtering and analysis easier. If you’re already familiar with it, you can have fun practising; if not, it’s a great chance to learn it while using T-Pot’s Kibana. This skill will be handy later when dealing with SIEMs using Elasticsearch or other KQL-compatible systems. In this section, we’ll dive into the T-Pot dashboard with a straightforward example by picking the top attacker source IP from the “ ” widget. Let’s click on one of the IP addresses, such as  . This will automatically launch the    website, an external site that provides detailed threat intelligence and reputation details on our chosen attacker IP. We can now explore the  tool provided by T-Pot to dig deeper. Spiderfoot is a handy open-source tool for gathering intelligence from various online sources. Start a new scan with our IP of interest. The scan status should be “RUNNING” and will take a while. Below you can see an example of data being returned for our attacker As we wrap up our quick tour, remember, we’ve barely scratched the surface. Why overload you with more information when this project is all about tinkering, discovering, and learning? Even though I managed with the specs, the system occasionally experienced CPU spikes, making it slow or unusable. Sometimes the server would run fine for hours, and then CPU usage would rapidly jump to 200–400%. I initially thought this might be due to a surge in attacks, causing the system to work hard to process everything in real time. I had to reboot the system once or twice. Despite this, I was able to collect data and have analytics on my dashboard, which was the goal of this temporary project. However, after checking system utilization and Linode’s analytics, I concluded that the spikes weren’t due to network communication surges. The main issue was the default T-Pot installation running all 23+ honeypots via Docker containers. It’s overkill to emulate services like a Citrix server or an Android ADB server unless you really need them. It’s better to focus on key services like HTTP, SSH, Telnet, and firewall devices. The   command included with T-pot, stands for “ \" and shows an extended view of running Docker containers, including CPU and memory usage. One recommended way to reduce the load on the system is to decrease the number of running honeypots in the  file. For an educational project, focusing on common areas like SSH, web, and mail is more practical than capturing and analyzing data from attacks targeting less typical systems like Citrix or Internet Printers. Disable any honeypot service by commenting it out in the file and saving your changes. Restart the T-Pot honeypot services to apply the changes. Verify the running services or docker containers using the   command. Using   or   commands, check the system resources now specifically the CPU usage. This should have dropped You can get T-Pot releases from GitHub using  . : If you've made any changes to the T-Pot config files, be sure to back them up first! To update the T-pot honeypot, run the following script in   folder. This script will update T-Pot to the latest version. A backup of   will be written to  . If you are unsure, you should save your work. ⚠️  : This tool might break things and therefore only recommended for experienced users! By default, T-Pot will add a daily reboot including some cleaning up. View the current daily reboot setting in crontab. You can adjust this line with  . Start T-pot Stop T-Pot Running a honeypot is a great way to sharpen your cybersecurity skills and gain practical experience. T-Pot stands out as a robust, all-in-one open-source platform, bundling multiple honeypots into a single, streamlined package. It’s user-friendly and comes loaded with impressive dashboards, visualizations, and analytics, making it an excellent choice for anyone interested in threat intelligence and network security monitoring. While T-Pot demands decent system resources, the ease of use and comprehensive features make it worth it. The visualizations and analytics, powered by Kibana, offer deep insights and can keep you engaged for hours. Improving your OSINT and threat analysis capabilities is a key benefit of working with T-Pot. For those looking to experiment without a large investment, consider running T-Pot on a cloud service with a free trial period, like Linode. Check out my referral link below to get started. I hope this introduction has inspired you to explore honeypots further. They are not only educational but also a lot of fun to work with. InfoSec Write-ups Penetration Tester, Linux Evangelist, Security Geek, Blogs about Ethical Hacking, CTF, Cybersecurity Career & Certifications.  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["cyber attack", "malware", "threat intelligence"]},
{"title": "Account Takeover using IDOR in Password reset Functionality", "link": "https://infosecwriteups.com/account-takeover-using-idor-in-password-reset-functionality-0d62c1bd5760?source=collection_home---5------1-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hello Guys, Hope Everything’s Fine. This article is about my recently resolved bug in private program. This program was related to the retirement finance planning and contained lots of subdomains with less functionalities. Testing such program requires lots of recon to do. It has strict WAF and Rate limiting in place so it gives you only choice to do more manual recon. While going through available functionality, i came across one domain with authentication. After testing for all authentication related functionalities , I came across password reset functionality. As usual, I submitted my test email in the reset password form and went to test email account’s mailbox. As per the screenshot , Password reset link was containing three parameters operation,authkey and uid(userid). I quickly logged in to another account,noted its uid ,swap it on the above password reset link and fired the request. As seen, With the updated UID request went successful and i was able to update the password of the another account that doesn’t belong to password reset link. In summary ,UID was not tied with the Authkey. Knowing UID of any user could allow to reset password of his account and takeover it using this vulnerability. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability"]},
{"title": "\n      Americans Still Falling for Romance Scams, Survey Shows\n    ", "link": "https://www.cnet.com/tech/services-and-software/americans-still-falling-for-romance-scams-survey-shows/", "date": null, "content": "\n    Here's how to protect yourself from malicious online Romeos and femmes fatale.\n   Romance scams are real, and people are falling for them. Sometimes, as the song goes, love hurts. And that can be especially true if what you thought was a real relationship turns out to be a con job that costs you a ton of money. Unfortunately, that's the case for the thousands of Americans who fall for   each year. More than 66% of the people polled for a survey released Wednesday by the cybersecurity company Malwarebytes admitted to being targeted by romance scammers, with 10% of the victims reporting that they lost more than $10,000 and 3% saying they lost $100,000 or more. The pulse survey — a short questionnaire — was conducted between Aug. 5 and Aug. 15 and includes responses from 850 readers of Malwarebytes' newsletter from around the world. The survey results track with federal data. Last year, the   received 64,003 reports of romance scams. which accounted for $1.14 billion in losses, with the median loss per victim totaling $2,000. Those numbers may seem staggering, but they probably represent just a fraction of what romance scammers walk away with each year. Experts say many victims never report being scammed because they feel ashamed or don't think coming forward will do any good. Forty percent of those polled in the August survey by Malwarebytes said they never told anyone about being scammed, while just 11% said they reported their crime to law enforcement or a nonprofit group.  Romance scams themselves, also known as pig-butchering scams, are nothing new. Scammers reach out to victims online, often through social media and dating platforms, and strike up an online relationship. They'll often build trust over weeks or even months before asking for money or personal or financial information. Of those polled by Malwarebytes, 26% of victims said their relationship went on for \"an extended period,\" with 12% percent reporting them lasting for several months and 5% saying they communicated with their scammer for a year or more. But once the scammers got what they were looking for they disappeared, and the vast majority of those scammed (94%) said they never recovered the money they lost.  Read on for guidance on how to sidestep a trap.  There's no way to know who the people behind them actually are. If someone claims to be overseas or otherwise says they can't meet in person, consider that a big red flag.  The companies behind   because they're bad for an app's reputation. So they have algorithms and other safeguards in place that are designed to spot scammy behavior. Be wary if someone wants to move your communications to an outside messaging app like WhatsApp or Signal.  If someone you've never met in person asks for money to travel to the US to see you, to pay for medical care, or to help deal with a sudden tragedy, you should view it as a scam. The same goes for the key to your  .  Never send personal information like your Social Security number. If someone asks for naked or otherwise explicit photos, say no. The FTC says cases of \"sextortion\" — where cybercriminals threaten to send such photos to people's contacts if they don't pay — are on the rise.  People who use dating apps and sites are probably tech savvy enough to have a social media presence. Check it out. While you're at it, do a reverse image search of your potential date's photo. If it pops up in other places under a different name, steer clear.  Don't send your money or crypto to online friends who say they have a great investment opportunity for you, even if they promise epic payouts.  As always, set good  , use   and make sure your  ,   and   are all up to date. These basic practices will go a long way toward protecting you if you click on or download something you shouldn't.  If you do fall victim to a scam, report it to the   and  .", "category": ["malware"]},
{"title": "\n      Kids, Schools Face Rising Threats, Homeland Security Chief Says\n    ", "link": "https://www.cnet.com/tech/services-and-software/kids-schools-face-rising-threats-homeland-security-chief-says/", "date": null, "content": "\n    Threats are increasing, both online and in the physical world, as students and educators are confronted by school shootings, ransomware attacks and more.\n   Homeland Security Secretary Alejandro Mayorka. In an age of increasing physical and online attacks against children and their schools, the efforts of educators and other school professionals are crucial to providing a safe environment where kids can learn, US Homeland Security Secretary Alejandro Mayorkas said Wednesday. Speaking at the start of the 2024 National Summit on K-12 Safety and Security, Mayorkas pointed to the   in Georgia, which left two students and two teachers dead. That attack was one of more than 1,300 episodes of gunfire on school grounds that have occurred since the   in Connecticut nearly 12 years ago. Those attacks combined have resulted in at least 436 deaths and 936 injuries, he said. Mayorkas noted that kids already face a flood of emotions and challenges at the start of any school year. \"It is a tragedy that at too many schools across the country these last few weeks have also been defined by terror in the face of an attack,\" he said. Meanwhile, schools are also dealing with online threats, Mayorkas said. A cybercrime group claiming responsibility for a   says it stole 200 gigabytes of sensitive data like Social Security numbers, medical records and counseling reports. And it's threatening to post the data online if the group isn't paid a $1 million ransom.  And a group of men from Michigan, including a high school teacher, are facing charges for allegedly  , Mayorkas said. Mayorkas also pointed to the   in Springfield, Ohio, in the wake of   but viral claims spread on social media accusing the town's Haitian immigrant population of stealing and eating house pets. City officials and law enforcement say there's no evidence of cats and dogs being stolen and eaten. Nevertheless,  , pulling it into the national spotlight. The bomb threats against schools, government buildings and the homes of city officials in Springfield followed. They were all found to be hoaxes, but schools were forced to close and kids missed out on valuable classroom time. \"None of this should be normalized,\" Mayorkas said. \"Schools should be sacrosanct. Children need and deserve a nurturing environment to learn and grow and each of you deserve the ability to focus on what you do best: Teaching, caring for, and inspiring our children.\" The annual school safety and security summit, which is in its third year, is a two-day virtual event organized by the Cybersecurity and Infrastructure Security Agency. The summit brings together government officials, educators and other experts to talk about physical and online security threats against K-12 schools.", "category": ["ransomware", "cybercrime"]},
{"title": "I Studied 100+ SSRF Reports, and Here’s What I Learned", "link": "https://infosecwriteups.com/i-studied-100-ssrf-reports-and-heres-what-i-learned-1654c72ee2df?source=collection_home---5------0-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share fter diving into over 100 write-ups and reports on Server-Side Request Forgery (SSRF), I’ve compiled the key insights and knowledge I’ve gained into this blog. Here, I aim to share a comprehensive overview of SSRF vulnerability Server-Side Request Forgery (SSRF) is a vulnerability that allows an attacker to send crafted requests from a vulnerable server to other internal or external resources. SSRF occurs when a web application accepts a URL or IP address input from a user and uses that input to make requests without properly validating or sanitizing it. Identifying SSRF in a target application is about understanding how that application interacts with external resources, processes URLs, and handles user input. The first thing you want to do is take a step back and review all the functions in the target application that fetch external resources. This could be anything from loading images to fetching data from other servers. These spots are the most likely entry points for SSRF vulnerabilities. : A common one. Think about functions where the application fetches something based on a URL — maybe an image importer or data fetcher. If the app is grabbing content from an external URL, you can bet it might be susceptible to SSRF, especially if there’s no proper validation. The idea here is to try feeding internal URLs like   or  : Oh yes, file uploads. These can be sneaky. Imagine an application that lets users upload files — things like PDFs, SVGs, or even Office documents. If the backend processes these files, SSRF might be hiding here. You can try uploading files with embedded URLs pointing to internal services (Reference:  ). : These are usually found in features that generate PDFs or images on the backend. When you find a target using a headless browser, try injecting URLs into areas that process HTML content. If you manage to make the backend fetch something unintended, you might have hit an SSRF goldmine! (Reference:  ).  Now, look for those features that allow you to check server status or application health. These functionalities often query internal services for status information — perfect spots for SSRF. If you find one, try manipulating the requests to hit internal endpoints or sensitive services (Reference:  ). Proxies are interesting because they route requests through the server. If the application lets you send requests through a proxy and doesn’t validate the URLs strictly, you’ve got a shot at SSRF. This is especially true if it doesn’t sanitize user-supplied URLs. Try sending requests to internal services or other unauthorized endpoints and see what happens (Reference:  ). It’s not just the app itself — sometimes, SSRF is hiding in the libraries and security mechanisms that the application uses. Authentication libraries, request-handling components, or other backend tools could have SSRF flaws. You’ll want to audit those, too, because these third-party systems often expose vulnerabilities you wouldn’t expect (Reference:  ). If your target integrates with third-party services like Google Drive, Amazon S3, or Dropbox, check if the app makes server-side requests to fetch or store files. These are excellent candidates for SSRF, as you can try manipulating the requests to fetch internal files or data from unauthorized services. By injecting a crafted URL into these integrations, you might access internal systems that were never meant to be exposed (Reference:  ). Pay close attention to how path parameters and host headers are handled. If an application uses path parameters to construct server-side requests, that’s another spot to test for SSRF. Try manipulating the parameters to redirect requests to internal resources. Similarly, the host header might be leveraged to control where requests are sent. Test for any weaknesses here — you might be able to influence the destination of requests using the host header (Reference:  ). Blind SSRF is a vulnerability where you can send requests to internal hosts but only receive a status code in response, rather than the full HTTP response. The most reliable way to detect Blind SSRF vulnerabilities is by using out-of-band (OAST) techniques. This involves triggering an HTTP request to an external system that you control and monitoring any network interactions with that system. One of the most common mistakes bug bounty hunters make is reporting DNS pingbacks alone. Simply receiving DNS pingbacks via Burp Collaborator isn’t enough to confirm an SSRF vulnerability. In fact, DNS pingbacks are often considered out of scope for bounties on most bug bounty platforms. When SSRF (Server-Side Request Forgery) and DNS Rebinding are used in tandem, they can create a formidable attack vector. Although this combination is not commonly exploited, it can lead to significant risks by effectively  . This is primarily because, from the browser’s perspective, the targeted server and the loopback address are seen as part of the same domain. Consider the following scenario: a victim is browsing the internet on their work laptop, which is connected to the organization’s network. Within this network lies an internal web application located at  , accessible only within the organization. To exfiltrate data from this internal web application, an attacker could utilize DNS rebinding as follows: Reference: infosecwriteups.com www.clear-gate.com lock.cmpxchg8b.com github.com When bypassing SSRF (Server-Side Request Forgery) filters, it’s essential to understand the various techniques available for evading protections. Here are several effective methods that you can use to get around SSRF defenses:  These can redirect requests to otherwise blocked endpoints. An open redirect vulnerability within the target application can be leveraged to bypass SSRF filters by redirecting requests to internal services.  Some SSRF protections block specific hosts (e.g., localhost or 127.0.0.1), but there are ways to disguise these IPs:  Some SSRF filters focus on blocking HTTP(S) URLs, but many web applications support other protocols like FTP or SMTP. By switching protocols, you may reach restricted resources not monitored by the filter.  Encoding or manipulating IP addresses in unusual ways can help bypass filters. This includes hexadecimal, octal, or decimal representations of IP addresses, which may not be recognized by simplistic filtering rules.  Many SSRF filters struggle with unusual or encoded URL formats. Experimenting with URL encoding, double encoding, or adding null bytes can help in cases where the filter doesn’t normalize or validate URLs thoroughly.  By testing how different parsers in the target application interpret URLs, you may identify inconsistencies that allow access to blocked endpoints. For an extensive reference on SSRF payloads, check the  . github.com github.com github.com github.com github.com github.com I hope this blog provides valuable insights and a deeper understanding to help you better understand and address SSRF vulnerabilities. Happy hunting! InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["vulnerability", "bug bounty"]},
{"title": "\n      Cybersecurity Awareness Month: Time to Lock Down Your Logins\n    ", "link": "https://www.cnet.com/tech/services-and-software/cybersecurity-awareness-month-time-to-lock-down-your-logins/", "date": null, "content": "  \n    Online attackers are looking to capitalize on sloppy security. Here are easy ways to shore up your digital defenses.\n   October is Cybersecurity Awareness Month and a good time to batten down your online accounts. It's October -- AC is off in many parts of the country, \"spooky season\" is in full swing and many of us have already had our fill of pumpkin spice lattes for the year It's also  . And while 31 days of online safety might sound ridiculous, it's still a great time to take a hard look at your cybersecurity situation. That means setting strong and unique passwords for all your online accounts, enabling two-factor authentication whenever possible, installing those pesky software security updates and doing your best to keep as much of your private information, well, private. That all may sound daunting, but there's plenty of help out there for those looking for a place to start. The Cybersecurity and Infrastructure Security Agency just kicked off its month-long educational push entitled \" .\" It's designed to drive home the importance of basic cyber hygiene practices. The campaign's website includes helpful tools for consumers, small and medium businesses and all levels of government, CISA director Jen Easterly said in a statement. \"Protecting ourselves online is about taking a few simple, everyday steps to keep our digital lives safe,\" per Easterly. In celebration of Cybersecurity Awareness Month, here are a handful of easy tips from CISA and others to keep your online accounts safe.  need to be long, random and unique. New this year, the U.S. National Institute of Standards and Technology has  . The latest recommendations state that organizations don't need to require passwords to include a mix of character types. Plus, companies are no longer required to set mandatory time periods for changing passwords, such as every 30 or 90 days. Many security experts had argued that these kinds of requirements were counterproductive because they pointed people towards easily guessed passwords -- think P@$$w0rd or Bree2024!. On the flipside, while NIST still technically requires that companies mandate passwords of at least eight characters, it now recommends requiring passwords with at least 15 characters and up to 64.  Yes, that's a lot of characters, but to make things easier, you can use a passphrase of a handful of unrelated words strung together, such as \"GrandmafootballCheeseburgerhat\" or \"lamppostParisHotsaucetrophyhat.\" Avoid personal details that can easily be guessed or answered by Googling or mining social media. Your dog's name, the model of your first car or the university you graduated from may be important to you, but they're bad password material. Don't recycle your   and use them on multiple accounts -- no matter how good you think they are. That way, you limit the fallout if one of your passwords is compromised. That also goes for the personal questions and answers you use to reset those passwords. Need help? Sign up for a   It'll keep all your logins organized and secure. Using the password generator and manager built into your browser is OK too. While some of those options have been clunky in the past, they've gotten better. For example, you can now use Google's Chrome browser to autofill passwords into apps on an iPhone, as well as auto-generate new ones. If your password does get compromised, a second layer of protection will go a long way toward protecting your account.  , also called MFA, two-factor authentication and two-step verification, requires that someone trying to access your account enter a second form of identification before getting in. MFA works in a host of different ways. It could be a code generated by an app, a biometric like a fingerprint or Face ID, or a   that you insert into your device. Yes, MFA slows down the login process. But if MFA is available, turning it on is a must. One word of warning: If you can, avoid MFA systems that text a code to your smartphone. Why?  , in which cybercriminals steal your phone number by calling your wireless provider and having it switch your number to a new phone and SIM card. It does happen, and if criminals take over your phone number, they'll get that text message too. These days, many cyberattacks and data breaches -- both big and small -- start with a phishing attack. These are scam emails or other kinds of messages that try to trick people into handing over money or personal information under false pretenses. While most of them still show up as emails, phishing also now comes in the form of social media posts,   (smishing) and even   (quishing). These days, phishing is easier than ever thanks to the advent of readily available   like ChatGPT. They make it much easier for  , especially those who aren't native English speakers, to write nearly infinite numbers of  .   Attackers could be pretending to be a charity looking for donations to help the   or the  . They also could masquerade as a member of your office's IT team or a friend who wants you to check out a  . Regardless of their form, the objective is usually the same: The attackers are looking to steal credentials, money or personal information. It may seem old school at this point, but cybercriminals are still phishing for credit card information. Work-related logins are some of the most sought out by cybercriminals because they could potentially be used to access corporate systems and their data, but even the logins for your personal emails and social media accounts have value. If compromised, they could put you in danger of financial fraud or identity theft, or be used down the road in another scam. To avoid being scammed, experts say, ignore emails and other messages from people and groups you don't know, and don't open any attachments. They could contain computer viruses. If you're concerned about an email's authenticity, pick up the phone and call the person who supposedly sent it. Better yet, help stop phishing by reporting it. If you're concerned about a work email, let your company's IT staff know. There's probably a dedicated \"report\" button for phishing and junk within your email app. The same goes for your personal email and social media accounts.  Consumers should be particularly careful when it comes to requests for  . Though banks might be able to make you whole in cases of credit card fraud, the same doesn't go for  , which is designed to be largely anonymous and untraceable.  can go a long way toward protecting you, but it needs to be kept updated so it protects you against the latest threats. That goes for all of your devices too. Laptops, smartphones and your vast collection of internet-connected devices all need to stay up to date. The easiest way to do this is to enable automatic updates. That way you'll get the latest patches without ever having to think about it. Don't forget about your router. It's the front door to your home network, so best to make sure it's locked.", "category": ["security updates", "data breach", "phishing", "identity theft", "two-factor authentication"]},
{"title": "\n      Watch Out for Prime Day Scammers When Shopping\n    ", "link": "https://www.cnet.com/tech/services-and-software/watch-out-for-these-prime-day-scams/", "date": null, "content": "  \n    Online scammers are looking to take advantage of eager shoppers. Here's how to protect yourself.\n   Watch out for scammers when shopping for Prime Day deals. Amazon's   is here, but shoppers on the hunt for great deals need to be careful that they don't get scammed in the process. Cybercriminals will be looking to use the massive online event as an opportunity to con unwitting shoppers out of their money and personal information. Ahead of the sale, which runs through Wednesday, researchers for the cybersecurity firm Check Point say they've spotted 1,000 new Amazon-related domains over the past 30 days and about 88% of those appear to be potentially malicious or scammy.  While Check Point says many of the sites appear to be \"parked,\" meaning that they're not currently being used for a website or email hosting service, they could be used as part of a phishing scheme. Some of the fake sites are designed to look just like Amazon. Unwitting shoppers reach them when they click on links in phishing emails, SMS messages or ads posted on social media. An example of a scam email spotted by Check Point. That's not exactly shocking. Amazon says scam activity traditionally spikes during the days surrounding Prime Day events. Oftentimes, consumers will receive messages saying that there's a problem with their Amazon account that needs to be fixed right away or they'll risk missing out on those limited-time offers. Other messages might claim that there's a problem shipping an item or are designed to look like an order confirmation for a very expensive item that the customer didn't buy. According to Amazon, nearly half of the impersonation scams reported to it worldwide were fake messages from scammers about fraudulent orders that didn't exist.   Regardless of their specific pitch, the objective of the scams is to steal payment card information or Amazon account usernames and passwords. And that could prove disastrous for shoppers who might not think before they click. An example of a spoofed Amazon website designed to scam consumers. Amazon-related scams aren't relegated to just Prime Day and aren't a new thing.  , Amazon was the second-most impersonated company in 2023. Scammers pretending to be Amazon accounted for 34,000 complaints and $19 million in losses reported to the commission. And it's not just Amazon. Scammers also try to pass themselves off as tech support for companies like Microsoft,  , shipping companies such as UPS and officials from government agencies like the IRS. Security experts say it's Amazon's widespread popularity makes it a top choice for scammers. If a consumer gets an email that looks like it's coming from a bank they don't have an account with, they're probably going to delete it right away. But just about everybody has an Amazon account, making scam emails featuring Amazon significantly more convincing. Outside of the holiday shopping season, Amazon's Prime Day events are some of its biggest sales days of the year and cybercriminals will be looking to capitalize on that. That means shoppers are going to need to be especially on guard as they look for deals.  And many Prime Day offers feature big price cuts and disappear fast, making it more likely that shoppers will click before they think. But that's exactly what they need to do. Here are a handful of tips from Amazon and Check Point for how to stay safe while shopping for Prime Day deals. If a site's address doesn't start with \"Amazon.com,\" it could be a fake. The same goes for other online retailers. Look for misspellings, additional punctuation and anything else that might seem a little off in the address. Amazon will never ask for payment over the phone, by text or by email. It also won't ask you to make them by bank transfer or through a third-party site. You're better off typing in the URL directly than clicking on a link that might be shady. If a message says you ordered something that you think you didn't, skip the link and just check \"My Orders\" in your Amazon account to see if that's true.  Hard-to-crack passwords are musts for all retail sites. That means they need to be long, unique and random. Don't be tempted to recycle even a great password if you've used it for another account. And whenever possible, enable two-factor authentication. Adding this extra form of authentication could save your bacon if your password does end up compromised.  Yes, a lot of Prime Day deals are limited-time, but any offer that says you need to buy right away needs a closer look. Cybercriminals are banking on you clicking before you think. Any legitimate retail site uses SSL encryption by now. It's signified by a lock symbol at the start of the URL. If it's missing, shop elsewhere.  If fraudulent charges show up, you won't be on the hook for the cost.   Most email programs have buttons that let you report spam or phishing. Scam text messages can be reported by forwarding them to 7726 (SPAM). Prime Day scams should be reported to Amazon through their app or  .  Yes, we've heard this so many times it's officially a cliche, but any mind-blowingly amazing deal should be treated like a scam, because it probably is. If you can't verify it on the company's site, steer clear. ", "category": ["phishing", "encryption", "two-factor authentication"]},
{"title": "Infosec Writeups Is Now In The Boost Nomination Pilot Program", "link": "https://infosecwriteups.com/infosec-writeups-is-now-in-the-boost-nomination-pilot-program-46d866639af8?source=collection_home---4------0-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share Hola hackers! I’m happy to announce that   is a part of Medium’s Boost Nomination Pilot. This means our editors can nominate stories, and if the Medium curation team approves of these nominations, the stories would be boosted. Medium’s new algorithm has introduced a cool new feature: the Boost. When your story gets boosted, you stand a chance of reaching an even wider audience than the standard readership of  Let’s take a look at what the CEO of Medium has to say about this cool new feature — “Boosts (range) between 500 views and 100,000 views. Our goal is that every Boosted story should get at least 500 extra views within the first week. In practice, that’s usually enough to tip a story over to a much, much wider audience.” —  ,  100,000 potential new views? Insane, I know, but that’s not the best part. According to  , Product at Medium,  “When you   in the Partner Program, members-only stories that get Boosted will earn at a higher rate, in addition to receiving the usual distribution bonus.” —  ,  Getting boosted is the new cool on Medium, and  The criteria for Boosting stories is based on certain factors: Authors should make it a point to establish their credibility and experience in the article. Readers should get a real understanding why YOU are the right person to write about this. Add value to the reader’s lives. People should leave your article having learned something cool. Make the titles COMPELLING. Any person who’s casually scrolling through must feel compelled to read your article just by looking at the title. Respect the reader’s time. Don’t add fillers, emojis, images, or GIFs just for the sake of it. Don’t use clickbait. Write in a compassionate tone, so your posts help the readers. Structure your stories well. Use   to make your story visually appealing and easy to digest. In fact, we’re doubling down on how strict we are with AI-generated articles. If we detect you’ve used AI to write a part or whole of your article,   isn’t the right place to publish. Remember: We are looking for YOUR story. So, even if you talk about some hack or bounty, talk about HOW you did it, what were your emotions while dealing with it. Document your journey. Make it as authentic as possible. “To reach an audience on Medium, a good place to start is to focus on your own lived experience, and consider why sharing that experience can be valuable to another person. Why are   writing about this particular topic? What can you uniquely bring to the story, and why is that valuable to another person?” —  ,  For more details on what makes a story boost-worthy, please check   — help.medium.com The new writers application process for   has changed a bit. Please go through the instructions below to apply to be a writer. Apply to be a writer by  . We add new writers every Friday. If you’ve already filled the form and haven’t been added yet, don’t fill it again. We’ll get back to you. Once you are a writer and your story is ready, click on the three dots at the top right of your story and select “Add to publication”. From the list that pops up, select “ ” and click on “Save”. The final step is to select the green button that says “Submit” right next to the three dots. That’s it from my end for this time. I hope to read your incredible stories soon. Lots of love, Anangsha Editor,  InfoSec Write-ups Writer. Entrepreneur. Cybersecurity Advocate. Pole Dancer. DM:  . YouTube:  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["hacker"]},
{"title": "Best Identity Theft Protection and Monitoring Services for October 2024", "link": "https://www.cnet.com/personal-finance/identity-theft/best-identity-theft-protection/", "date": null, "content": "We scoured dozens of identity theft protection services available today. These eight stuck out to us as the very best. Danni Santana Editor Danni Santana has spent seven years as an editor and business journalist covering industries like sports, retail, restaurants, and now personal finance. Most recently he worked as a retail editor at Business Insider.\r\n\r\nHe is a graduate of the Craig Newmark Graduate School of Journalism at CUNY. His biggest loves outside of the newsroom include, running, cooking, playing video games and collecting sneakers. Courtney Johnston Senior Editor Courtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor. Danni Santana Editor Danni Santana has spent seven years as an editor and business journalist covering industries like sports, retail, restaurants, and now personal finance. Most recently he worked as a retail editor at Business Insider.\r\n\r\nHe is a graduate of the Craig Newmark Graduate School of Journalism at CUNY. His biggest loves outside of the newsroom include, running, cooking, playing video games and collecting sneakers. Courtney Johnston Senior Editor Courtney Johnston is a senior editor leading the CNET Money team. Passionate about financial literacy and inclusion, she has a decade of experience as a freelance journalist covering policy, financial news, real estate and investing. A New Jersey native, she graduated with an M.A. in English Literature and Professional Writing from the University of Indianapolis, where she also worked as a graduate writing instructor. CNET editors independently choose every product and service we cover. Though we can’t review every available financial company or offer, we strive to make comprehensive, rigorous comparisons in order to highlight the best of them. For many of these products and services, we earn a commission. The compensation we receive may impact how products and links appear on our site.", "category": ["identity theft"]},
{"title": "\n      Marriott to Boost Data Protection Practices as Part of Deal With FTC\n    ", "link": "https://www.cnet.com/tech/services-and-software/marriott-to-boost-data-protection-practices-as-part-of-deal-with-ftc/", "date": null, "content": "\n    The agreement settles charges stemming from a trio of data breaches that compromised the personal information of more than 344 million customers.\n   Marriott says it's beefing up security per the FTC's order. Marriott International and its Starwood Hotels & Resorts Worldwide subsidiary will put in place a \"robust\" new data security program to settle charges that its poor security practices led to a trio of data breaches that affected more than 344 million of its customers, the US Federal Trade Commission said Wednesday. As part of the   (PDF), the hotel chain also agreed to give US consumers a way to request deletion of personal data tied to their email address or loyalty rewards account number. Marriott also will be required to review loyalty rewards accounts upon customer request and restore stolen loyalty points. The data breaches, which took place between 2014 and 2020, included a massive theft detected in November 2018 where cybercriminals  , compromising 339 million customer accounts and  .   Customer data exposed in the other breaches included names, addresses, emails, payment card information, phone numbers and birthdays as well as loyalty account details and information like room preferences.  In addition, under a  also announced Wednesday, Marriott agreed to pay a combined $52 million to 49 states and the District of Columbia to settle similar charges. The FTC does not have legal authority to impose civil penalties in the case. \"Marriott's poor security practices led to multiple breaches affecting hundreds of millions of customers,\" Samuel Levine, director of the FTC's Bureau of Consumer Protection, said in a statement. \"The FTC's action today, in coordination with our state partners, will ensure that Marriott improves its data security practices in hotels around the globe.\" Marriott said in a   that many of the security and privacy requirements being imposed by the FTC have already been put in place or are in progress. \"Protecting guests' personal data remains a top priority for Marriott,\" the company said. \"These resolutions reaffirm the company's continued focus on and significant investments in maintaining and adapting its programs and systems to assess, identify and manage risks from evolving cybersecurity threats.\"   In its proposed complaint, the FTC charges that Marriott and Starwood didn't do enough to protect their customers' data from online thieves. Specifically, the FTC says that among other failures, they didn't put in place adequate password, access and firewall controls. The FTC also says the companies didn't properly segment their network systems, which would have helped protect data in the event of a breach. And they didn't patch outdated software and systems, or put in place adequate multifactor authentication. Those lax practices combined allowed cybercriminals to breach the systems and steal massive amounts of customer data, the FTC says. The commission voted 3-0 with two members abstaining to issue the administrative complaint and to accept the proposed consent agreement. The agreement will be published in the Federal Register and subject to public comment for 30 days. After that period, the commission will decide whether to make the proposed consent order final.", "category": ["data breach"]},
{"title": "Submission Guidelines — InfoSec Writeups", "link": "https://infosecwriteups.com/submission-guidelines-3952000f119", "date": null, "content": "InfoSec Write-ups Listen Share Welcome to  . This publication has been created to be your go-to place to find a collection of awesome write-ups from the best hackers on topics ranging from bug bounties and CTFs to vulnhub machines, hardware challenges, and real-life encounters that are published on Medium. It aims to help people in the InfoSec community share and discuss new ideas and methodologies and learn from each other. Many readers are unaware of this, but you can clap 50 times on any post. So, if you like something, don’t think twice; leave some more claps. Before you proceed with the article, here is our   in video format (featuring our editor  ): If you think this publication is a good place for your write-up and you are not already a writer in this publication,  Our editors are always looking for great pieces published on Medium to share with our audience. If one of our editors left a private note on your story asking you to submit it, here’s what you can do. According to  , submit your story to Infosec Write-ups. It is preferred to submit drafts for publication rather than submitting a previously published post. Submitted drafts will be published within 24 hours. We started small but picked up a lot of traction, and the number of followers kept on increasing. So we also decided to add as many good writers as possible and keep providing good and exciting content.  that Infosec Writeups reserves the right to add relevant text and/or links at the bottom of the article. This won’t affect your readability or context. Only submit articles to us if you agree to this clause. Thank you. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "category": ["hacker"]},
{"title": "Bug Bounty", "link": "https://infosecwriteups.com/tagged/bug-bounty", "date": null, "content": "IDOR, one of the most common vulnerabilities in applications, can lead to major security leaks. Today… It was purely my experience , i respect other bug bounty hunters :)", "category": ["bug bounty"]},
{"title": "\n      Online Scammers Looking to Cash In on Hurricane Milton Disaster\n    ", "link": "https://www.cnet.com/tech/services-and-software/federal-officials-warn-of-scammers-looking-to-cash-in-on-hurricane-milton-disaster/", "date": null, "content": "\n    Disaster and tragedy bring out the worst in some people. Here's how to protect yourself from criminals both online and in person in the wake of a natural disaster.\n   If you need help, make sure you're getting it from the right people. In the wake of Hurricane Milton, federal officials are warning consumers to be on the lookout for scammers both in person and online who will try to take advantage of what will likely be a terrible situation for many people. , Milton made landfall near Siesta Key, Florida, as a Category 3 storm Wednesday night then raked across the state before reaching the Atlantic Ocean. Wind speeds topped 100 mph in the Tampa, Sarasota and St. Petersburg areas. On Wednesday the Federal Trade Commission, the Department of Justice and the Consumer Financial Protection Bureau   those affected by the storm, as well as the well-meaning people trying to help them. The FTC says scams could come in the form of fraudsters impersonating hurricane-aid charities. At the same time, the commission is already getting reports of price gouging related to storm necessities like hotels, groceries and gas. \"No American should have to worry about being ripped off when fleeing a hurricane,\" FTC Chair Lina M. Khan said in a statement. \"In partnership with state enforcers, the FTC will keep fighting to ensure that Americans can get the relief they need without being preyed on by bad actors exploiting a crisis.\" Meanwhile, the Cybersecurity and Infrastructure Security Agency released a separate advisory warning of potential online scams that could come in the form of emails, messages on social media, texts, phone calls or even a knock on their door from an actual person. In addition to possibly impersonating a charity, scammers might also pose as government officials or storm victims themselves, CISA says. It urged consumers to exercise caution and make sure that they're dealing with legitimate people and groups before handing over any money or personal information. Here's some advice from the FTC, CISA and others for how to protect yourself from scammers in the wake of Hurricane Milton. If the message is coming from a person or group you haven't dealt with before, don't respond. Stick to major charitable organizations that you know are legitimate. Go directly to their website. Avoid clicking on links in emails and other kinds of messages. Don't click on attachments. They could contain malware.  Admittedly, a lot of people are going to need help fast, but if the experts are right, this is going to be a long rebuilding process. Real charities will happily take your money after you've verified their legitimacy. Criminals, on the other hand, want you to hand it over before you have a chance to think about it.  Scammers will often create messages and sites that look just like those of real charities and organizations, but just a little different. If something seems off about a logo, font or an email or web address, find a different site.  Admittedly, it can be tough, but the   for how to figure out if a group is legit or not including links to organizations that can help you do research.   If you need help or information, consult your local officials or national disaster response organizations including the   and the Department of Homeland Security's  . Government officials, including those from FEMA, will never ask for money in exchange for disaster relief. Be wary of people promoting non-existent businesses or investment opportunities related to disaster recovery, such as rebuilding or flood-proofing. Requests for payment in the form of a wire transfer, gift card, payment app, cryptocurrency or in cash are also red flags.  Give the FTC a heads up by reporting fraud, scams and bad business practices at  . You also can report them to the FBI's  .", "category": ["malware"]},
{"title": "\n      Security Experts Warn Gmail Users of More Sophisticated AI Hacks\n    ", "link": "https://www.cnet.com/tech/services-and-software/security-experts-warn-gmail-users-of-more-sophisticated-ai-hacks/", "date": null, "content": "\n    The scams can target Gmail accounts, many of which are part of Google Workspace's 3 billion users.\n   Google recently helped launch the Global Signal Exchange platform to identify phishing attempts and fraud. Security experts are warning that AI-driven phishing attempts and scams targeting Gmail accounts are getting harder to detect and much more sophisticated. The attempts can include fake notifications from real Google addresses, convincing phone calls from AI or human agents that appear to come from legitimate Google phone numbers and links pointing to Google pages that serve to make the scam seem legitimate. In September, Microsoft products security expert Sam Mitrovic  . Y Combinator CEO Garry Tan   about a similar phishing attempt he encountered.  Cybersecurity writer Davey Winder  , as well as information about how scammers are using Google Forms as another method of fooling people with Google accounts. In an email to CNET, a spokesperson for Google   that offers advice on how to avoid email scams, phone and text scams, and scams that can occur during web browsing. Google recently helped begin efforts on a   with the Global Anti-Scam Alliance and DNS Research Federation to create a database of scam and fraud attempts. The Exchange   from Amazon, Meta, Mastercard and Trend Micro and will initially focus on URLs, IP addresses and reports of scams and phishing attacks. It's set to launch officially on January 1, 2025. According to Winder, two ways Gmail users can help protect themselves are to   (including what to do if  ). Users who are more likely to be targeted, including politicians and journalists, should look into  , which can include the use of a hardware security key (basically a device such as a secure USB drive for logins). Google   to the program.", "category": ["phishing"]},
{"title": "\n      Best Password Manager in 2024\n    ", "link": "https://www.cnet.com/tech/services-and-software/best-password-manager/", "date": null, "content": "\n        Article updated on    \n    If you need a secure way to store, manage and autofill passwords, these password managers will help you protect your accounts.\n   CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. \n      What to consider\n     \n      Security\n     Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. \n      Price\n     Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user.  \n      Cross-platform compatibility\n     Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. \n      Features\n     Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring.  \n      Secure sharing capabilities\n     Most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager.  \n      Secure file storage\n     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. \n      Family plan allowance\n     If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. CNET’s expert staff reviews and rates dozens of new products and services each month, building on more than a quarter century of expertise. \n      What to consider\n     \n      Security\n     Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. \n      Price\n     Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user.  \n      Cross-platform compatibility\n     Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. \n      Features\n     Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring.  \n      Secure sharing capabilities\n     Most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager.  \n      Secure file storage\n     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. \n      Family plan allowance\n     If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. Simple passwords with your name and a few digits are far too easy to crack these days. The technology used to crack passwords is just too sophisticated, and there’s too much at stake if someone gets a hold of your passwords, so you'll need a way to keep your account logins secure. If you are looking for a reliable way to protect your passwords without the hassle of memorizing them all, a good password manager can help you out. Secure passwords are ideally a complicated and unique combination of letters, numbers and characters. The more secure your password, the tougher it will be to remember. A password manager can generate these for you -- and make them as randomized as you'd like -- and it can eliminate the fear of losing them. You'll still use a master password to log in to your password manager, but it's the only one you'll need to remember. There are a lot of options out there, so CNET tested a dozen of the most popular password managers on the market. Whether you're looking for a free password manager or you're open to spending a little money, we've evaluated everything from encryption to pricing, features, platform compatibility, privacy policies and company history to make picking the best secure password manager easier for you. Based on our rigorous testing,   is currently CNET's top pick for the best password manager, thanks in large part to its commitment to transparency, ease of use and its unbeatable free tier. Bitwarden is a solid choice if you want well-rounded premium password management that's secure, transparent, budget-friendly and easy to use -- or if you want a legitimately unlimited password management solution for free. There is also a desktop app and a mobile app you can use for easy access across all of your devices. Bitwarden scores points for being fully open-source, secure and   by third-party cybersecurity firms, giving it a level of transparency that sets it apart from its peers. Meanwhile, its free plan lets you store an unlimited number of passwords and access them across an unlimited number of devices -- something most free password managers don’t offer. That’s in addition to many top-tier features like secure password sharing, encrypted vault export and a username and password generator. If you’d rather opt for a premium plan, Bitwarden offers full vault health reports, 1GB file storage, emergency access (where you can designate a trusted contact to access your vault in case of an emergency), Bitwarden authenticator and advanced multifactor authentication with YubiKey, FIDO2 and Duo. Premium plans are budget-friendly at $10 per year for individuals and $40 per year for families, which allows for up to six users. 1Password is a breeze to use on all your devices and includes some handy extras. The user interface is slick and intuitive, and its autofill functionality works seamlessly. Sharing passwords and other vault items with others is also simple, even if the people you’re sharing them with aren’t 1Password users. One stand-out feature is Travel Mode. When activated, vault items that you haven't marked as \"Safe for Travel\" will be temporarily erased from the app on all of your devices. This helps keep particularly sensitive login information or financial information inaccessible to any authorities who may ask you to unlock your device for inspection. 1Password is slightly on the more expensive side at $36 per year for individual users or $60 per year for families. While you won’t find a free plan, 1Password includes a 14-day free trial. Like other top password managers, Keeper lets you store and sync an unlimited number of vault items across an unlimited number of devices. Keeper offers apps for MacOS, Windows, Linux, iOS and Android, along with an extension for popular internet browsers including Chrome, Firefox, Safari and Brave. I like Keeper’s “offline mode,” which allows you to access your vault items even if you're somewhere with zero or limited internet access.  Standard pricing is $35 per year for individuals and $75 per year for a family of five, which is on the expensive side. A free plan is available if you don’t want to pay for a subscription, but it’s basically useless because it limits access to a single mobile device and 10 passwords. You’re better off going with Bitwarden if you want a legitimate free password manager. Alternatively, you can try Keeper’s premium tier before fully committing thanks to its generous 30-day free trial. NordPass is well-designed, easy to navigate and works seamlessly across all platforms. The free version lets you store an unlimited number of vault items across all of your devices, and you get access to additional basic features like a password generator, advanced multi-factor authentication,   and automatic sync. If you’re on the free plan, you can use it on as many devices as you like, but you can only be logged into a single device at a time -- which is a moderate inconvenience, but I appreciate that NordPass lets you access your passwords on an unlimited number of devices nonetheless.  With a premium plan, you can be logged into as many devices as you’d like. Paid users also have access to password health reports, data breach scanner and monitoring, secure sharing, emergency access and the ability to attach files to vault items totaling up to 3GB. Individual premium plans cost $28 for the first year (renews at $35 annually thereafter) or $43 for the first two years combined (then $35 annually). If you opt for the family plan, you’ll get six premium user accounts for $44 for the first year (then $72 annually) or $67 for the first two years combined (then $72 annually). While Dashlane's password generator isn't quite as robust as what others offer, it works well and offers sufficient options for customization. Premium plans also include access to a virtual private network from  , a middling VPN that falls short of cracking our list of  . Dashlane’s free plan used to allow for unlimited passwords on one device but now   on a single device -- which is slightly more generous than Kepper’s 10 password limit but just as useless. Premium plans allow for an unlimited number of passwords on an unlimited number of devices but are decisively pricier than the competition (while delivering a lesser product). Individual plans cost $60 per year, which is more expensive than some of its rivals’ family plans. Dashlane's family plan covers up to 10 users, but for most people, 10 users is probably overkill and not worth the steep $90-per-year cost. Perhaps Dashlane’s high cost can be attributed to the fact that a VPN is included in the price, but you’re better off getting a quality VPN and a cheaper password manager separately than getting HotspotShield bundled with your Dashlane subscription. With the numerous password manager options available, it can be overwhelming to choose the right one. CNET has thoroughly tested dozens of password managers over the years, and we've developed a pretty good idea of the types of things to look for in a quality service. Here are the most important things to consider when choosing a password manager: You're putting a ton of trust in your password manager to keep your logins safe, so the security of the service should be your top concern. Look for a password manager that operates on a zero-knowledge basis and secures user vaults with industry-standard AES 256-bit encryption. Independent security audits can also help bolster trust in a password manager. While you're researching password managers, it's important to consider the company behind the service. Has the company been involved in any security incidents that have potentially compromised user data? If so, it's best to look elsewhere.   Pricing for password managers can vary from provider to provider, so you'll want to pick a service that will fit your needs and budget. Most password managers have pricing plans for individuals, families and businesses. Pricing for family and business plans is more expensive than individual plans, but family and business plans cover multiple users, while individual plans are limited to a single user. Many password managers also offer free tiers, but they almost always come with limitations on features or device allowance. Some services, like Bitwarden, allow for unlimited vault entries on unlimited devices on their free plan. Most password managers also offer either a free trial or a money-back guarantee, so you can try them risk-free.    One of the most important aspects of using a password manager is having it available on all of the devices you use. Before you purchase a subscription to a password manager, make sure it's compatible with all of the devices, operating systems and browsers you regularly use. The password manager should also automatically sync your passwords and other vault items across all of your devices. This helps ensure that you can access your passwords at any time from any of your devices.  Make sure your password manager has standard features like multifactor authentication, a password generator, secure sharing and automatic sync. Other useful features to look out for include secure file storage, login autofill, vault health reporting and data breach and dark web monitoring. Many password managers also allow you to store things like credit card numbers, bank account numbers, health data, PIN codes and secure notes in addition to storing your online login credentials.   It's never a good idea to share passwords or other highly sensitive information via email or SMS, but most password managers include secure sharing features that allow you to safely share vault items with others. Some password managers allow secure sharing only with other users of the same service, while others allow secure sharing with anyone, regardless of whether they use a password manager. Secure sharing features are also typically customizable and allow you to set restrictions on how many times a shared vault item can be accessed or for how long. If you're planning on sharing certain passwords with family members, friends or colleagues, it's a good idea to check on the password manager's secure sharing capabilities to ensure they suit your security needs.     Some password managers offer secure file storage options that allow you to safely store documents like health records, bank statements, insurance paperwork and title documents. Some allow for 1GB of secure storage space, while others may offer up to 10GB. Depending on whether you need to store files and how much space you would need, it's a good idea to look into the secure file storage capabilities and allowances of the password manager you're considering. If you want to share a password manager subscription with family or friends, it's a good move to opt for a password manager family plan. With a family plan, one subscription fee covers anywhere from five to 10 individual accounts, depending on the provider. A family plan is a convenient and cost-effective option for anyone who wants to easily and securely share vault items with trusted contacts. The most important consideration for any password manager is the security of the product, so we look at what encryption standards it uses, whether it's a zero-knowledge service and whether it has been independently audited.  We carefully examine each provider's privacy policy to get a sense of what personal data is collected from users and how that data is secured. We examine the provider's pricing and check whether a free version is available. We also test how the password manager performed across platforms, devices and operating systems. We test the services' multi-factor authentication, password generator and secure sharing features and evaluate the overall look and feel of the UI, including monitoring and password health reporting, if applicable. Enpass is unique in that it doesn't have centralized servers that store your data. You can either store your vault on your devices themselves or in your personal cloud storage like Dropbox or iCloud. That makes it a great option for anyone who wants complete control over the storage of their password manager vaults. On the downside, the app is a bit outdated and clunky but still fully functional. KeePass is completely open source and completely free. It's a powerful password manager but geared primarily toward the techie crowd. Regular people may find the interface outdated and cumbersome to navigate compared with those of other password managers. Apple launched a new Passwords app with the release of iOS 18 in September. While it’s a step up from the basic functionality offered by iCloud Keychain, Passwords is still rather barebones and mostly only useful for Apple users. That said, Apple’s Passwords app is a secure and convenient place to store your passwords, passkeys, authentication codes and Wi-Fi network passwords across your Apple devices. I like the app’s Security section that alerts you if it detects any compromised or reused passwords. You can also securely share passwords and passkeys with trusted contacts. The Passwords app is only available for iPhone, iPad and Apple Vision Pro, but you can leverage iCloud Keychain to access your passwords on a Mac or PC. If you’re looking for a password manager that you can use for the long term for free, then it needs to offer two things for it to be worth it: strong zero-knowledge encryption and auto-syncing of unlimited passwords across unlimited devices.  Having access to all of your passwords across all of your devices is the foundation of your password manager’s effectiveness. You’ll be able to easily get to all of your (strong and unique) account passwords wherever you are and on any device you have on hand, which can reduce the temptation to take the unsafe route of using the same easy to remember password across all of your online logins. If the free password manager you’re using can only be used on one device and for only a handful of passwords, then it’s practically useless beyond just giving you a preview of what you can expect the software’s paid tier look and feel to be like. A free password manager typically won’t include advanced features like detailed vault health reports, data breach scanning and encrypted file attachments, but if all you need is a safe place to store all of your passwords that you can access from all of your devices, then there are a few options. I recommend using Bitwarden if you want a legitimate unlimited free password manager that you can use for the long term. It’s one of the few password managers that offers a free tier that delivers core password manager features -- plus a few extras -- at no cost. Bitwarden is the most secure password manager right now thanks to its zero knowledge end-to-end AES-CBC 256-bit encryption, excellent security features and annual independent security audits. And while many other password manager apps are closed-source, Bitwarden is fully open-source, meaning that its entire source code is publicly available for anyone to scrutinize. Bitwarden also operates a Security and Compliance Program that defines policies “that govern security practices and processes and are continually updated to be consistent with applicable legal, industry, and regulatory requirements,” according to its  . Yes, security experts recommend using a password manager as an effective way to maintain the security of your online accounts. Weak and reused passwords can make it easy for bad actors to gain access to your accounts, potentially leading to consequences like identity theft or financial loss. But security experts recommend password managers because they can create and store unique, complex passwords that make it exponentially more difficult for anyone to crack your account logins. Security experts also like password managers because they can monitor the dark web for potentially compromised credentials, notify users of data breaches and even help guard against phishing attacks by not autofilling passwords into suspected phishing sites. After signing up for a password manager, you'll be prompted to create a master password. Your master password should be a strong password or passphrase that you can remember but haven't used for any other logins. The master password is the one password you need to access your password manager vault. The next step is to download the app or browser extension to the devices you plan to use the service on. You can also opt to use the web-based user interface if you prefer (if offered by the service you choose). Once you've signed up and gotten acquainted with the app, start adding passwords and other vault items you want to keep secure. If you have passwords stored in a web browser or other password manager, you can easily import them to the new password manager. You also can manually enter the login credentials, or you can have your password manager automatically save your credentials when you log into one of your online accounts. Once you've got your passwords saved, you can use your password manager to autofill the login credentials for the accounts you have stored in your vault. Password managers are extremely attractive targets for cybercriminals -- and yes, they can be hacked. All of the password managers listed above operate on a zero-knowledge approach to password management, meaning that not even the company storing your vault data can decrypt the information contained within. Only the user can decrypt and access their vault. Similarly, the password managers featured above don't have access to your master password.  All of this makes it difficult for an attacker to gain access to the passwords and other items in your vault. In the case of the 2022 LastPass breach, attackers were able to steal encrypted user vaults. So all the attacker would need to do is crack the master password for a stolen vault to access everything inside, which would be an easy task if the master password is weak. The best way to protect your data in case of a similar breach is to create a strong master password. A strong password should ideally be a minimum of 12 characters. You can also create passphrases that consist of randomly strung-together words. The best password managers offer customizable password generators that you can use to create truly random passwords and passphrases based on the criteria you select. The longer and more complex the password or passphrase, the better. There are a few legitimate free password manager options for anyone who wants to securely store their passwords without paying a dime. Bitwarden is CNET's recommendation for the best free password manager. NordPass is another solid option. And if you're more technically inclined, you can go with KeePass, which is completely free and unlimited but not as easy to use as many others.  But if you want all the bells and whistles included in a premium, paid password manager, there are some budget friendly options priced between $10 and $30 per year. LastPass is one of the most well-known and popular password managers on the market. In light of its lengthy history of security incidents -- including the   in which an \"unauthorized party\" stole customer account information and sensitive vault data -- CNET can't in good conscience recommend LastPass to our readers. While the company says it’s since boosted security, the alarming nature of that latest data breach has severely undermined trust in LastPass products. CNET will conduct a thorough re-review of the service in the future, after which we will reevaluate whether LastPass should return to our list of best password managers. In the meantime, you can turn to any of the password managers featured above.", "category": ["data breach", "phishing", "encryption", "identity theft", "dark web"]},
{"title": "Alleged Bitcoin hacker searched 'signs the FBI is after you'", "link": "https://www.bbc.com/news/articles/c20pvkg35xyo", "date": null, "content": "A man arrested in connection with a hack of the US markets regulator's X account searched \"how can I know for sure if I am being investigated by the FBI,\" according to court documents. Eric Council Jr, 25, of Athens, Georgia, is also alleged to have searched for \"signs that you are under investigation by law enforcement... even if you have not been contacted by them\". He is accused of being part of a group which hacked the Securities and Exchange Commission (SEC) social media in January to make a fake post about Bitcoin, causing the cryptocurrency to surge in value. The regulator   a key security step to access its X account had been removed.  The post sent by hackers on the SEC's X account made the false claim the regulator had allowed Bitcoin to be part of mainstream investment funds. This caused the price of the cryptocurrency to rise by about $1,000 (£770), according to the US Department of Justice, before falling by $2,000 when it was found to be untrue. Despite the confusion caused by the hack, the SEC   Bitcoin to be a part of mainstream investment, through what are known as spot Bitcoin exchange-traded funds. According to   Eric Council Jr went under the aliases Ronin, Easymunny, and AGiantSchnauzer online, and searched \"SECGOV hack\" and \"Telegram sim swap\".  to have searched \"federal identity theft statute\" and \"how long does it take to delete Telegram account\". Telegram is a messaging app with more than 950 million monthly active users. The SEC has confirmed its account was compromised by a Sim swap attack. This is when someone fraudulently gets a mobile phone carrier to apply an existing telephone number to a new Sim card. In this case, the alleged perpetrator is accused of creating a fake ID with the details of an SEC employee which were passed on to him by co-conspirators. He is then alleged to have used these details to get the employee's mobile number transferred to a new Sim. Co-conspirators are alleged to have used access codes sent to the phone to login to the SEC's X account. This was made easier due to a lack of adequate protection on the account. SEC staff had asked X in July 2023 to suspend multi-factor authentication (MFA), a security measure used to help verify the person logging in. It subsequently re-enabled MFA after the hack. Eric Council Jr is charged with one count of conspiracy to commit aggravated identity theft and access device fraud. If found guilty, he could face up to five years in prison.  Copyright 2024 BBC. All rights reserved.  The is    ", "category": ["hacker", "identity theft"]},
{"title": "Musk promises self-driving Tesla taxis, but are they safe?", "link": "https://www.bbc.com/news/videos/c20p2gp4npeo", "date": null, "content": "Elon Musk has unveiled Tesla's long-awaited robotaxi, which he claims will hit the market as early as 2027.  BBC Tech Correspondent Lily Jamali analyses the 'robocabs' and whether their reliance on camera technology might be undermining the vehicles' safety.  Musk also debuted \"Optimus\" robots, which he claims will free up human time and take on chores. Cyber Correspondent Joe Tidy has an AI clone of himself built to see how sophisticated they can be. Joe Tidy played along for over two months to learn more about how the scams work. The BBC's Samira Hussain is in Delhi, trying to catch a flight to go on holiday with her family. Ten teenagers swap their smartphones for brick phones as part of a week-long digital detox. BBC Analysis editor Ros Atkins looks at what what is being done to prevent minors seeing harmful content. Piers Morgan and Oprah have criticised the use of AI deepfake ads used to promote a \"manifestation\" guide. BBC Click reporter Paul Carter tries out the Atom Limbs prosthetic with 'full range of human motion'. Jason lost his arm in an accident in 2012, and he's been working with Atom Limbs to test their prosthetic. The BBC's James Clayton tests out the latest tech at CES 2024 in Las Vegas. Researchers at University College London are investigating how the tech can help with early diagnoses. Here's what our main takeaways are from the long-awaited trailer for the gaming blockbuster. The prime minister says Elon Musk's background in AI companies means he is worth speaking to. The King called for unity in addressing challenges ahead of a major UK summit on AI safety. The US tech giant is looking at ways it can automate more of its operations. With a team of 30 scientists, tech entrepreneur Bryan Johnson spends millions on his body every year. Google UK boss Debbie Weinstein tells people to \"use Google\" to check information from chatbot Bard. The BBC's James Clayton tries out Intel's \"Fakecatcher\", software which the company believes can help detect deepfake videos. Filmmakers are using AI to generate short films and adverts. But are they any good? The question was posed at the world's first robot-human press conference at a UN summit in Geneva. WhatsApp, iMessage, Android Messages and Signal all use the super secure technology called end to end encryption. So how does it work and why are governments opposed to it? Copyright 2024 BBC. All rights reserved.  The is    ", "category": ["encryption"]},
{"title": "The weird history of the barcode", "link": "https://www.bbc.com/future/article/20241018-barcodes-at-75-how-black-and-white-lines-went-into-space-and-stoked-fears-of-the-antichrist", "date": null, "content": "Lasers. That's what supermarket staff need, insisted Paul McEnroe. Scanners in the checkout and little pistol-shaped laser guns, too. Point, shoot, sell! In 1969, it was an outlandish vision of the future: these lasers would scan weird little black-and-white markings on products that McEnroe and his colleagues at IBM had designed. It would speed up supermarket queues, he enthused. The solution would come to be known as the barcode. At this point in history barcodes had never been used commercially – though the idea had been brewing for decades following a   by one of the engineers who was now part of McEnroe's team. The IBM engineers were trying to bring barcodes to life. They had a vision of the future where shoppers whizzed through the checkout with lasers scanning every item they wanted to purchase. But IBM's lawyers had a problem with the future. \"No way,\" they said, according to McEnroe, a now-retired engineer. Their fear was \"laser suicide\". What if people intentionally injured their eyes with the scanners and then sued IBM? What if supermarket staff went blind? No, no, this was a mere half-milliwatt laser beam, McEnroe tried to explain. There was 12,000 times more energy in a 60-watt lightbulb. His pleas fell flat. And so he turned to Rhesus monkeys imported from Africa, though now he can't remember how many. \"I think it was six,\" he says. \"I couldn't swear to that.\" After tests at a nearby laboratory proved that exposure to the tiny laser did not harm the animals' eyes, the lawyers relented. And that is how the scanning of barcodes   in supermarkets across the US, and ultimately the entire world. In an unexpected twist, the laboratory used by McEnroe subsequently told him it would be sending him the monkeys. They were his problem now. \"It was crazy,\" he recalls, laughing. \"I found a zoo in North Carolina.\" Alongside the monkeys, each human member of McEnroe's team at IBM also deserves credit for the Universal Product Code (UPC), as their version of the barcode became formally known. Among their number was Joe Woodland, the engineer who dreamed up the early concept behind barcodes decades earlier, after  . It was he and another engineer who made the application to patent the fundamental idea for barcodes back in October 1949. Crucially,   and other members of the IBM team then took this pre-existing proposal for barcode-style markings and developed them into a neat rectangle of black, vertical lines corresponding to a number that could uniquely identify any supermarket item imaginable. From tins of soup to boxes of cereal or packets of spaghetti. The grocery industry formally adopted the UPC in 1973 and the first product bearing one was   in 1974. From there, it conquered the planet. How to read a barcode Every time a laser beam flashes across the face of a barcode, an intricate yet complicated process occurs in a matter of milliseconds. A UPC barcode is composed of black vertical lines, which are either thick or thin, to produce a machine-readable version of a 12-digit number along the bottom – a kind of visual Morse Code. At either end are \"guide bars\" that tell the scanner which direction it should read the code, meaning it can work even upside down. Between these, the  , the following one to five are the item number and the last is a check digit formulated based on the previous 11 numbers. Once the scanner has read the number, a computer uses it to look up the product in a database that will contain further information such as, crucially, its current price. Other kinds of barcode soon followed and the UPC also laid the foundations for so-called \"2D barcodes\" such as QR codes, which can encode even more information. But the history of these little black-and-white markings is far wilder and rockier than you would ever imagine. You could even argue that it began with the Central Intelligence Agency (CIA). \"I was scanning things for the CIA,\" explains McEnroe. \"Great big maps.\" That was one of his first jobs at IBM, involving image scanners. As he explains in  , this helped to prepare him for working on completely new, but related, technology that would revolutionise the retail industry. McEnroe knew that checkout lines in stores would move much more quickly if staff could just scan products into a computer rather than having to read the prices stamped on each item and then manually process the sale. To be accepted, such a code-scanning system would have to work pretty much every time – and read the code correctly even if the product was pulled across the scanner at speeds of up to 100 inches per second (2.5m/s). The IBM team set to work, drawing on the design patented by Woodland and his colleague – however, with an important difference. The original approach relied on reading the thickness of the black lines. One of the concepts they had proposed in the patent – a round, bulls-eye style barcode formed of concentric circles – had even been developed by a competing group. But this had proven difficult to print and even harder to fit neatly onto product packaging. The IBM team worked out that it was easier to print vertical lines and base the scanning process not on measuring the thickness of those lines but rather the distance between the leading edge of one line and the leading edge of the line next to it. In other words, the space between the lines, which was more reflective and easier to pick up by the scanner. That way, it didn't matter if the label printer had too much ink and drew lines that were thicker than intended – the scan would still work, pretty much every time. While the first barcode-branded product was  , it took another five years for barcodes to reach British supermarkets. As soon as they did, the first item to be scanned there was  . McEnroe stresses that the launch of UPC barcode technology was not without controversy. \"Our first store didn't open,\" he recalls. There were people outside protesting the fact that prices would no longer be stamped on every product, merely on the shelves where products were placed in-store. Some labour unions at the time felt – ultimately, correctly – that scanning technology threatened certain supermarket jobs. There were also concerns that barcodes could be used to obfuscate prices. McEnroe himself remembers how, in the past, shoppers sometimes searched for aging items in a supermarket since those ones might still have an older, lower price stamped on them. If barcodes took over, opportunities for such bargain-hunting would disappear. These worries soon fizzled out. But barcodes have always upset some people. To a fanatical few, they are nothing short of evil. In 2023, Jordan Frith, a professor of communication at Clemson University in South Carolina, published  . During his research, he found a 1975 article in a publication called Gospel Call that suggested barcodes could be \"the Mark of the Beast\" – a reference to a biblical prophecy from the Book of Revelation about the end of the world. The New Testament passage in question refers to a beast – sometimes interpreted as the Antichrist – that forces every person to be marked on their right hand or forehead. In the prophecy, only those who accept such a mark are allowed to buy or sell. The 1975 article suggested that, eventually, barcodes would be \"laser tattooed\" onto everybody's forehead or the back of their hand, ready for presentation at supermarket checkouts.  Although bizarre, the idea has proved surprisingly sticky. A 1982 book called The New Money System by evangelical writer Mary Stewart Relfe further popularised the supposed connection between UPC barcodes and the Mark of the Beast after she claimed the number 666 was \"hidden\" within the lines at either end and the middle of each barcode. In fact, these \"guard lines\", as they are known, serve as a reference point to help the laser scanner pick out the start and end of each UPC sequence. Laurer in the IBM team, considered co-inventor of the UPC, later insisted   and the resemblance to the pattern used to encode the number six was a coincidence. But the bizarre theory can still be found in certain corners of the Internet. And some even take extreme steps to avoid barcodes, including members of an orthodox Russian Christian group known as Old Believers. One such Old Believer, Agafia Lykov, who lives in an especially remote part of Siberia,   that barcodes were \"the stamp of the Antichrist\". She added that if anyone gives her something, such as a packet of seeds, with a barcode on it, she takes the contents out and burns the packet. Plus, in 2014, a Russian dairy company posted a statement on its website explaining why there was   on its cartons of milk. Because, as is \"well known\", the statement read, barcodes are the Mark of the Beast. The statement has since been removed from the company's website. McEnroe says he is aware of some of these strange beliefs around barcodes. \"It's not something I would be prone to think,\" he says, rather diplomatically. Frith makes another point: \"It's kind of strange to imagine a bunch of grocery executives leading the way for the apocalypse.\" And yet there is, arguably, something strangely dystopian about barcodes. For some, they have become symbols of capitalism in its coldest form. They also often turn up in chilling sequences in movies. In The Terminator, we learn that prisoners of killer robots in an apocalyptic future receive barcode markings on their arms for identification. \"This is burned in by laser scan,\" time-travelling protagonist Kyle Reese explains to a terrified Sarah Connor. \"Some of us were kept alive to work – loading bodies.\" The barcode marking, in this context, has echoes of the numbers   during the Second World War. Sometimes people do use barcodes malevolently. Especially when it comes to QR codes, which rather than using vertical lines consist of constellations of tiny black and white squares in a pattern that is readable by digital smartphone cameras. Because scanning a QR code with your phone can direct your device to a malicious website, for example, QR codes have occasionally been deployed by hackers. The UK's National Cyber Security Centre has  . Drivers in several   have also been warned about a scam where   in  . One code used in car parks in Leicester was even  . And, in September, Lebanon-based armed group Hezbollah   containing a dangerous barcode, referred to in some reports as a QR code, that could \"withdraw all information\" from any device used to scan it. The BBC has not been able to verify these claims. Despite some nefarious uses of barcodes, and outlandish claims that they represent the Mark of the Beast, these markings now underpin thousands of industrial and commercial processes all over the world. An  , according to GS1, the organisation that oversees UPC and QR code standards. You might have noticed the barcodes and QR codes on the packaging of items you receive in the post, for example. A single packet can be scanned many times on its journey from warehouse to you, says Frith. And because barcodes allow retailers to keep track of huge product inventories, that means these businesses can operate giant stores with relatively few staff. \"You wouldn't have these superstores or anything like that without barcodes,\" says Frith. \"It's changed the physical shape of retail.\" Erin Temmen, an account manager at labelling firm Electronic Imaging Materials, agrees with this assessment. Her company, like some others in the industry, produce barcode labels that will work in practically any environment. This includes cold-resistant labels that won't fall off equipment filled with liquid nitrogen, for example. And chemical-resistant labels that will retain their barcode even if they get splashed with nasty substances in a laboratory. The firm also produces extra reflective barcode labels. \"That increases the scan distance,\" says Temmen. It makes it easier for hurried workers to scan the code at a distance of up to 45ft (14m), making it detectable even if the barcode is on an item placed high on a shelf, for example. Such versatility hints at the wide variety of contexts in which barcodes are actually used. They have helped to track the   and  , tagged   to avoid mix-ups, and been placed   to direct visitors to online memorials for the deceased. The US military also uses barcodes to help it  . One University in Saudi Arabia also piloted using barcodes to   at lectures. Barcodes have even made it into space. Astronauts on the International Space Station use barcode scanners to  , although they have largely been replaced with radio frequency (RFID) tags now. Barcodes are also employed to log   by astronauts, as well as to identify their  . Back on Earth, it's possible that barcodes have saved lives. Hospitals use barcoding systems to track blood samples, drugs and medical devices such as hip replacements. The UK's National Health Service (NHS) has a  , to promote the use of barcodes for tracking such things. Machine-assisted identification can help staff ensure clinicians administer the correct drug to the correct patient, for example. , the introduction of this technology has freed up 140,000 hours of staff time for patient care that would otherwise have been spent performing administrative tasks and inventory checks. It claims barcode scanning has also saved the health service millions of pounds. \"I speak with clinicians and members of staff in hospitals responsible for managing inventory – they all report benefits,\" says Valentina Lichtner, a senior lecturer of digital health and decision making at Leeds University Business School. She is currently researching the impact of barcode tracking systems in healthcare settings.  And in a world where barcodes are pretty much everywhere, it's possible to design interesting games and experiences around them. One of the most inventive examples was   that had an integrated a barcode scanner into the device. Players were required to scan random barcodes on groceries, for example, until they found a code that happened to trigger the \"capture\" of an alien monster in the game – something that has strong echoes of the Pokemon games. Other games – including Japan's   – have also relied on getting players to scan barcodes as part of the \"fun\". None of this would have been possible without Woodland's lines in the sand and the work of McEnroe and his team at IBM. Currently, there is a push –   – to get retailers to adopt QR-style codes, over the older, vertical line-based designs. This would allow them to encode more information – such as use-by-dates on food packaging or instructions for how to use a certain cleaning product. But Frith says he thinks the traditional barcode will likely stick around for a long time to come. It is a deceptively simple technology that has, he says, impacted countless industries. And yet, despite being everywhere, most people wouldn't give barcodes a second thought. \"The biggest testament to their success,\" says Frith, \"is that we never think about them.\" -- ,  The US Presidential elections did not always depend on just these seven states. The underwater robot can operate in rough waters and conduct mapping in poor visibility. We find out how AI blurs the line between creation and automation, raising questions about the essence of art. The space agency hopes its X-59 with a new design will overcome the national ban on supersonic flights over land. BBC reporter Marc Cieslak explores a high-security hub monitoring digital threats ahead of the US election.  Formula Student is a world series of events featuring electric cars built by teams of students. Two voice-over artists were listening to a podcast when they heard their own stolen AI-generated voices. In 1890 an estimated cargo of 180,000 ancient felines, weighing 19.5 tonnes, were auctioned off in Liverpool. The Thracian Tomb of Kazanlak was accidentally discovered by Bulgarian soldiers digging up shelters in 1944. The Varna treasure is considered the world's oldest human processed gold, dating back 6,500 years. The iconic team has developed technology which spread to concerts, nightclubs, and other sports teams. Hiding in a London cathedral is an intricate wooden mock-up of Sir Christopher Wren's masterpiece. Bettany Hughes goes underwater in search of ancient archaeological finds in historic Sozopol, Bulgaria. The grain left from beer production is being used to make alternative leather. So, how does the technology work? Spencer Kelly checks out the latest robots being designed to help on space missions. AI v The Mind: We explore the world of food and ask if human expertise is the only way to deliver great flavour. In 1911, a fence was constructed on the US-Mexico border. But its purpose was not to stop humans. A new generation of smart goggles provide real time visual feedback to enhance athletic performance. A new app uses indoor mapping and audio cues to deliver step-by-step directions to Paralympians. A look through footage from the Paris 1924 Olympics gives viewers a chance to reflect on how much has changed. They offer a glimpse into Morocco's Indigenous heritage amidst some of the country's most ruggedly beautiful, untamed and lesser-explored landscapes. Artificial intelligence is being used to generate paintings, images and even sculptures, with some selling for thousands of dollars. Do we need to reframe our definition of art? A new exhibition charts how Claude Monet's revolutionary, fog-shrouded visions of the Thames would \"irreversibly alter how London saw itself\". The story of Flip Fraser, the first editor of black newspaper The Voice, is told in a show. The US Presidential elections did not always depend on just these seven states. Copyright 2024 BBC. All rights reserved.  The is    ", "category": ["hacker"]},
{"title": null, "link": "https://www.darkreading.com/cyber-risk/swift-to-launch-ai-powered-fraud-defence-to-enhance-cross-border-payments", "date": null, "content": "October 17, 2024 You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cyber-risk/illinois-joins-cosn-s-trusted-learning-environment-tle-state-partnership-program-for-student-data-privacy", "date": null, "content": "October 17, 2024 You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": "Technology", "link": "https://www.bbc.com/innovation/technology", "date": null, "content": "The broadcaster has posted a job ad for someone to use AI to \"shape the future of content creation\". Being one of the hottest artists around can be demanding and draining. But Raye says gaming helps her. Artificial intelligence is being used to generate paintings, images and even sculptures, with some selling for thousands of dollars. Do we need to reframe our definition of art? Alex Spencer says having a song on the video game's soundtrack has left him \"buzzing\". Ashley Gordon, aka DJ AG Online, says he wants to bring people together through music. Chinese technology giant ByteDance denied reports that the incident caused more than $10m of damage. Nuclear waste remains toxic for thousands of years. How do you build a storage facility that will keep it safely buried for millennia? Playing low-stakes computer games in relaxing settings helps people deal with their mental health. In Iceland, scientists are seeking to understand magma and push geothermal energy to new frontiers. We find out how AI blurs the line between creation and automation, raising questions about the essence of art. BBC Tech Correspondent Lily Jamali analyses the 'robocabs' and if their technology is up to par. BBC reporter Marc Cieslak explores a high-security hub monitoring digital threats ahead of the US election.  Cyber Correspondent Joe Tidy has an AI clone of himself built to see how sophisticated they can be. Two voice-over artists were listening to a podcast when they heard their own stolen AI-generated voices. The iconic team has developed technology which spread to concerts, nightclubs, and other sports teams. A new generation of smart goggles provide real time visual feedback to enhance athletic performance. The robotaxis were stationed in a San Francisco parking lot when a feature to avoid crashes set off the noise. Joe Tidy played along for over two months to learn more about how the scams work. The BBC's Samira Hussain is in Delhi, trying to catch a flight to go on holiday with her family. A new network along the Seine in Paris will broadcast Olympic festivities from the river. A peak inside both the real and virtual new Aquatic Centre built for the Paris Games. Ten teenagers swap their smartphones for brick phones as part of a week-long digital detox. Could the United States' largest saltwater lake hold the key to its energy future? BBC Analysis editor Ros Atkins looks at what what is being done to prevent minors seeing harmful content. Space agencies around the world need lunar soil – and lots of it.  Dandora sits on the outskirts of Nairobi, Kenya, and 800 tonnes of garbage is dumped on the site every day. In a livestream on X, the patient explained that he was using a device in his brain to move the cursor. We spoke to two influencers who use the short form video platform to raise awareness and inform. Piers Morgan and Oprah have criticised the use of AI deepfake ads used to promote a \"manifestation\" guide. BBC Click reporter Paul Carter tries out the Atom Limbs prosthetic with 'full range of human motion'. Law enforcement have reported a rise in sextortion scams targeting teens across online platforms. A man from Georgia is alleged to be part of a group which hacked the US regulator's X account. James Cameron's 1984 blockbuster The Terminator starring Arnold Schwarzenegger has become synonymous with the dangers of superintelligent machines - but why? Ofcom warns social media companies could face fines if they don’t comply with the new Online Safety Bill The hacker downloaded sensitive data from the company and used it to send a ransom demand. The streamer, real name Zach Hoyt, later apologised online for his comments. The EU previously introduced a law requiring new electronic devices to use the same type of cable in 2022. Alex Proyas, who directed the 2004 Will Smith film, compared his film to Tesla's new vehicles. As Wimbledon scraps human line judges, sport insiders suggest how we can make games more exciting. Copyright 2024 BBC. All rights reserved.  The is    ", "category": ["hacker"]},
{"title": null, "link": "https://www.darkreading.com/cybersecurity-operations/ex-oracle-google-engineers-raise-7m-from-accel-for-public-launch-of-simplismart-to-empower-ai-adoption", "date": null, "content": "October 17, 2024 You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": "Press Release", "link": "https://www.darkreading.com/latest-press-release", "date": null, "content": "Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/cyberattacks-data-breaches/iran-apt34-ms-exchange-spy-gulf-govts", "date": null, "content": "Breaking cybersecurity news, news analysis, commentary, and other content from around the world, with an initial focus on the Middle East & Africa and the Asia Pacific A MOIS-aligned threat group has been using Microsoft Exchange servers to exfiltrate sensitive data from Gulf-state government agencies. October 17, 2024 Read more about: Nate Nelson, Contributing Writer You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cloud-security/fighting-crime-with-technology-safety-first", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. By combining human and nonhuman identity management in one solution, Flock Safety is helping law enforcement solve an impressive number of criminal cases every day. October 14, 2024 Karen D. Schwartz, Contributing Writer Contributing Writer, Dark Reading You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/data-privacy/fhe-consortium-quantum-resilient-cryptography-standards", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. The FHE Technical Consortium for Hardware (FHETCH) brings together developers, hardware manufacturers, and cloud providers to collaborate on technical standards necessary to develop commercial fully homomorphic encryption solutions and lower adoption barriers. October 15, 2024 Jennifer Lawinski, Contributing Writer You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "encryption", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cybersecurity-operations/time-get-strict-dmarc", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. Adoption of the email authentication and policy specification remains low, and only about a tenth of DMARC-enabled domains enforce policies. Everyone is waiting for major email providers to get strict. October 18, 2024 Source: Author, with data from Valimail Robert Lemos, Contributing Writer You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cybersecurity-operations/cisos-privacy-responsibilities-keep-growing", "date": null, "content": "Cybersecurity In-Depth: Feature articles on security strategy, latest trends, and people to know. A heated regulatory landscape, uncertainty over AI use, and how it all ties back to cybersecurity means CISOs have to add privacy to their portfolios. October 15, 2024 Joan Goodchild Contributing Writer, Dark Reading You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More EU Adopts Cyber Resilience Act to Regulate Internet of Things Cyber Gangs Aren't Afraid of Prosecution CISOs' Privacy Responsibilities Keep Growing Even Orgs With SSO Are Vulnerable to Identity-Based Attacks Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "cyber resilience", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/identity-access-management-security/even-orgs-with-sso-are-vulnerable-to-identity-based-attacks", "date": null, "content": "Cybersecurity In-Depth: Digging into data about the latest attacks, threats, and trends using charts and tables. Use SSO, don't use SSO. Have MFA, don't have MFA. An analysis of a snapshot of organizations using Push Security's platform finds that 99% of accounts are susceptible to phishing attacks. October 15, 2024 Edge Editors Dark Reading You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More EU Adopts Cyber Resilience Act to Regulate Internet of Things Cyber Gangs Aren't Afraid of Prosecution CISOs' Privacy Responsibilities Keep Growing Even Orgs With SSO Are Vulnerable to Identity-Based Attacks Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["phishing", "social engineering", "cyber resilience", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cyberattacks-data-breaches/cyber-gangs-aren-t-afraid-of-prosecution", "date": null, "content": "Cybersecurity In-Depth: Feature articles on security strategy, latest trends, and people to know. Challenges with cybercrime prosecution are making it easier for attackers to act with impunity. Law enforcement needs to catch up. October 16, 2024 Ilia Kolochenko Partner, Platt Law You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More EU Adopts Cyber Resilience Act to Regulate Internet of Things Cyber Gangs Aren't Afraid of Prosecution CISOs' Privacy Responsibilities Keep Growing Even Orgs With SSO Are Vulnerable to Identity-Based Attacks Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "cybercrime", "cyber resilience", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cloud-security/startup-spotlight-rad-security-cloud-behavioral-profiling", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. Cybersecurity startup RAD Security, a finalist in this year's Black Hat USA Startup Spotlight competition, looks for \"drift events,\" or events that vary from the baseline. August 6, 2024 Read more about: Dark Reading Staff Dark Reading You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/identity-access-management-security/startup-finds-hydden-identities-it-environment", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. Hydden's platform detects and classifies an organization's identities, accounts, and privileges, regardless of where they reside in the IT environment. September 17, 2024 Fahmida Y. Rashid, Managing Editor, Features, Dark Reading You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cloud-security/apono-raises-15-5m-series-a-funding-for-ai-driven-least-privilege-solution-set", "date": null, "content": "News, news analysis, and commentary on the latest trends in cybersecurity technology. October 1, 2024 You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Time to Get Strict With DMARC FHE Consortium Pushes for Quantum-Resilient Cryptography Standards Fighting Crime With Technology: Safety First AI Hype Drives Demand For ML SecOps Skills Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["social engineering", "zero trust"]},
{"title": "Commentary", "link": "https://www.darkreading.com/latest-commentary", "date": null, "content": "The future of application security is no longer about reacting to the inevitable — it's about anticipating and preventing attacks before they can cause damage. Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/vulnerabilities-threats/llms-are-new-type-insider-adversary", "date": null, "content": "The inherent intelligence of large language models gives them unprecedented capabilities like no other enterprise tool before. October 15, 2024 Shaked Reiner Principal Security Researcher, CyberArk Labs You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/author/shaked-reiner", "date": null, "content": "Shaked Reiner Principal Security Researcher, CyberArk Labs Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/vulnerabilities-threats/what-cybersecurity-leaders-learn-golf", "date": null, "content": "As in golf, security requires collaboration across the entire organization, from individual contributors in each department to the executive level and the board. October 16, 2024 Jeff Shiner CEO, 1Password You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/author/jeff-shiner", "date": null, "content": "Jeff Shiner CEO, 1Password Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/cyber-risk/cpo-still-cpo-evolving-role-privacy-leadership", "date": null, "content": "Has the role of chief privacy officer become something more than it was? And is it still a role that just one person can handle? October 17, 2024 Arlo Gilbert Founder & CEO, Osano You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/author/arlo-gilbert", "date": null, "content": "Arlo Gilbert Founder & CEO, Osano Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/vulnerabilities-threats/4-ways-address-zero-days-ai-ml-security", "date": null, "content": "As the unique challenges of AI zero-days emerge, the approach to managing the accompanying risks needs to follow traditional security best practices but be adapted for AI. October 17, 2024 Dan McInerney Lead AI Threat Researcher, Protect AI You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/author/dan-mcinerney", "date": null, "content": "Dan McInerney Lead AI Threat Researcher, Protect AI Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/cyber-risk/supply-chain-cybersecurity-traditional-vendor-risk-management", "date": null, "content": "Traditional practices are no longer sufficient in today's threat landscape. It's time for cybersecurity professionals to rethink their approach. October 18, 2024 Malleswar Reddy Yerabolu Senior Security Engineer, North Carolina Department of Health and Human Services You May Also Like Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": null, "link": "https://www.darkreading.com/author/malleswar-reddy-yerabolu", "date": null, "content": "Malleswar Reddy Yerabolu Senior Security Engineer, North Carolina Department of Health and Human Services Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/author/bradley-schaufenbuel", "date": null, "content": "Bradley Schaufenbuel Vice President & CISO, Paychex Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust 2024 Cloud Security Report The Anatomy of a Ransomware Attack Evolve Your Ransomware Defense SANS Security Awareness Maturity Model How to Use Threat Intelligence to Mitigate Third-Party Risk State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust", "cloud security", "threat intelligence"]},
{"title": "News", "link": "https://www.darkreading.com/latest-news", "date": null, "content": "These types of \"long-lived\" credentials pose a risk for users across all major cloud service providers, and must meet their very timely ends, researchers say. Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
{"title": null, "link": "https://www.darkreading.com/author/kristinabeek", "date": null, "content": "Kristina Beek, Associate Editor, Dark Reading Managing Third-Party Risk Through Situational Awareness 2024 InformationWeek US IT Salary Report Social Engineering: New Tricks, New Threats, New Defenses 10 Emerging Vulnerabilities Every Enterprise Should Know Simplify Data Security with Automation Unleashing AI to Assess Cyber Security Risk Securing Tomorrow, Today: How to Navigate Zero Trust IDC White Paper: The Peril and Promise of Generative AI in Application Security Gartner Magic Quadrant for Application Security Testing Evolve Your Ransomware Defense RevealX Catches Ransomware Within Days of Deployment at WCH Purple AI Datasheet State of AI in Cybersecurity: Beyond the Hype [Virtual Event] The Essential Guide to Cloud Management Black Hat Europe - December 9-12 - Learn More SecTor - Canada's IT Security Conference Oct 22-24 - Learn More Copyright © 2024 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG.", "category": ["ransomware", "social engineering", "zero trust"]},
