[
{"title": "Category Archives: ", "link": "https://krebsonsecurity.com/category/web-fraud-2-0/", "date": null, "content": "The U.S. government on Wednesday announced the arrest and charging of two Sudanese brothers accused of running Anonymous Sudan (a.k.a. AnonSudan), a cybercrime business known for launching powerful distributed denial-of-service (DDoS) attacks against a range of targets, including dozens of hospitals, news websites and cloud providers. One of the brothers is facing life in prison for allegedly seeking to kill people with his attacks. The parents of a 19-year-old Connecticut honors student accused of taking part in a $243 million cryptocurrency heist in August were carjacked a week later, while out house-hunting in a brand new Lamborghini. Prosecutors say the couple was beaten and briefly kidnapped by six young men who traveled from Florida as part of a botched plan to hold the parents for ransom. Organizations that get relieved of credentials to their cloud environments can quickly find themselves part of a disturbing new trend: Cybercriminals using stolen cloud credentials to operate and resell sexualized AI-powered chat services. Researchers say these illicit chat bots, which use custom jailbreaks to bypass content filtering, often veer into darker role-playing scenarios, including child sexual exploitation and rape. A California man accused of failing to pay taxes on tens of millions of dollars allegedly earned from cybercrime also paid local police officers hundreds of thousands of dollars to help him extort, intimidate and silence rivals and former business partners, a new indictment charges. KrebsOnSecurity has learned that many of the man’s alleged targets were members of UGNazi, a hacker group behind multiple high-profile breaches and cyberattacks back in 2012. The United States today unveiled sanctions and indictments against the alleged proprietor of Joker’s Stash, a now-defunct cybercrime store that peddled tens of millions of payment cards stolen in some of the largest data breaches of the past decade. The government also indicted a top Russian cybercriminal known as Taleon, whose cryptocurrency exchange Cryptex has evolved into one of Russia’s most active money laundering networks. Many GitHub users this week received a novel phishing email warning of critical security holes in their code. Those who clicked the link for details were asked to distinguish themselves from bots by pressing a combination of keyboard keys that causes Microsoft Windows to download password-stealing malware. While it’s unlikely that many programmers fell for this scam, it’s notable because less targeted versions of it are likely to be far more successful against the average Windows user. Scammers are flooding Facebook with groups that purport to offer video streaming of funeral services for the recently deceased. Friends and family who follow the links for the streaming services are then asked to cough up their credit card information. Recently, these scammers have branched out into offering fake streaming services for nearly any kind of event advertised on Facebook. Here’s a closer look at the size of this scheme, and some findings about who may be responsible. A cyberattack that shut down some of the top casinos in Las Vegas last year quickly became one of the most riveting security stories of 2023: It was the first known case of native English-speaking hackers in the United States and Britain teaming up with ransomware gangs based in Russia. But that made-for-Hollywood narrative has eclipsed a far more hideous trend: Many of these young, Western cybercriminals are also members of fast-growing online groups that exist solely to bully, stalk, harass and extort vulnerable teens into physically harming themselves and others. An old but persistent email scam known as “sextortion” has a new personalized touch: The missives, which claim that malware has captured webcam footage of recipients pleasuring themselves, now include a photo of the target’s home in a bid to make threats about publishing the videos more frightening and convincing. Three men in the United Kingdom have pleaded guilty to operating otp[.]agency, a once popular online service that helped attackers intercept the one-time passcodes (OTPs) that many websites require as a second authentication factor in addition to passwords. Launched in November 2019, OTP Agency was a service for intercepting one-time passwords needed to log in to various websites. Scammers would enter the target’s phone number and name, and the service would initiate an automated phone call to the target that alerts them about unauthorized activity on their account. Mailing List Search KrebsOnSecurity Recent Posts Story Categories Why So Many Top Hackers Hail from Russia", "summary": "The U.S. government announced the arrest and charging of two Sudanese brothers accused of running Anonymous Sudan. A California man accused of failing to pay taxes on tens of millions of dollars allegedly earned from cybercrime also paid local police officers hundreds of thousands of dollars to help him extort, intimidate and silence rivals.", "category": ["data breach", "ransomware", "phishing", "malware", "hacker", "cybercrime"]},
{"title": "Category Archives: ", "link": "https://krebsonsecurity.com/category/patches/", "date": null, "content": "Short posts on the latest security updates for widely-used software. Microsoft today released security updates to fix at least 117 security holes in Windows computers and other software, including two vulnerabilities that are already seeing active attacks. Also, Adobe plugged 52 security holes across a range of products, and Apple has addressed a bug in its new macOS 15 “Sequoia” update that broke many cybersecurity tools. Microsoft Corp. today released updates to fix at least 79 security vulnerabilities in its Windows operating systems and related software, including multiple flaws that are already showing up in active attacks. Microsoft also corrected a critical bug that has caused some Windows 10 PCs to remain dangerously unpatched against actively exploited vulnerabilities for several months this year. Microsoft today released updates to fix at least 90 security vulnerabilities in Windows and related software, including a whopping six zero-day flaws that are already being actively exploited by attackers. More than a million domain names — including many registered by Fortune 100 firms and brand protection companies — are vulnerable to takeover by cybercriminals thanks to authentication weaknesses at a number of large web hosting providers and domain registrars, new research finds. A faulty software update from cybersecurity vendor Crowdstrike crippled countless Microsoft Windows computers across the globe today, disrupting everything from airline travel and financial institutions to hospitals and businesses online. Crowdstrike said a fix has been deployed, but experts say the recovery from this outage could take some time, as Crowdstrike’s solution needs to be applied manually on a per-machine basis. Microsoft Corp. today issued software updates to plug 139 security holes in various flavors of Windows and other Microsoft products. Redmond says attackers are already exploiting at least two of the vulnerabilities in active attacks against Windows users. Microsoft today released updates to fix more than 50 security vulnerabilities in Windows and related software, a relatively light Patch Tuesday this month for Windows administrators. The software giant also responded to a torrent of negative feedback on a new feature of Redmond’s flagship operating system that constantly takes screenshots of whatever users are doing on their computers, saying the feature would no longer be enabled by default. Microsoft today released updates to fix more than 60 security holes in Windows computers and supported software, including two “zero-day” vulnerabilities in Windows that are already being exploited in active attacks. There are also important security patches available for macOS and Adobe users, and for the Chrome Web browser, which just patched its own zero-day flaw. If only Patch Tuesdays came around infrequently — like total solar eclipse rare — instead of just creeping up on us each month like The Man in the Moon. Although to be fair, it would be tough for Microsoft to eclipse the number of vulnerabilities fixed in this month’s patch batch — a record 147 flaws in Windows and related software. Apple and Microsoft recently released software updates to fix dozens of security holes in their operating systems. Microsoft today patched at least 60 vulnerabilities in its Windows OS. Meanwhile, Apple’s new macOS Sonoma addresses at least 68 security weaknesses, and its latest updates for iOS fixes two zero-day flaws. Mailing List Search KrebsOnSecurity Recent Posts Story Categories Why So Many Top Hackers Hail from Russia", "summary": "Microsoft Corp. today issued software updates to plug 139 security holes in various flavors of Windows and other Microsoft products. Redmond says attackers are already exploiting at least two of the vulnerabilities in active attacks against Windows users. Apple’s new macOS Sonoma addresses at least 68 security weaknesses, and its latest updates for iOS fixes two zero-day flaws.", "category": ["security updates", "hacker"]},
{"title": "Category Archives: ", "link": "https://krebsonsecurity.com/category/comingstorm/", "date": null, "content": "This category includes blog posts about computer and Internet security threats now and on the horizon. The United States today unveiled sanctions and indictments against the alleged proprietor of Joker’s Stash, a now-defunct cybercrime store that peddled tens of millions of payment cards stolen in some of the largest data breaches of the past decade. The government also indicted a top Russian cybercriminal known as Taleon, whose cryptocurrency exchange Cryptex has evolved into one of Russia’s most active money laundering networks. Malicious hackers are exploiting a zero-day vulnerability in Versa Director, a software product used by many Internet and IT service providers. Researchers believe the activity is linked to Volt Typhoon, a Chinese cyber espionage group focused on infiltrating critical U.S. networks and laying the groundwork for the ability to disrupt communications between the United States and Asia during any future armed conflict with China. The proliferation of new top-level domains (TLDs) has exacerbated a well-known security weakness: Many organizations set up their internal Microsoft authentication systems years ago using domain names in TLDs that didn’t exist at the time. Meaning, they are continuously sending their Windows usernames and passwords to domain names they do not control and which are freely available for anyone to register. Here’s a look at one security researcher’s efforts to map and shrink the size of this insidious problem. New details are emerging about a breach at National Public Data (NPD), a consumer data broker that recently spilled hundreds of millions of Americans’ Social Security Numbers, addresses, and phone numbers online. KrebsOnSecurity has learned that another NPD data broker which shares access to the same consumer records inadvertently published the passwords to its back-end database in a file that was freely available for download from its homepage until today. A great many readers this month reported receiving alerts that their Social Security Number, name, address and other personal information were exposed in a breach at a little-known but aptly-named consumer data broker called NationalPublicData.com. This post examines what we know about a breach that has exposed hundreds of millions of consumer records. We’ll also take a closer look at the data broker that got hacked — a background check company founded by an actor and retired sheriff’s deputy from Florida. The Chinese company in charge of handing out domain names ending in “.top” has been given until mid-August 2024 to show that it has put in place systems for managing phishing reports and suspending abusive domains, or else forfeit its license to sell domains. The warning comes amid the release of new findings that .top was the most common suffix in phishing websites over the past year, second only to domains ending in “.com.” Law enforcement agencies in the United States and Europe today announced Operation Endgame, a coordinated action against some of the most popular cybercrime platforms for delivering ransomware and data-stealing malware. Dubbed “the largest ever operation against botnets,” the international effort is being billed as the opening salvo in an ongoing campaign targeting advanced malware “droppers” or “loaders” like IcedID, Smokeloader and Trickbot. Apple and the satellite-based broadband service Starlink each recently took steps to address new research into the potential security and privacy implications of how their services geo-locate devices. Researchers from the University of Maryland say they relied on publicly available data from Apple to track the location of billions of devices globally — including non-Apple devices like Starlink systems — and found they could use this data to monitor the destruction of Gaza, as well as the movements and in many cases identities of Russian and Ukrainian troops. Virtual private networking (VPN) companies market their services as a way to prevent anyone from snooping on your Internet usage. But new research suggests this is a dangerous assumption when connecting to a VPN via an untrusted network, because attackers on the same network could force a target’s traffic off of the protection provided by their VPN without triggering any alerts to the user. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) said today it is investigating a breach at business intelligence company Sisense, whose products are designed to allow companies to view the status of multiple third-party online services in a single dashboard. CISA urged all Sisense customers to reset any credentials and secrets that may have been shared with the company, which is the same advice Sisense gave to its customers Wednesday evening. Mailing List Search KrebsOnSecurity Recent Posts Story Categories Why So Many Top Hackers Hail from Russia", "summary": "U.S. unveils sanctions and indictments against alleged proprietor of Joker’s Stash, a now-defunct cybercrime store. Malicious hackers are exploiting a zero-day vulnerability in Versa Director, a software product used by many Internet and IT service providers. New details are emerging about a breach at National Public Data that spilled hundreds of millions of Americans’ Social Security Numbers, addresses, and phone numbers online.", "category": ["data breach", "ransomware", "phishing", "malware", "zero-day vulnerability", "hacker", "botnet", "vulnerability", "cybercrime", "cyber espionage"]},
{"title": "The Hidden Gem of Pentest Certifications in 2024", "link": "https://infosecwriteups.com/the-hidden-gem-of-pentest-certifications-in-2024-67fa7a5b57cc?source=collection_home---4------19-----------------------", "date": null, "content": "Member-only story InfoSec Write-ups Share Non-members can  . Do you need to tick off a box on your CV, or do you actually want to learn penetration testing? Are you thinking of getting into bug bounty programs? Do you want to start off strong in the most sought-after specialization within pentesting, Web Pentesting? Whatever your goal is, this is probably the best certification you can start on, and I’ll tell you why: Burp Suite Certified Practitioner ( The article can be found in video format here: I recently wrote a  , where I was rather skeptical about most popular pentesting certifications. This is due to them teaching you what many other pentesters already know (AD, Network Pentesting), and usually being expensive. InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "summary": "Web Pentesting is the most sought-after specialization within pentesting. Burp Suite Certified Practitioner is probably the best certification you can start on.", "category": ["penetration testing", "bug bounty"]},
{"title": "The Firefox Privacy Paradox: How to Balance Convenience and Security", "link": "https://infosecwriteups.com/the-firefox-privacy-paradox-how-to-balance-convenience-and-security-98557f5c8e19?source=collection_home---4------18-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share These days, keeping your personal information safe online is more important than ever. Your browser is one of your main tools for staying secure, but many of the best privacy features are hidden in the settings. In this article, we’ll show you easy changes you can make to protect yourself from tracking, data leaks, and other online risks. Whether you’re worried about being followed online or just want to boost your security, these simple tweaks will help you turn your browser into a strong shield. ✅ Security-focused, reduces unintentional access. : ✅ Enhances protection against tracking by preventing fingerprinting techniques. ✅ Enables you to make informed decisions about certificate errors. ✅ Prevents malicious autoplay, enhances privacy. : ✅ Blocks cross-site tracking by isolating cookies, which reduces the ability of third parties to track your online activity. ✅ Great for preventing phishing attacks. ⚠️  . Disabling the built-in PDF viewer forces external apps to open PDFs. While this reduces potential exposure to vulnerabilities in the built-in viewer, external PDF readers could introduce other vulnerabilities. If you’re using a secure PDF viewer, this is fine. ✅ Great for preventing fingerprinting. ✅ Prevents WebGL-based tracking and some security exploits. : ✅ Helps block known trackers and improves privacy while browsing. : ✅ Ensures that only secure SSL/TLS connections are accepted, protecting against certain attacks. : ✅ Validates SSL certificates, reducing the risk of connecting to fraudulent sites. : ✅ Restricts cookie access to enhance privacy, especially from third-party trackers. ✅ Disabling remote experimentation. : ✅ Prevents tracking of clipboard events, enhancing privacy. ⚠️  . Disabling memory caching may reduce performance slightly. If performance is a concern, this can be left enabled. ✅ Prevents icon-based tracking. ✅ Prevents favicon tracking in desktop shortcuts. : ✅ Disabling DRM can reduce potential vulnerabilities, although it may limit access to some content. ✅ Good for disabling persistent storage tracking, but may break some site functionality. ⚠️  . Disabling JavaScript will break most websites. If security is your utmost concern, this is fine, but it will result in a non-functional experience on many websites. Consider using tools like  or  to selectively enable JavaScript on trusted sites instead. ✅ Reduces media-based tracking. : ✅ Stops background data sending, which protects your information. ✅ Disables prefetching, preventing unnecessary connections. ✅ Limits WebSocket reconnection attempts, reducing the chance of exploitation. ✅ Prevents PDF caching, reducing potential data leaks. : ✅ Reduces the risk of fingerprinting through GPU information. ✅ Keeps cookie behavior settings device-specific. ✅ Prevents cookie lifetime policies from being synced across devices. ✅ Disabling disk caching prevents sensitive data from being stored on disk. ⚠️  . Disabling this can reduce security against malicious downloads, as Safe Browsing protects users from known threats. ✅ Prevents click tracking. : ✅ Prevents websites from accessing sensitive sensor data, enhancing privacy. ✅ Disables Pocket integration, reducing tracking. ✅ Disables geolocation to enhance privacy. ✅ Disables WebRTC to prevent IP leakage during peer-to-peer connections. : ✅ Stops automatic filling of forms, reducing the chance of storing sensitive information. : ✅ Blocks tracking through battery status, which can be used for fingerprinting. : ✅ Reduces unnecessary DNS requests, enhancing privacy. : ⚠️   While they enhance security, disabling them can reduce protection against malware and phishing. Use an alternative security solution if you choose to disable these. ✅ Prevents fingerprinting via fonts. ✅ Disables referrer headers, enhancing privacy by not leaking browsing history. ✅ Disabling bidirectional text support reduces the attack surface, although this might affect certain internationalized websites. ✅ Setting this to   allows only first-party cookies, which greatly improves privacy by blocking third-party trackers. : ✅ Forces the use of secure TLS versions, ensuring encrypted connections. These additional settings, when combined with your current setup, provide even greater security and privacy while browsing. However, like the previous settings, some of these can impact website functionality. Test them to find the right balance between privacy and usability that suits your needs! InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "summary": "Your browser is one of your main tools for staying secure. Many of the best privacy features are hidden in the settings. These simple tweaks will help you turn your browser into a strong shield.", "category": ["phishing", "malware"]},
{"title": "HTB | Resolute — DnsAdmins Abuse", "link": "https://infosecwriteups.com/htb-resolute-dnsadmins-abuse-24e2aa93c8f2?source=collection_home---4------9-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share This is the Box on  . Find the box  . Watch my video writeup of Resolute on YouTube:  IP:  Without credentials, I was not able to enum any shares I was able to null connect via   and able to enumerate I can get information about the users one by one with  : I can also get less information about all users with  : We found the password for  I’ll use crackmapexec as an easy way to check credentials against SMB. First I try as marko, but it doesn’t work: I tried connecting with EvilWinRM as well, but no luck. Password spraying is similar to password brute force, except you only try one (or a few common passwords) across a lot of users. The benefit to the attacker is that you don’t risk locking out any single account, and in a case where you only need a foothold, it’s very common in a large organization to find at least one user using a really bad guessable password. I grabbed the list of users from rpcclient, and dropped them into a file. Then I ran crackmapexec using that list as the user input. It found a user still using  : we found a valid login I don’t know if Malanie is an administrator or in the Remote Management Users group, but it’s worth a shot to see if I can EvilWinRM to get a shell as Melanie. It works: and now we have  In PowerShell,   is an alias for   or  . On Windows, it’s often a good idea to run that with  , kind of like running  . PSTranscripts looks interesting On looking at the text file inside PSTranscripts we found Ryan’s password On looking at user Ryan we can see that Ryan actually isn’t in Remote Management Users. But he is in  , and Contractors is: From my Kali box, I can also check the creds with crackmapexec: we can use evilWinRm and we are in as Ryan We saw note.txt On looking at   and  Members of the DNSAdmins group have access to network DNS information. The default permissions are as follows: Allow: Read, Write, Create All Child objects, Delete Child objects, Special Permissions. By default, the DNSAdmins don’t have the ability to start or stop the DNS service, but it’s not unusual for an admin to give this group that privilege. The attack here is to tell the DNS service on Resolute to use my dll as a plugin. I’m going to use   to create a dll that will, on loading, connect back to me. When   creates this payload, it will connect back, and wait for that session to end before continuing. This will hang the DNS service on Resolute. That’s fine for a CTF, but would make for a bad day in a real pentest. To get around this, you can create a payload that starts the reverse shell in a new thread and then continues so that the DNS server can continue to start. Check  ,   and   for more information Now I’ll start with a basic msfvenom reverse shell payload as a dll. Defender is running on this host, and if I put the output file there, it might get detected, but over a UNC path to a share it might be ok. Now I will start the smb server. Now it’s time to upload and execute. I’ll need to run three commands: I’ll need to do this all within a minute (or less) because, as note.txt told me, things revert quickly. With nc listening, I execute the attack: after starting DNS I got the shell and we have the  If you enjoyed this article and want to dive deeper into cybersecurity topics, feel free to explore my detailed write-ups on GitBook. I cover a range of topics including vulnerability assessments, penetration testing techniques, and security methodologies. 👉  👉 Watch my videos on YouTube:  Stay tuned for more content, and don’t forget to follow for future updates! Stay tuned for more content, and don’t forget to follow for future updates! InfoSec Write-ups CTF | Rookie Bug Bounty Hunter… | Learning Everyday… Website -   YouTube -  Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "summary": " Password spraying is similar to password brute force, except you only try one (or a few common passwords) across a lot of users. The benefit to the attacker is that you don’t risk locking out any single account. It’s very common in a large organization to find at least one user using a really bad guessable password.", "category": ["vulnerability", "penetration testing", "bug bounty", "vulnerability assessment"]},
{"title": "Discovering an Unrestricted File Upload in AWS S3 Bucket", "link": "https://infosecwriteups.com/unrestricted-file-upload-in-aws-s3-bucket-2a764a3965f4?source=collection_home---4------7-----------------------", "date": null, "content": "InfoSec Write-ups Listen Share AWS S3 Bucket Misconfiguration I was recently exploring🔍 a web application for vulnerabilities and came across an issue that could seriously compromise the security of AWS S3 buckets 🪣. While I was initially searching for a SQL injection 💉 vulnerability due to the   extension and the presence of an   parameter in the URL, I stumbled upon something unexpected—a misconfigured AWS S3 bucket. Here’s a detailed 👌 breakdown of the vulnerability, how I found it, and its potential impact. Unrestricted Remote File Upload and Deletion. The vulnerability I found allows anyone with the correct S3 bucket URL to upload and delete files without authentication ☠️ This can be dangerous as it exposes the bucket to unauthorized users, allowing them to manipulate files, upload malicious content, or even delete crucial data. 1. Inspect the Page Source: I started by viewing the page source of the gallery page: Here, I noticed a reference to an S3 bucket URL(images of the website are hosted on this aws s3 bucket): 2. Set Up AWS CLI: To interact with the bucket, I set up the AWS Command Line Interface (CLI) using Kali Linux. If you’re unfamiliar with AWS CLI installation, here’s a helpful guide: 3. List the Bucket's Contents: Once AWS CLI was ready, I ran the following command to check the files in the bucket: 4. Upload a Test File: I created a simple text file called testput.txt and used the following command to upload it: 5. Verify the Upload: To confirm the file was successfully uploaded, I accessed it directly via the S3 bucket URL: 6. Delete the File: Finally, I deleted the file using this command: This vulnerability opens up several potential risks:  Attackers can upload malicious files to the S3 bucket, which could be used for phishing, malware distribution, or other harmful purposes.  Important files could be deleted or replaced, resulting in the loss of critical data.  The bucket could be exploited to host malicious content, turning it into a platform for cyberattacks. By failing to properly configure the S3 bucket's permissions, the web application exposed sensitive file operations to unauthorized users. This vulnerability can have severe consequences, and it’s crucial for developers to always ensure their S3 buckets are secured against such threats. Special thanks 😊 to   🙏 for his detailed write-up on AWS S3 bucket 🪣 exploitation. Without his article, I wouldn’t have been able to discover this vulnerability. 🫂 InfoSec Write-ups Help Status About Careers Press Blog Privacy Terms Text to speech Teams", "summary": "Vulnerability allows anyone with the correct S3 bucket URL to upload and delete files without authentication. This can be dangerous as it exposes the bucket to unauthorized users. Attackers can upload malicious files to the bucket, which could be used for phishing, malware distribution, or other harmful purposes.", "category": ["phishing", "malware", "vulnerability"]},
